TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Tue Dec 22 14:24:57 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/f2802x/v125/DSP2802x_common/source/DS
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\BenBracy\Documents\TI FOC\proj_lab09\Flash")
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("GpioCtrlRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GpioCtrlRegs")

      63 0000000c 1AED          OR        *+XAR5[5],#0x0300     ; [CPU_] |63| 
         0000000d 0300 
      64                      .dwpsn  file "C:/ti/controlSUITE/device_support/f2802x/v125/DSP2802x_common/source/DSP2802x_I2C.c",li
      65 0000000e 1A05!         OR        @_GpioCtrlRegs+5,#0x0c00 ; [CPU_] |64| 
         0000000f 0C00 
      66                      .dwpsn  file "C:/ti/controlSUITE/device_support/f2802x/v125/DSP2802x_common/source/DSP2802x_I2C.c",li
      67 00000010 CC95          AND       AL,*+XAR5[AR0],#0xfeff ; [CPU_] |73| 
         00000011 FEFF 
      68 00000012 1AA9          OR        AL,#0x0200            ; [CPU_] |73| 
         00000013 0200 
      69 00000014 9609!         MOV       @_GpioCtrlRegs+9,AL   ; [CPU_] |73| 
      70                      .dwpsn  file "C:/ti/controlSUITE/device_support/f2802x/v125/DSP2802x_common/source/DSP2802x_I2C.c",li
      71 00000015 CC09!         AND       AL,@_GpioCtrlRegs+9,#0xfbff ; [CPU_] |74| 
         00000016 FBFF 
      72 00000017 1AA9          OR        AL,#0x0800            ; [CPU_] |74| 
         00000018 0800 
      73 00000019 9609!         MOV       @_GpioCtrlRegs+9,AL   ; [CPU_] |74| 
      74 0000001a 761A   EDIS
      75 0000001b FF69          SPM       #0                    ; [CPU_] 
      76              $C$DW$3 .dwtag  DW_TAG_TI_branch
      77                      .dwattr $C$DW$3, DW_AT_low_pc(0x00)
      78                      .dwattr $C$DW$3, DW_AT_TI_return
      79 0000001c 0006          LRETR     ; [CPU_] 
      80                      ; return occurs ; [] 
      81                      .dwattr $C$DW$2, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/f2802x/v125/DSP2802x_common/sou
      82                      .dwattr $C$DW$2, DW_AT_TI_end_line(0x50)
      83                      .dwattr $C$DW$2, DW_AT_TI_end_column(0x01)
      84                      .dwendentry
      85                      .dwendtag $C$DW$2
      86              
      87 0000001d               .sect   ".text"
      88                      .clink
      89                      .global _InitI2C
      90              
      91              $C$DW$4 .dwtag  DW_TAG_subprogram, DW_AT_name("InitI2C")
      92                      .dwattr $C$DW$4, DW_AT_low_pc(_InitI2C)
      93                      .dwattr $C$DW$4, DW_AT_high_pc(0x00)
      94                      .dwattr $C$DW$4, DW_AT_TI_symbol_name("_InitI2C")
      95                      .dwattr $C$DW$4, DW_AT_external
      96                      .dwattr $C$DW$4, DW_AT_TI_begin_file("C:/ti/controlSUITE/device_support/f2802x/v125/DSP2802x_common/s
      97                      .dwattr $C$DW$4, DW_AT_TI_begin_line(0x16)
      98                      .dwattr $C$DW$4, DW_AT_TI_begin_column(0x06)
      99                      .dwattr $C$DW$4, DW_AT_TI_max_frame_size(-2)
     100                      .dwpsn  file "C:/ti/controlSUITE/device_support/f2802x/v125/DSP2802x_common/source/DSP2802x_I2C.c",li
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE    3

     101              
     102                      .dwfde $C$DW$CIE, _InitI2C
     103              
     104              ;***************************************************************
     105              ;* FNAME: _InitI2C                      FR SIZE:   0           *
     106              ;*                                                             *
     107              ;* FUNCTION ENVIRONMENT                                        *
     108              ;*                                                             *
     109              ;* FUNCTION PROPERTIES                                         *
     110              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     111              ;***************************************************************
     112              
     113 0000001d       _InitI2C:
     114                      .dwcfi  cfa_offset, -2
     115                      .dwcfi  save_reg_to_mem, 26, 0
     116              $C$DW$5 .dwtag  DW_TAG_TI_branch
     117                      .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     118                      .dwattr $C$DW$5, DW_AT_TI_return
     119 0000001d 0006          LRETR     ; [CPU_] 
     120                      ; return occurs ; [] 
     121                      .dwattr $C$DW$4, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/f2802x/v125/DSP2802x_common/sou
     122                      .dwattr $C$DW$4, DW_AT_TI_end_line(0x1b)
     123                      .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     124                      .dwendentry
     125                      .dwendtag $C$DW$4
     126              
     127              ;**************************************************************
     128              ;* UNDEFINED EXTERNAL REFERENCES                              *
     129              ;**************************************************************
     130                      .global _GpioCtrlRegs
     131              
     132              ;***************************************************************
     133              ;* TYPE INFORMATION                                            *
     134              ;***************************************************************
     135              
     136              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     137                      .dwattr $C$DW$T$20, DW_AT_name("AIODAT_BITS")
     138                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     139              $C$DW$6 .dwtag  DW_TAG_member
     140                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     141                      .dwattr $C$DW$6, DW_AT_name("rsvd1")
     142                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_rsvd1")
     143                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     144                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     145                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     146              $C$DW$7 .dwtag  DW_TAG_member
     147                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     148                      .dwattr $C$DW$7, DW_AT_name("rsvd2")
     149                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_rsvd2")
     150                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     151                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     152                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     153              $C$DW$8 .dwtag  DW_TAG_member
     154                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     155                      .dwattr $C$DW$8, DW_AT_name("AIO2")
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE    4

     156                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_AIO2")
     157                      .dwattr $C$DW$8, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     158                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     159                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     160              $C$DW$9 .dwtag  DW_TAG_member
     161                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     162                      .dwattr $C$DW$9, DW_AT_name("rsvd3")
     163                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_rsvd3")
     164                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     165                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     166                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     167              $C$DW$10        .dwtag  DW_TAG_member
     168                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     169                      .dwattr $C$DW$10, DW_AT_name("AIO4")
     170                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_AIO4")
     171                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     172                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     173                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     174              $C$DW$11        .dwtag  DW_TAG_member
     175                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     176                      .dwattr $C$DW$11, DW_AT_name("rsvd4")
     177                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_rsvd4")
     178                      .dwattr $C$DW$11, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     179                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     180                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     181              $C$DW$12        .dwtag  DW_TAG_member
     182                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     183                      .dwattr $C$DW$12, DW_AT_name("AIO6")
     184                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_AIO6")
     185                      .dwattr $C$DW$12, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     186                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     187                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     188              $C$DW$13        .dwtag  DW_TAG_member
     189                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     190                      .dwattr $C$DW$13, DW_AT_name("rsvd5")
     191                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_rsvd5")
     192                      .dwattr $C$DW$13, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     193                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     194                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     195              $C$DW$14        .dwtag  DW_TAG_member
     196                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     197                      .dwattr $C$DW$14, DW_AT_name("rsvd6")
     198                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_rsvd6")
     199                      .dwattr $C$DW$14, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     200                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     201                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     202              $C$DW$15        .dwtag  DW_TAG_member
     203                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     204                      .dwattr $C$DW$15, DW_AT_name("rsvd7")
     205                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_rsvd7")
     206                      .dwattr $C$DW$15, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     207                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     208                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     209              $C$DW$16        .dwtag  DW_TAG_member
     210                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE    5

     211                      .dwattr $C$DW$16, DW_AT_name("AIO10")
     212                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_AIO10")
     213                      .dwattr $C$DW$16, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     214                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     215                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     216              $C$DW$17        .dwtag  DW_TAG_member
     217                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     218                      .dwattr $C$DW$17, DW_AT_name("rsvd8")
     219                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_rsvd8")
     220                      .dwattr $C$DW$17, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     221                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     222                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     223              $C$DW$18        .dwtag  DW_TAG_member
     224                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     225                      .dwattr $C$DW$18, DW_AT_name("AIO12")
     226                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_AIO12")
     227                      .dwattr $C$DW$18, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     228                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     229                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     230              $C$DW$19        .dwtag  DW_TAG_member
     231                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     232                      .dwattr $C$DW$19, DW_AT_name("rsvd9")
     233                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_rsvd9")
     234                      .dwattr $C$DW$19, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     235                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     236                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     237              $C$DW$20        .dwtag  DW_TAG_member
     238                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     239                      .dwattr $C$DW$20, DW_AT_name("AIO14")
     240                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_AIO14")
     241                      .dwattr $C$DW$20, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     242                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     243                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     244              $C$DW$21        .dwtag  DW_TAG_member
     245                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     246                      .dwattr $C$DW$21, DW_AT_name("rsvd10")
     247                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_rsvd10")
     248                      .dwattr $C$DW$21, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     249                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     250                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     251                      .dwendtag $C$DW$T$20
     252              
     253              
     254              $C$DW$T$21      .dwtag  DW_TAG_union_type
     255                      .dwattr $C$DW$T$21, DW_AT_name("AIODAT_REG")
     256                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     257              $C$DW$22        .dwtag  DW_TAG_member
     258                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     259                      .dwattr $C$DW$22, DW_AT_name("all")
     260                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_all")
     261                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     262                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     263              $C$DW$23        .dwtag  DW_TAG_member
     264                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$20)
     265                      .dwattr $C$DW$23, DW_AT_name("bit")
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE    6

     266                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_bit")
     267                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     268                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     269                      .dwendtag $C$DW$T$21
     270              
     271              
     272              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     273                      .dwattr $C$DW$T$22, DW_AT_name("AIO_BITS")
     274                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     275              $C$DW$24        .dwtag  DW_TAG_member
     276                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     277                      .dwattr $C$DW$24, DW_AT_name("rsvd1")
     278                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_rsvd1")
     279                      .dwattr $C$DW$24, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     280                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     281                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     282              $C$DW$25        .dwtag  DW_TAG_member
     283                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     284                      .dwattr $C$DW$25, DW_AT_name("rsvd2")
     285                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_rsvd2")
     286                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     287                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     288                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     289              $C$DW$26        .dwtag  DW_TAG_member
     290                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     291                      .dwattr $C$DW$26, DW_AT_name("AIO2")
     292                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_AIO2")
     293                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     294                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     295                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     296              $C$DW$27        .dwtag  DW_TAG_member
     297                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     298                      .dwattr $C$DW$27, DW_AT_name("rsvd3")
     299                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_rsvd3")
     300                      .dwattr $C$DW$27, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     301                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     302                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     303              $C$DW$28        .dwtag  DW_TAG_member
     304                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     305                      .dwattr $C$DW$28, DW_AT_name("AIO4")
     306                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_AIO4")
     307                      .dwattr $C$DW$28, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     308                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     309                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     310              $C$DW$29        .dwtag  DW_TAG_member
     311                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     312                      .dwattr $C$DW$29, DW_AT_name("rsvd4")
     313                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_rsvd4")
     314                      .dwattr $C$DW$29, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     315                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     316                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     317              $C$DW$30        .dwtag  DW_TAG_member
     318                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     319                      .dwattr $C$DW$30, DW_AT_name("AIO6")
     320                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_AIO6")
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE    7

     321                      .dwattr $C$DW$30, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     322                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     323                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     324              $C$DW$31        .dwtag  DW_TAG_member
     325                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     326                      .dwattr $C$DW$31, DW_AT_name("rsvd5")
     327                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd5")
     328                      .dwattr $C$DW$31, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     329                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     330                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     331              $C$DW$32        .dwtag  DW_TAG_member
     332                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     333                      .dwattr $C$DW$32, DW_AT_name("rsvd6")
     334                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd6")
     335                      .dwattr $C$DW$32, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     336                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     337                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     338              $C$DW$33        .dwtag  DW_TAG_member
     339                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     340                      .dwattr $C$DW$33, DW_AT_name("rsvd7")
     341                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd7")
     342                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     343                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     344                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     345              $C$DW$34        .dwtag  DW_TAG_member
     346                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     347                      .dwattr $C$DW$34, DW_AT_name("AIO10")
     348                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_AIO10")
     349                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     350                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     351                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     352              $C$DW$35        .dwtag  DW_TAG_member
     353                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     354                      .dwattr $C$DW$35, DW_AT_name("rsvd8")
     355                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd8")
     356                      .dwattr $C$DW$35, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     357                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     358                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     359              $C$DW$36        .dwtag  DW_TAG_member
     360                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     361                      .dwattr $C$DW$36, DW_AT_name("AIO12")
     362                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_AIO12")
     363                      .dwattr $C$DW$36, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     364                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     365                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     366              $C$DW$37        .dwtag  DW_TAG_member
     367                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     368                      .dwattr $C$DW$37, DW_AT_name("rsvd9")
     369                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_rsvd9")
     370                      .dwattr $C$DW$37, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     371                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     372                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     373              $C$DW$38        .dwtag  DW_TAG_member
     374                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     375                      .dwattr $C$DW$38, DW_AT_name("AIO14")
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE    8

     376                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_AIO14")
     377                      .dwattr $C$DW$38, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     378                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     379                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     380              $C$DW$39        .dwtag  DW_TAG_member
     381                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     382                      .dwattr $C$DW$39, DW_AT_name("rsvd10")
     383                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd10")
     384                      .dwattr $C$DW$39, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     385                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     386                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     387                      .dwendtag $C$DW$T$22
     388              
     389              
     390              $C$DW$T$24      .dwtag  DW_TAG_union_type
     391                      .dwattr $C$DW$T$24, DW_AT_name("AIO_REG")
     392                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     393              $C$DW$40        .dwtag  DW_TAG_member
     394                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$23)
     395                      .dwattr $C$DW$40, DW_AT_name("all")
     396                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_all")
     397                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     398                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     399              $C$DW$41        .dwtag  DW_TAG_member
     400                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$22)
     401                      .dwattr $C$DW$41, DW_AT_name("bit")
     402                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_bit")
     403                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     404                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     405                      .dwendtag $C$DW$T$24
     406              
     407              
     408              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     409                      .dwattr $C$DW$T$25, DW_AT_name("GPA1_BITS")
     410                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     411              $C$DW$42        .dwtag  DW_TAG_member
     412                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     413                      .dwattr $C$DW$42, DW_AT_name("GPIO0")
     414                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_GPIO0")
     415                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     416                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     417                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     418              $C$DW$43        .dwtag  DW_TAG_member
     419                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     420                      .dwattr $C$DW$43, DW_AT_name("GPIO1")
     421                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_GPIO1")
     422                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     423                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     424                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     425              $C$DW$44        .dwtag  DW_TAG_member
     426                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     427                      .dwattr $C$DW$44, DW_AT_name("GPIO2")
     428                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIO2")
     429                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     430                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE    9

     431                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     432              $C$DW$45        .dwtag  DW_TAG_member
     433                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     434                      .dwattr $C$DW$45, DW_AT_name("GPIO3")
     435                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIO3")
     436                      .dwattr $C$DW$45, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     437                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     438                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     439              $C$DW$46        .dwtag  DW_TAG_member
     440                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     441                      .dwattr $C$DW$46, DW_AT_name("GPIO4")
     442                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIO4")
     443                      .dwattr $C$DW$46, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     444                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     445                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     446              $C$DW$47        .dwtag  DW_TAG_member
     447                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     448                      .dwattr $C$DW$47, DW_AT_name("GPIO5")
     449                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIO5")
     450                      .dwattr $C$DW$47, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     451                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     452                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     453              $C$DW$48        .dwtag  DW_TAG_member
     454                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     455                      .dwattr $C$DW$48, DW_AT_name("GPIO6")
     456                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO6")
     457                      .dwattr $C$DW$48, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     458                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     459                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     460              $C$DW$49        .dwtag  DW_TAG_member
     461                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     462                      .dwattr $C$DW$49, DW_AT_name("GPIO7")
     463                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIO7")
     464                      .dwattr $C$DW$49, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     465                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     466                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     467              $C$DW$50        .dwtag  DW_TAG_member
     468                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     469                      .dwattr $C$DW$50, DW_AT_name("GPIO8")
     470                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO8")
     471                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     472                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     473                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     474              $C$DW$51        .dwtag  DW_TAG_member
     475                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     476                      .dwattr $C$DW$51, DW_AT_name("GPIO9")
     477                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO9")
     478                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     479                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     480                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     481              $C$DW$52        .dwtag  DW_TAG_member
     482                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     483                      .dwattr $C$DW$52, DW_AT_name("GPIO10")
     484                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIO10")
     485                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   10

     486                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     487                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     488              $C$DW$53        .dwtag  DW_TAG_member
     489                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     490                      .dwattr $C$DW$53, DW_AT_name("GPIO11")
     491                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO11")
     492                      .dwattr $C$DW$53, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     493                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     494                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     495              $C$DW$54        .dwtag  DW_TAG_member
     496                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     497                      .dwattr $C$DW$54, DW_AT_name("GPIO12")
     498                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO12")
     499                      .dwattr $C$DW$54, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     500                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     501                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     502              $C$DW$55        .dwtag  DW_TAG_member
     503                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     504                      .dwattr $C$DW$55, DW_AT_name("GPIO13")
     505                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO13")
     506                      .dwattr $C$DW$55, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     507                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     508                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     509              $C$DW$56        .dwtag  DW_TAG_member
     510                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     511                      .dwattr $C$DW$56, DW_AT_name("GPIO14")
     512                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO14")
     513                      .dwattr $C$DW$56, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     514                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     515                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     516              $C$DW$57        .dwtag  DW_TAG_member
     517                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     518                      .dwattr $C$DW$57, DW_AT_name("GPIO15")
     519                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO15")
     520                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     521                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     522                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     523                      .dwendtag $C$DW$T$25
     524              
     525              
     526              $C$DW$T$26      .dwtag  DW_TAG_union_type
     527                      .dwattr $C$DW$T$26, DW_AT_name("GPA1_REG")
     528                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     529              $C$DW$58        .dwtag  DW_TAG_member
     530                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$23)
     531                      .dwattr $C$DW$58, DW_AT_name("all")
     532                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_all")
     533                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     534                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     535              $C$DW$59        .dwtag  DW_TAG_member
     536                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$25)
     537                      .dwattr $C$DW$59, DW_AT_name("bit")
     538                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_bit")
     539                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     540                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   11

     541                      .dwendtag $C$DW$T$26
     542              
     543              
     544              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     545                      .dwattr $C$DW$T$27, DW_AT_name("GPA2_BITS")
     546                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     547              $C$DW$60        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     549                      .dwattr $C$DW$60, DW_AT_name("GPIO16")
     550                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO16")
     551                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     552                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     553                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     554              $C$DW$61        .dwtag  DW_TAG_member
     555                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     556                      .dwattr $C$DW$61, DW_AT_name("GPIO17")
     557                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO17")
     558                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     559                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     560                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     561              $C$DW$62        .dwtag  DW_TAG_member
     562                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     563                      .dwattr $C$DW$62, DW_AT_name("GPIO18")
     564                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO18")
     565                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     566                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     567                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     568              $C$DW$63        .dwtag  DW_TAG_member
     569                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     570                      .dwattr $C$DW$63, DW_AT_name("GPIO19")
     571                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO19")
     572                      .dwattr $C$DW$63, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     573                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     574                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     575              $C$DW$64        .dwtag  DW_TAG_member
     576                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     577                      .dwattr $C$DW$64, DW_AT_name("GPIO20")
     578                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO20")
     579                      .dwattr $C$DW$64, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     580                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     581                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     582              $C$DW$65        .dwtag  DW_TAG_member
     583                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     584                      .dwattr $C$DW$65, DW_AT_name("GPIO21")
     585                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO21")
     586                      .dwattr $C$DW$65, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     587                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     588                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     589              $C$DW$66        .dwtag  DW_TAG_member
     590                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     591                      .dwattr $C$DW$66, DW_AT_name("GPIO22")
     592                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO22")
     593                      .dwattr $C$DW$66, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     594                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     595                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   12

     596              $C$DW$67        .dwtag  DW_TAG_member
     597                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     598                      .dwattr $C$DW$67, DW_AT_name("GPIO23")
     599                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO23")
     600                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     601                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     602                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     603              $C$DW$68        .dwtag  DW_TAG_member
     604                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     605                      .dwattr $C$DW$68, DW_AT_name("GPIO24")
     606                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO24")
     607                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     608                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     609                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     610              $C$DW$69        .dwtag  DW_TAG_member
     611                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     612                      .dwattr $C$DW$69, DW_AT_name("GPIO25")
     613                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO25")
     614                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     615                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     616                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     617              $C$DW$70        .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     619                      .dwattr $C$DW$70, DW_AT_name("GPIO26")
     620                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO26")
     621                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     622                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     623                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     624              $C$DW$71        .dwtag  DW_TAG_member
     625                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     626                      .dwattr $C$DW$71, DW_AT_name("GPIO27")
     627                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO27")
     628                      .dwattr $C$DW$71, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     629                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     630                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     631              $C$DW$72        .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     633                      .dwattr $C$DW$72, DW_AT_name("GPIO28")
     634                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO28")
     635                      .dwattr $C$DW$72, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     636                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     637                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     638              $C$DW$73        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     640                      .dwattr $C$DW$73, DW_AT_name("GPIO29")
     641                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO29")
     642                      .dwattr $C$DW$73, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     643                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     644                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     645              $C$DW$74        .dwtag  DW_TAG_member
     646                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     647                      .dwattr $C$DW$74, DW_AT_name("GPIO30")
     648                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO30")
     649                      .dwattr $C$DW$74, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     650                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   13

     651                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     652              $C$DW$75        .dwtag  DW_TAG_member
     653                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     654                      .dwattr $C$DW$75, DW_AT_name("GPIO31")
     655                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO31")
     656                      .dwattr $C$DW$75, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     657                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     658                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     659                      .dwendtag $C$DW$T$27
     660              
     661              
     662              $C$DW$T$28      .dwtag  DW_TAG_union_type
     663                      .dwattr $C$DW$T$28, DW_AT_name("GPA2_REG")
     664                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     665              $C$DW$76        .dwtag  DW_TAG_member
     666                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$23)
     667                      .dwattr $C$DW$76, DW_AT_name("all")
     668                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_all")
     669                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     670                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     671              $C$DW$77        .dwtag  DW_TAG_member
     672                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$27)
     673                      .dwattr $C$DW$77, DW_AT_name("bit")
     674                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_bit")
     675                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     676                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     677                      .dwendtag $C$DW$T$28
     678              
     679              
     680              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     681                      .dwattr $C$DW$T$29, DW_AT_name("GPACTRL_BITS")
     682                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     683              $C$DW$78        .dwtag  DW_TAG_member
     684                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     685                      .dwattr $C$DW$78, DW_AT_name("QUALPRD0")
     686                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_QUALPRD0")
     687                      .dwattr $C$DW$78, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
     688                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     689                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     690              $C$DW$79        .dwtag  DW_TAG_member
     691                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     692                      .dwattr $C$DW$79, DW_AT_name("QUALPRD1")
     693                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_QUALPRD1")
     694                      .dwattr $C$DW$79, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     695                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     696                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     697              $C$DW$80        .dwtag  DW_TAG_member
     698                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     699                      .dwattr $C$DW$80, DW_AT_name("QUALPRD2")
     700                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_QUALPRD2")
     701                      .dwattr $C$DW$80, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
     702                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     703                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     704              $C$DW$81        .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   14

     706                      .dwattr $C$DW$81, DW_AT_name("QUALPRD3")
     707                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_QUALPRD3")
     708                      .dwattr $C$DW$81, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     709                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     710                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     711                      .dwendtag $C$DW$T$29
     712              
     713              
     714              $C$DW$T$30      .dwtag  DW_TAG_union_type
     715                      .dwattr $C$DW$T$30, DW_AT_name("GPACTRL_REG")
     716                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     717              $C$DW$82        .dwtag  DW_TAG_member
     718                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$23)
     719                      .dwattr $C$DW$82, DW_AT_name("all")
     720                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_all")
     721                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     722                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     723              $C$DW$83        .dwtag  DW_TAG_member
     724                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$29)
     725                      .dwattr $C$DW$83, DW_AT_name("bit")
     726                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_bit")
     727                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     728                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     729                      .dwendtag $C$DW$T$30
     730              
     731              
     732              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     733                      .dwattr $C$DW$T$31, DW_AT_name("GPADAT_BITS")
     734                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     735              $C$DW$84        .dwtag  DW_TAG_member
     736                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     737                      .dwattr $C$DW$84, DW_AT_name("GPIO0")
     738                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO0")
     739                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     740                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     741                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     742              $C$DW$85        .dwtag  DW_TAG_member
     743                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     744                      .dwattr $C$DW$85, DW_AT_name("GPIO1")
     745                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO1")
     746                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     747                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     748                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     749              $C$DW$86        .dwtag  DW_TAG_member
     750                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     751                      .dwattr $C$DW$86, DW_AT_name("GPIO2")
     752                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO2")
     753                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     754                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     755                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     756              $C$DW$87        .dwtag  DW_TAG_member
     757                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     758                      .dwattr $C$DW$87, DW_AT_name("GPIO3")
     759                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO3")
     760                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   15

     761                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     762                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     763              $C$DW$88        .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     765                      .dwattr $C$DW$88, DW_AT_name("GPIO4")
     766                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO4")
     767                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     768                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     769                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     770              $C$DW$89        .dwtag  DW_TAG_member
     771                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     772                      .dwattr $C$DW$89, DW_AT_name("GPIO5")
     773                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO5")
     774                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     775                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     776                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     777              $C$DW$90        .dwtag  DW_TAG_member
     778                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     779                      .dwattr $C$DW$90, DW_AT_name("GPIO6")
     780                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO6")
     781                      .dwattr $C$DW$90, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     782                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     783                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     784              $C$DW$91        .dwtag  DW_TAG_member
     785                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     786                      .dwattr $C$DW$91, DW_AT_name("GPIO7")
     787                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO7")
     788                      .dwattr $C$DW$91, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     789                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     790                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     791              $C$DW$92        .dwtag  DW_TAG_member
     792                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     793                      .dwattr $C$DW$92, DW_AT_name("GPIO8")
     794                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO8")
     795                      .dwattr $C$DW$92, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     796                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     797                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     798              $C$DW$93        .dwtag  DW_TAG_member
     799                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     800                      .dwattr $C$DW$93, DW_AT_name("GPIO9")
     801                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO9")
     802                      .dwattr $C$DW$93, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     803                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     804                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     805              $C$DW$94        .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     807                      .dwattr $C$DW$94, DW_AT_name("GPIO10")
     808                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO10")
     809                      .dwattr $C$DW$94, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     810                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     811                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     812              $C$DW$95        .dwtag  DW_TAG_member
     813                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     814                      .dwattr $C$DW$95, DW_AT_name("GPIO11")
     815                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO11")
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   16

     816                      .dwattr $C$DW$95, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     817                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     818                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     819              $C$DW$96        .dwtag  DW_TAG_member
     820                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     821                      .dwattr $C$DW$96, DW_AT_name("GPIO12")
     822                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO12")
     823                      .dwattr $C$DW$96, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     824                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     825                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     826              $C$DW$97        .dwtag  DW_TAG_member
     827                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     828                      .dwattr $C$DW$97, DW_AT_name("GPIO13")
     829                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO13")
     830                      .dwattr $C$DW$97, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     831                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     832                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     833              $C$DW$98        .dwtag  DW_TAG_member
     834                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     835                      .dwattr $C$DW$98, DW_AT_name("GPIO14")
     836                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO14")
     837                      .dwattr $C$DW$98, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     838                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     839                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     840              $C$DW$99        .dwtag  DW_TAG_member
     841                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     842                      .dwattr $C$DW$99, DW_AT_name("GPIO15")
     843                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO15")
     844                      .dwattr $C$DW$99, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     845                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     846                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     847              $C$DW$100       .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     849                      .dwattr $C$DW$100, DW_AT_name("GPIO16")
     850                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO16")
     851                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     852                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     853                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     854              $C$DW$101       .dwtag  DW_TAG_member
     855                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     856                      .dwattr $C$DW$101, DW_AT_name("GPIO17")
     857                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO17")
     858                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     859                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     860                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     861              $C$DW$102       .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     863                      .dwattr $C$DW$102, DW_AT_name("GPIO18")
     864                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO18")
     865                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     866                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     867                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     868              $C$DW$103       .dwtag  DW_TAG_member
     869                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     870                      .dwattr $C$DW$103, DW_AT_name("GPIO19")
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   17

     871                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO19")
     872                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     873                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     874                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     875              $C$DW$104       .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     877                      .dwattr $C$DW$104, DW_AT_name("GPIO20")
     878                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO20")
     879                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     880                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     881                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     882              $C$DW$105       .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
     884                      .dwattr $C$DW$105, DW_AT_name("GPIO21")
     885                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO21")
     886                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     887                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     888                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     889              $C$DW$106       .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
     891                      .dwattr $C$DW$106, DW_AT_name("GPIO22")
     892                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO22")
     893                      .dwattr $C$DW$106, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     894                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     895                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     896              $C$DW$107       .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
     898                      .dwattr $C$DW$107, DW_AT_name("GPIO23")
     899                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO23")
     900                      .dwattr $C$DW$107, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     901                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     902                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     903              $C$DW$108       .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
     905                      .dwattr $C$DW$108, DW_AT_name("GPIO24")
     906                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO24")
     907                      .dwattr $C$DW$108, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     908                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     909                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     910              $C$DW$109       .dwtag  DW_TAG_member
     911                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
     912                      .dwattr $C$DW$109, DW_AT_name("GPIO25")
     913                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO25")
     914                      .dwattr $C$DW$109, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     915                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     916                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     917              $C$DW$110       .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
     919                      .dwattr $C$DW$110, DW_AT_name("GPIO26")
     920                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO26")
     921                      .dwattr $C$DW$110, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     922                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     923                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     924              $C$DW$111       .dwtag  DW_TAG_member
     925                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   18

     926                      .dwattr $C$DW$111, DW_AT_name("GPIO27")
     927                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO27")
     928                      .dwattr $C$DW$111, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     929                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     930                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     931              $C$DW$112       .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
     933                      .dwattr $C$DW$112, DW_AT_name("GPIO28")
     934                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO28")
     935                      .dwattr $C$DW$112, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     936                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     937                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     938              $C$DW$113       .dwtag  DW_TAG_member
     939                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
     940                      .dwattr $C$DW$113, DW_AT_name("GPIO29")
     941                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO29")
     942                      .dwattr $C$DW$113, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     943                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     944                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     945              $C$DW$114       .dwtag  DW_TAG_member
     946                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
     947                      .dwattr $C$DW$114, DW_AT_name("GPIO30")
     948                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO30")
     949                      .dwattr $C$DW$114, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     950                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     951                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     952              $C$DW$115       .dwtag  DW_TAG_member
     953                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
     954                      .dwattr $C$DW$115, DW_AT_name("GPIO31")
     955                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO31")
     956                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     957                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     958                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     959                      .dwendtag $C$DW$T$31
     960              
     961              
     962              $C$DW$T$32      .dwtag  DW_TAG_union_type
     963                      .dwattr $C$DW$T$32, DW_AT_name("GPADAT_REG")
     964                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
     965              $C$DW$116       .dwtag  DW_TAG_member
     966                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$23)
     967                      .dwattr $C$DW$116, DW_AT_name("all")
     968                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_all")
     969                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     970                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     971              $C$DW$117       .dwtag  DW_TAG_member
     972                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$31)
     973                      .dwattr $C$DW$117, DW_AT_name("bit")
     974                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_bit")
     975                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     976                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     977                      .dwendtag $C$DW$T$32
     978              
     979              
     980              $C$DW$T$33      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   19

     981                      .dwattr $C$DW$T$33, DW_AT_name("GPB1_BITS")
     982                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
     983              $C$DW$118       .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$118, DW_AT_name("GPIO32")
     986                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO32")
     987                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     988                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     989                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     990              $C$DW$119       .dwtag  DW_TAG_member
     991                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
     992                      .dwattr $C$DW$119, DW_AT_name("GPIO33")
     993                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO33")
     994                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     995                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     996                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     997              $C$DW$120       .dwtag  DW_TAG_member
     998                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
     999                      .dwattr $C$DW$120, DW_AT_name("GPIO34")
    1000                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO34")
    1001                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1002                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1004              $C$DW$121       .dwtag  DW_TAG_member
    1005                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1006                      .dwattr $C$DW$121, DW_AT_name("GPIO35")
    1007                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO35")
    1008                      .dwattr $C$DW$121, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1009                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1010                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1011              $C$DW$122       .dwtag  DW_TAG_member
    1012                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1013                      .dwattr $C$DW$122, DW_AT_name("GPIO36")
    1014                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO36")
    1015                      .dwattr $C$DW$122, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1016                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1018              $C$DW$123       .dwtag  DW_TAG_member
    1019                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1020                      .dwattr $C$DW$123, DW_AT_name("GPIO37")
    1021                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO37")
    1022                      .dwattr $C$DW$123, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1023                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1025              $C$DW$124       .dwtag  DW_TAG_member
    1026                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1027                      .dwattr $C$DW$124, DW_AT_name("GPIO38")
    1028                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO38")
    1029                      .dwattr $C$DW$124, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1030                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1031                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1032              $C$DW$125       .dwtag  DW_TAG_member
    1033                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1034                      .dwattr $C$DW$125, DW_AT_name("rsvd1")
    1035                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   20

    1036                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1037                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1038                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1039              $C$DW$126       .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1041                      .dwattr $C$DW$126, DW_AT_name("rsvd2")
    1042                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd2")
    1043                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1044                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1045                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1046                      .dwendtag $C$DW$T$33
    1047              
    1048              
    1049              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1050                      .dwattr $C$DW$T$34, DW_AT_name("GPB1_REG")
    1051                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1052              $C$DW$127       .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$23)
    1054                      .dwattr $C$DW$127, DW_AT_name("all")
    1055                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_all")
    1056                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1057                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1058              $C$DW$128       .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$33)
    1060                      .dwattr $C$DW$128, DW_AT_name("bit")
    1061                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_bit")
    1062                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1064                      .dwendtag $C$DW$T$34
    1065              
    1066              
    1067              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1068                      .dwattr $C$DW$T$35, DW_AT_name("GPBCTRL_BITS")
    1069                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1070              $C$DW$129       .dwtag  DW_TAG_member
    1071                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1072                      .dwattr $C$DW$129, DW_AT_name("QUALPRD0")
    1073                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_QUALPRD0")
    1074                      .dwattr $C$DW$129, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1075                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1077              $C$DW$130       .dwtag  DW_TAG_member
    1078                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1079                      .dwattr $C$DW$130, DW_AT_name("rsvd1")
    1080                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd1")
    1081                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1082                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1083                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1084              $C$DW$131       .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1086                      .dwattr $C$DW$131, DW_AT_name("rsvd2")
    1087                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd2")
    1088                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1089                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1090                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   21

    1091                      .dwendtag $C$DW$T$35
    1092              
    1093              
    1094              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1095                      .dwattr $C$DW$T$36, DW_AT_name("GPBCTRL_REG")
    1096                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1097              $C$DW$132       .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$23)
    1099                      .dwattr $C$DW$132, DW_AT_name("all")
    1100                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_all")
    1101                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1102                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1103              $C$DW$133       .dwtag  DW_TAG_member
    1104                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$35)
    1105                      .dwattr $C$DW$133, DW_AT_name("bit")
    1106                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_bit")
    1107                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1108                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1109                      .dwendtag $C$DW$T$36
    1110              
    1111              
    1112              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1113                      .dwattr $C$DW$T$37, DW_AT_name("GPBDAT_BITS")
    1114                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1115              $C$DW$134       .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1117                      .dwattr $C$DW$134, DW_AT_name("GPIO32")
    1118                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO32")
    1119                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1120                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1121                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1122              $C$DW$135       .dwtag  DW_TAG_member
    1123                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1124                      .dwattr $C$DW$135, DW_AT_name("GPIO33")
    1125                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO33")
    1126                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1127                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1128                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1129              $C$DW$136       .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1131                      .dwattr $C$DW$136, DW_AT_name("GPIO34")
    1132                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO34")
    1133                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1134                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1136              $C$DW$137       .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1138                      .dwattr $C$DW$137, DW_AT_name("GPIO35")
    1139                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO35")
    1140                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1141                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1143              $C$DW$138       .dwtag  DW_TAG_member
    1144                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1145                      .dwattr $C$DW$138, DW_AT_name("GPIO36")
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   22

    1146                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO36")
    1147                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1148                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1149                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1150              $C$DW$139       .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1152                      .dwattr $C$DW$139, DW_AT_name("GPIO37")
    1153                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO37")
    1154                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1155                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1156                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1157              $C$DW$140       .dwtag  DW_TAG_member
    1158                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1159                      .dwattr $C$DW$140, DW_AT_name("GPIO38")
    1160                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO38")
    1161                      .dwattr $C$DW$140, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1162                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1163                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1164              $C$DW$141       .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1166                      .dwattr $C$DW$141, DW_AT_name("rsvd1")
    1167                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd1")
    1168                      .dwattr $C$DW$141, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
    1169                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1170                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1171              $C$DW$142       .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1173                      .dwattr $C$DW$142, DW_AT_name("rsvd2")
    1174                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd2")
    1175                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1176                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1177                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1178                      .dwendtag $C$DW$T$37
    1179              
    1180              
    1181              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1182                      .dwattr $C$DW$T$38, DW_AT_name("GPBDAT_REG")
    1183                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1184              $C$DW$143       .dwtag  DW_TAG_member
    1185                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$23)
    1186                      .dwattr $C$DW$143, DW_AT_name("all")
    1187                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_all")
    1188                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1189                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1190              $C$DW$144       .dwtag  DW_TAG_member
    1191                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$37)
    1192                      .dwattr $C$DW$144, DW_AT_name("bit")
    1193                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_bit")
    1194                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1195                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1196                      .dwendtag $C$DW$T$38
    1197              
    1198              
    1199              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1200                      .dwattr $C$DW$T$41, DW_AT_name("GPIO_CTRL_REGS")
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   23

    1201                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x40)
    1202              $C$DW$145       .dwtag  DW_TAG_member
    1203                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$30)
    1204                      .dwattr $C$DW$145, DW_AT_name("GPACTRL")
    1205                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPACTRL")
    1206                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1207                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1208              $C$DW$146       .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$26)
    1210                      .dwattr $C$DW$146, DW_AT_name("GPAQSEL1")
    1211                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPAQSEL1")
    1212                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1213                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1214              $C$DW$147       .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$28)
    1216                      .dwattr $C$DW$147, DW_AT_name("GPAQSEL2")
    1217                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPAQSEL2")
    1218                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1219                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1220              $C$DW$148       .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$26)
    1222                      .dwattr $C$DW$148, DW_AT_name("GPAMUX1")
    1223                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPAMUX1")
    1224                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1225                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1226              $C$DW$149       .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$28)
    1228                      .dwattr $C$DW$149, DW_AT_name("GPAMUX2")
    1229                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPAMUX2")
    1230                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1231                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1232              $C$DW$150       .dwtag  DW_TAG_member
    1233                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$32)
    1234                      .dwattr $C$DW$150, DW_AT_name("GPADIR")
    1235                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPADIR")
    1236                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1237                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1238              $C$DW$151       .dwtag  DW_TAG_member
    1239                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$32)
    1240                      .dwattr $C$DW$151, DW_AT_name("GPAPUD")
    1241                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPAPUD")
    1242                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1243                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1244              $C$DW$152       .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$23)
    1246                      .dwattr $C$DW$152, DW_AT_name("rsvd1")
    1247                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd1")
    1248                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1249                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1250              $C$DW$153       .dwtag  DW_TAG_member
    1251                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$36)
    1252                      .dwattr $C$DW$153, DW_AT_name("GPBCTRL")
    1253                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPBCTRL")
    1254                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1255                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Tue Dec 22 14:24:57 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1366410                         PAGE   24

    1256              $C$DW$154       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$34)
    1258                      .dwattr $C$DW$154, DW_AT_name("GPBQSEL1")
    1259                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPBQSEL1")
    1260                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1261                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1262              $C$DW$155       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$23)
    1264                      .dwattr $C$DW$155, DW_AT_name("rsvd2")
    1265                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd2")
    1266                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1267                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1268              $C$DW$156       .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$34)
    1270                      .dwattr $C$DW$156, DW_AT_name("GPBMUX1")
    1271                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPBMUX1")
    1272                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1273                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1274              $C$DW$157       .dwtag  DW_TAG_member
    1275                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$23)
    1276                      .dwattr $C$DW$157, DW_AT_name("rsvd3")
    1277                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd3")
    1278                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1279                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1280              $C$DW$158       .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$38)
    1282                      .dwattr $C$DW$158, DW_AT_name("GPBDIR")
    1283                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPBDIR")
    1284                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1285                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1286              $C$DW$159       .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$38)
    1288                      .dwattr $C$DW$159, DW_AT_name("GPBPUD")
    1289                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPBPUD")
    1290                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1291                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1292              $C$DW$160       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$39)
