TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Wed Dec 23 10:18:14 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/development_kits/C2000_LaunchPad/f2802x_headers/sour
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\BenBracy\Documents\TI FOC\proj_lab09\Flash")
      13                      .global _EmuKey
      14 00000000       _EmuKey:        .usect  "EmuKeyVar",1,0,0
      15              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("EmuKey")

     181                      .global _AdcResult
     182 00000000       _AdcResult:     .usect  "AdcResultFile",32,1,0
     183              $C$DW$25        .dwtag  DW_TAG_variable, DW_AT_name("AdcResult")
     184                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_AdcResult")
     185                      .dwattr $C$DW$25, DW_AT_location[DW_OP_addr _AdcResult]
     186                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$309)
     187                      .dwattr $C$DW$25, DW_AT_external
     188                      .global _I2caRegs
     189 00000000       _I2caRegs:      .usect  "I2caRegsFile",34,1,0
     190              $C$DW$26        .dwtag  DW_TAG_variable, DW_AT_name("I2caRegs")
     191                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_I2caRegs")
     192                      .dwattr $C$DW$26, DW_AT_location[DW_OP_addr _I2caRegs]
     193                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$321)
     194                      .dwattr $C$DW$26, DW_AT_external
     195                      .global _EPwm3Regs
     196 00000000       _EPwm3Regs:     .usect  "EPwm3RegsFile",64,1,1
     197              $C$DW$27        .dwtag  DW_TAG_variable, DW_AT_name("EPwm3Regs")
     198                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_EPwm3Regs")
     199                      .dwattr $C$DW$27, DW_AT_location[DW_OP_addr _EPwm3Regs]
     200                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$316)
     201                      .dwattr $C$DW$27, DW_AT_external
     202                      .global _EPwm2Regs
     203 00000000       _EPwm2Regs:     .usect  "EPwm2RegsFile",64,1,1
     204              $C$DW$28        .dwtag  DW_TAG_variable, DW_AT_name("EPwm2Regs")
     205                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_EPwm2Regs")
     206                      .dwattr $C$DW$28, DW_AT_location[DW_OP_addr _EPwm2Regs]
     207                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$316)
     208                      .dwattr $C$DW$28, DW_AT_external
     209                      .global _EPwm4Regs
     210 00000000       _EPwm4Regs:     .usect  "EPwm4RegsFile",64,1,1
     211              $C$DW$29        .dwtag  DW_TAG_variable, DW_AT_name("EPwm4Regs")
     212                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_EPwm4Regs")
     213                      .dwattr $C$DW$29, DW_AT_location[DW_OP_addr _EPwm4Regs]
     214                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$316)
     215                      .dwattr $C$DW$29, DW_AT_external
     216                      .global _EPwm1Regs
     217 00000000       _EPwm1Regs:     .usect  "EPwm1RegsFile",64,1,1
     218              $C$DW$30        .dwtag  DW_TAG_variable, DW_AT_name("EPwm1Regs")
     219                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_EPwm1Regs")
     220                      .dwattr $C$DW$30, DW_AT_location[DW_OP_addr _EPwm1Regs]
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE    5

     221                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$316)
     222                      .dwattr $C$DW$30, DW_AT_external
     223                      .global _GpioCtrlRegs
     224 00000000       _GpioCtrlRegs:  .usect  "GpioCtrlRegsFile",64,1,1
     225              $C$DW$31        .dwtag  DW_TAG_variable, DW_AT_name("GpioCtrlRegs")
     226                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_GpioCtrlRegs")
     227                      .dwattr $C$DW$31, DW_AT_location[DW_OP_addr _GpioCtrlRegs]
     228                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$318)
     229                      .dwattr $C$DW$31, DW_AT_external
     230                      .global _AdcRegs
     231 00000000       _AdcRegs:       .usect  "AdcRegsFile",81,1,0
     232              $C$DW$32        .dwtag  DW_TAG_variable, DW_AT_name("AdcRegs")
     233                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_AdcRegs")
     234                      .dwattr $C$DW$32, DW_AT_location[DW_OP_addr _AdcRegs]
     235                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$308)
     236                      .dwattr $C$DW$32, DW_AT_external
     237                      .global _PieVectTable
     238 00000000       _PieVectTable:  .usect  "PieVectTableFile",256,1,1
     239              $C$DW$33        .dwtag  DW_TAG_variable, DW_AT_name("PieVectTable")
     240                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_PieVectTable")
     241                      .dwattr $C$DW$33, DW_AT_location[DW_OP_addr _PieVectTable]
     242                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$228)
     243                      .dwattr $C$DW$33, DW_AT_external
     244              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.2\bin\opt2000.exe C:\\Users\\BenBracy\\AppData\\Local\\Te
     245              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.2\bin\ac2000.exe -@C:\\Users\\BenBracy\\AppData\\Local\\T
     246              
     247              ;***************************************************************
     248              ;* TYPE INFORMATION                                            *
     249              ;***************************************************************
     250              
     251              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     252                      .dwattr $C$DW$T$20, DW_AT_name("ADCCTL1_BITS")
     253                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     254              $C$DW$34        .dwtag  DW_TAG_member
     255                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     256                      .dwattr $C$DW$34, DW_AT_name("TEMPCONV")
     257                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_TEMPCONV")
     258                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     259                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     260                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     261              $C$DW$35        .dwtag  DW_TAG_member
     262                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     263                      .dwattr $C$DW$35, DW_AT_name("VREFLOCONV")
     264                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_VREFLOCONV")
     265                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     266                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     267                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     268              $C$DW$36        .dwtag  DW_TAG_member
     269                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     270                      .dwattr $C$DW$36, DW_AT_name("INTPULSEPOS")
     271                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_INTPULSEPOS")
     272                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     273                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     274                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     275              $C$DW$37        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE    6

     276                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     277                      .dwattr $C$DW$37, DW_AT_name("ADCREFSEL")
     278                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_ADCREFSEL")
     279                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     280                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     281                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     282              $C$DW$38        .dwtag  DW_TAG_member
     283                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     284                      .dwattr $C$DW$38, DW_AT_name("rsvd1")
     285                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd1")
     286                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     287                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     288                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     289              $C$DW$39        .dwtag  DW_TAG_member
     290                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     291                      .dwattr $C$DW$39, DW_AT_name("ADCREFPWD")
     292                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_ADCREFPWD")
     293                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     294                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     295                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     296              $C$DW$40        .dwtag  DW_TAG_member
     297                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     298                      .dwattr $C$DW$40, DW_AT_name("ADCBGPWD")
     299                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_ADCBGPWD")
     300                      .dwattr $C$DW$40, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     301                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     302                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     303              $C$DW$41        .dwtag  DW_TAG_member
     304                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     305                      .dwattr $C$DW$41, DW_AT_name("ADCPWDN")
     306                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_ADCPWDN")
     307                      .dwattr $C$DW$41, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     308                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     309                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     310              $C$DW$42        .dwtag  DW_TAG_member
     311                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     312                      .dwattr $C$DW$42, DW_AT_name("ADCBSYCHN")
     313                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_ADCBSYCHN")
     314                      .dwattr $C$DW$42, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
     315                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     316                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     317              $C$DW$43        .dwtag  DW_TAG_member
     318                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     319                      .dwattr $C$DW$43, DW_AT_name("ADCBSY")
     320                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_ADCBSY")
     321                      .dwattr $C$DW$43, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     322                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     323                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     324              $C$DW$44        .dwtag  DW_TAG_member
     325                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     326                      .dwattr $C$DW$44, DW_AT_name("ADCENABLE")
     327                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_ADCENABLE")
     328                      .dwattr $C$DW$44, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     329                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     330                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE    7

     331              $C$DW$45        .dwtag  DW_TAG_member
     332                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     333                      .dwattr $C$DW$45, DW_AT_name("RESET")
     334                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_RESET")
     335                      .dwattr $C$DW$45, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     336                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     337                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     338                      .dwendtag $C$DW$T$20
     339              
     340              
     341              $C$DW$T$21      .dwtag  DW_TAG_union_type
     342                      .dwattr $C$DW$T$21, DW_AT_name("ADCCTL1_REG")
     343                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     344              $C$DW$46        .dwtag  DW_TAG_member
     345                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     346                      .dwattr $C$DW$46, DW_AT_name("all")
     347                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_all")
     348                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     349                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     350              $C$DW$47        .dwtag  DW_TAG_member
     351                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$20)
     352                      .dwattr $C$DW$47, DW_AT_name("bit")
     353                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_bit")
     354                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     355                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     356                      .dwendtag $C$DW$T$21
     357              
     358              
     359              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     360                      .dwattr $C$DW$T$22, DW_AT_name("ADCCTL2_BITS")
     361                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     362              $C$DW$48        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     364                      .dwattr $C$DW$48, DW_AT_name("CLKDIV2EN")
     365                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_CLKDIV2EN")
     366                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     367                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     368                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     369              $C$DW$49        .dwtag  DW_TAG_member
     370                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     371                      .dwattr $C$DW$49, DW_AT_name("ADCNONOVERLAP")
     372                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_ADCNONOVERLAP")
     373                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     374                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     375                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     376              $C$DW$50        .dwtag  DW_TAG_member
     377                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     378                      .dwattr $C$DW$50, DW_AT_name("rsvd1")
     379                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_rsvd1")
     380                      .dwattr $C$DW$50, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     381                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     382                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     383                      .dwendtag $C$DW$T$22
     384              
     385              
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE    8

     386              $C$DW$T$23      .dwtag  DW_TAG_union_type
     387                      .dwattr $C$DW$T$23, DW_AT_name("ADCCTL2_REG")
     388                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     389              $C$DW$51        .dwtag  DW_TAG_member
     390                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     391                      .dwattr $C$DW$51, DW_AT_name("all")
     392                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_all")
     393                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     394                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     395              $C$DW$52        .dwtag  DW_TAG_member
     396                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$22)
     397                      .dwattr $C$DW$52, DW_AT_name("bit")
     398                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_bit")
     399                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     400                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     401                      .dwendtag $C$DW$T$23
     402              
     403              
     404              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     405                      .dwattr $C$DW$T$24, DW_AT_name("ADCINTSOCSEL1_BITS")
     406                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     407              $C$DW$53        .dwtag  DW_TAG_member
     408                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     409                      .dwattr $C$DW$53, DW_AT_name("SOC0")
     410                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_SOC0")
     411                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     412                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     413                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     414              $C$DW$54        .dwtag  DW_TAG_member
     415                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     416                      .dwattr $C$DW$54, DW_AT_name("SOC1")
     417                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_SOC1")
     418                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     419                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     420                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     421              $C$DW$55        .dwtag  DW_TAG_member
     422                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     423                      .dwattr $C$DW$55, DW_AT_name("SOC2")
     424                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_SOC2")
     425                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     426                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     427                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     428              $C$DW$56        .dwtag  DW_TAG_member
     429                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     430                      .dwattr $C$DW$56, DW_AT_name("SOC3")
     431                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_SOC3")
     432                      .dwattr $C$DW$56, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     433                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     434                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     435              $C$DW$57        .dwtag  DW_TAG_member
     436                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     437                      .dwattr $C$DW$57, DW_AT_name("SOC4")
     438                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_SOC4")
     439                      .dwattr $C$DW$57, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     440                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE    9

     441                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     442              $C$DW$58        .dwtag  DW_TAG_member
     443                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     444                      .dwattr $C$DW$58, DW_AT_name("SOC5")
     445                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_SOC5")
     446                      .dwattr $C$DW$58, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     447                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     448                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     449              $C$DW$59        .dwtag  DW_TAG_member
     450                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     451                      .dwattr $C$DW$59, DW_AT_name("SOC6")
     452                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_SOC6")
     453                      .dwattr $C$DW$59, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     454                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     455                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     456              $C$DW$60        .dwtag  DW_TAG_member
     457                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     458                      .dwattr $C$DW$60, DW_AT_name("SOC7")
     459                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_SOC7")
     460                      .dwattr $C$DW$60, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     461                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     462                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     463                      .dwendtag $C$DW$T$24
     464              
     465              
     466              $C$DW$T$25      .dwtag  DW_TAG_union_type
     467                      .dwattr $C$DW$T$25, DW_AT_name("ADCINTSOCSEL1_REG")
     468                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     469              $C$DW$61        .dwtag  DW_TAG_member
     470                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     471                      .dwattr $C$DW$61, DW_AT_name("all")
     472                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_all")
     473                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     474                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     475              $C$DW$62        .dwtag  DW_TAG_member
     476                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$24)
     477                      .dwattr $C$DW$62, DW_AT_name("bit")
     478                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_bit")
     479                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     480                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     481                      .dwendtag $C$DW$T$25
     482              
     483              
     484              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     485                      .dwattr $C$DW$T$26, DW_AT_name("ADCINTSOCSEL2_BITS")
     486                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     487              $C$DW$63        .dwtag  DW_TAG_member
     488                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     489                      .dwattr $C$DW$63, DW_AT_name("SOC8")
     490                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_SOC8")
     491                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     492                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     493                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     494              $C$DW$64        .dwtag  DW_TAG_member
     495                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   10

     496                      .dwattr $C$DW$64, DW_AT_name("SOC9")
     497                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_SOC9")
     498                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     499                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     500                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     501              $C$DW$65        .dwtag  DW_TAG_member
     502                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     503                      .dwattr $C$DW$65, DW_AT_name("SOC10")
     504                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_SOC10")
     505                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     506                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     507                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     508              $C$DW$66        .dwtag  DW_TAG_member
     509                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     510                      .dwattr $C$DW$66, DW_AT_name("SOC11")
     511                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_SOC11")
     512                      .dwattr $C$DW$66, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     513                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     514                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     515              $C$DW$67        .dwtag  DW_TAG_member
     516                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     517                      .dwattr $C$DW$67, DW_AT_name("SOC12")
     518                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_SOC12")
     519                      .dwattr $C$DW$67, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     520                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     521                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     522              $C$DW$68        .dwtag  DW_TAG_member
     523                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     524                      .dwattr $C$DW$68, DW_AT_name("SOC13")
     525                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_SOC13")
     526                      .dwattr $C$DW$68, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     527                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     528                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     529              $C$DW$69        .dwtag  DW_TAG_member
     530                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     531                      .dwattr $C$DW$69, DW_AT_name("SOC14")
     532                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_SOC14")
     533                      .dwattr $C$DW$69, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     534                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     535                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     536              $C$DW$70        .dwtag  DW_TAG_member
     537                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     538                      .dwattr $C$DW$70, DW_AT_name("SOC15")
     539                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_SOC15")
     540                      .dwattr $C$DW$70, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     541                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     542                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     543                      .dwendtag $C$DW$T$26
     544              
     545              
     546              $C$DW$T$27      .dwtag  DW_TAG_union_type
     547                      .dwattr $C$DW$T$27, DW_AT_name("ADCINTSOCSEL2_REG")
     548                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     549              $C$DW$71        .dwtag  DW_TAG_member
     550                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   11

     551                      .dwattr $C$DW$71, DW_AT_name("all")
     552                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_all")
     553                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     554                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     555              $C$DW$72        .dwtag  DW_TAG_member
     556                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$26)
     557                      .dwattr $C$DW$72, DW_AT_name("bit")
     558                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_bit")
     559                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     560                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     561                      .dwendtag $C$DW$T$27
     562              
     563              
     564              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     565                      .dwattr $C$DW$T$28, DW_AT_name("ADCINT_BITS")
     566                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     567              $C$DW$73        .dwtag  DW_TAG_member
     568                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     569                      .dwattr $C$DW$73, DW_AT_name("ADCINT1")
     570                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_ADCINT1")
     571                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     572                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     573                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     574              $C$DW$74        .dwtag  DW_TAG_member
     575                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     576                      .dwattr $C$DW$74, DW_AT_name("ADCINT2")
     577                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_ADCINT2")
     578                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     579                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     580                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     581              $C$DW$75        .dwtag  DW_TAG_member
     582                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     583                      .dwattr $C$DW$75, DW_AT_name("ADCINT3")
     584                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_ADCINT3")
     585                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     586                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     587                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     588              $C$DW$76        .dwtag  DW_TAG_member
     589                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     590                      .dwattr $C$DW$76, DW_AT_name("ADCINT4")
     591                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_ADCINT4")
     592                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     593                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     594                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     595              $C$DW$77        .dwtag  DW_TAG_member
     596                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     597                      .dwattr $C$DW$77, DW_AT_name("ADCINT5")
     598                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_ADCINT5")
     599                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     600                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     601                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     602              $C$DW$78        .dwtag  DW_TAG_member
     603                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     604                      .dwattr $C$DW$78, DW_AT_name("ADCINT6")
     605                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_ADCINT6")
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   12

     606                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     607                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     608                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     609              $C$DW$79        .dwtag  DW_TAG_member
     610                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     611                      .dwattr $C$DW$79, DW_AT_name("ADCINT7")
     612                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_ADCINT7")
     613                      .dwattr $C$DW$79, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     614                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     615                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     616              $C$DW$80        .dwtag  DW_TAG_member
     617                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     618                      .dwattr $C$DW$80, DW_AT_name("ADCINT8")
     619                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_ADCINT8")
     620                      .dwattr $C$DW$80, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     621                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     622                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     623              $C$DW$81        .dwtag  DW_TAG_member
     624                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     625                      .dwattr $C$DW$81, DW_AT_name("ADCINT9")
     626                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_ADCINT9")
     627                      .dwattr $C$DW$81, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     628                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     629                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     630              $C$DW$82        .dwtag  DW_TAG_member
     631                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     632                      .dwattr $C$DW$82, DW_AT_name("rsvd1")
     633                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd1")
     634                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
     635                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     636                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     637                      .dwendtag $C$DW$T$28
     638              
     639              
     640              $C$DW$T$29      .dwtag  DW_TAG_union_type
     641                      .dwattr $C$DW$T$29, DW_AT_name("ADCINT_REG")
     642                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     643              $C$DW$83        .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     645                      .dwattr $C$DW$83, DW_AT_name("all")
     646                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_all")
     647                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     648                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     649              $C$DW$84        .dwtag  DW_TAG_member
     650                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$28)
     651                      .dwattr $C$DW$84, DW_AT_name("bit")
     652                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_bit")
     653                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     654                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     655                      .dwendtag $C$DW$T$29
     656              
     657              
     658              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     659                      .dwattr $C$DW$T$31, DW_AT_name("ADCOFFTRIM_BITS")
     660                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   13

     661              $C$DW$85        .dwtag  DW_TAG_member
     662                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$30)
     663                      .dwattr $C$DW$85, DW_AT_name("OFFTRIM")
     664                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_OFFTRIM")
     665                      .dwattr $C$DW$85, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x09)
     666                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     667                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     668              $C$DW$86        .dwtag  DW_TAG_member
     669                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     670                      .dwattr $C$DW$86, DW_AT_name("rsvd1")
     671                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_rsvd1")
     672                      .dwattr $C$DW$86, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
     673                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     674                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     675                      .dwendtag $C$DW$T$31
     676              
     677              
     678              $C$DW$T$32      .dwtag  DW_TAG_union_type
     679                      .dwattr $C$DW$T$32, DW_AT_name("ADCOFFTRIM_REG")
     680                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     681              $C$DW$87        .dwtag  DW_TAG_member
     682                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     683                      .dwattr $C$DW$87, DW_AT_name("all")
     684                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_all")
     685                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     686                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     687              $C$DW$88        .dwtag  DW_TAG_member
     688                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$31)
     689                      .dwattr $C$DW$88, DW_AT_name("bit")
     690                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_bit")
     691                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     692                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     693                      .dwendtag $C$DW$T$32
     694              
     695              
     696              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     697                      .dwattr $C$DW$T$33, DW_AT_name("ADCREFTRIM_BITS")
     698                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     699              $C$DW$89        .dwtag  DW_TAG_member
     700                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     701                      .dwattr $C$DW$89, DW_AT_name("BG_FINE_TRIM")
     702                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_BG_FINE_TRIM")
     703                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
     704                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     705                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     706              $C$DW$90        .dwtag  DW_TAG_member
     707                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     708                      .dwattr $C$DW$90, DW_AT_name("BG_COARSE_TRIM")
     709                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_BG_COARSE_TRIM")
     710                      .dwattr $C$DW$90, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x04)
     711                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     712                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     713              $C$DW$91        .dwtag  DW_TAG_member
     714                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     715                      .dwattr $C$DW$91, DW_AT_name("EXTREF_FINE_TRIM")
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   14

     716                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_EXTREF_FINE_TRIM")
     717                      .dwattr $C$DW$91, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x05)
     718                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     719                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     720              $C$DW$92        .dwtag  DW_TAG_member
     721                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     722                      .dwattr $C$DW$92, DW_AT_name("rsvd1")
     723                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd1")
     724                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     725                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     726                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     727                      .dwendtag $C$DW$T$33
     728              
     729              
     730              $C$DW$T$34      .dwtag  DW_TAG_union_type
     731                      .dwattr $C$DW$T$34, DW_AT_name("ADCREFTRIM_REG")
     732                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     733              $C$DW$93        .dwtag  DW_TAG_member
     734                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     735                      .dwattr $C$DW$93, DW_AT_name("all")
     736                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_all")
     737                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     738                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     739              $C$DW$94        .dwtag  DW_TAG_member
     740                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$33)
     741                      .dwattr $C$DW$94, DW_AT_name("bit")
     742                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_bit")
     743                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     744                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     745                      .dwendtag $C$DW$T$34
     746              
     747              
     748              $C$DW$T$35      .dwtag  DW_TAG_structure_type
     749                      .dwattr $C$DW$T$35, DW_AT_name("ADCSAMPLEMODE_BITS")
     750                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     751              $C$DW$95        .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     753                      .dwattr $C$DW$95, DW_AT_name("SIMULEN0")
     754                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_SIMULEN0")
     755                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     756                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     757                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     758              $C$DW$96        .dwtag  DW_TAG_member
     759                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     760                      .dwattr $C$DW$96, DW_AT_name("SIMULEN2")
     761                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_SIMULEN2")
     762                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     763                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     764                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     765              $C$DW$97        .dwtag  DW_TAG_member
     766                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     767                      .dwattr $C$DW$97, DW_AT_name("SIMULEN4")
     768                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_SIMULEN4")
     769                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     770                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   15

     771                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     772              $C$DW$98        .dwtag  DW_TAG_member
     773                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     774                      .dwattr $C$DW$98, DW_AT_name("SIMULEN6")
     775                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_SIMULEN6")
     776                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     777                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     778                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     779              $C$DW$99        .dwtag  DW_TAG_member
     780                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     781                      .dwattr $C$DW$99, DW_AT_name("SIMULEN8")
     782                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_SIMULEN8")
     783                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     784                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     785                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     786              $C$DW$100       .dwtag  DW_TAG_member
     787                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     788                      .dwattr $C$DW$100, DW_AT_name("SIMULEN10")
     789                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_SIMULEN10")
     790                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     791                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     792                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     793              $C$DW$101       .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     795                      .dwattr $C$DW$101, DW_AT_name("SIMULEN12")
     796                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_SIMULEN12")
     797                      .dwattr $C$DW$101, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     798                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     799                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     800              $C$DW$102       .dwtag  DW_TAG_member
     801                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     802                      .dwattr $C$DW$102, DW_AT_name("SIMULEN14")
     803                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_SIMULEN14")
     804                      .dwattr $C$DW$102, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     805                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     806                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     807              $C$DW$103       .dwtag  DW_TAG_member
     808                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     809                      .dwattr $C$DW$103, DW_AT_name("rsvd1")
     810                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd1")
     811                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     812                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     813                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     814                      .dwendtag $C$DW$T$35
     815              
     816              
     817              $C$DW$T$36      .dwtag  DW_TAG_union_type
     818                      .dwattr $C$DW$T$36, DW_AT_name("ADCSAMPLEMODE_REG")
     819                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
     820              $C$DW$104       .dwtag  DW_TAG_member
     821                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     822                      .dwattr $C$DW$104, DW_AT_name("all")
     823                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
     824                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     825                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   16

     826              $C$DW$105       .dwtag  DW_TAG_member
     827                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$35)
     828                      .dwattr $C$DW$105, DW_AT_name("bit")
     829                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
     830                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     831                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     832                      .dwendtag $C$DW$T$36
     833              
     834              
     835              $C$DW$T$37      .dwtag  DW_TAG_structure_type
     836                      .dwattr $C$DW$T$37, DW_AT_name("ADCSOC_BITS")
     837                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
     838              $C$DW$106       .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
     840                      .dwattr $C$DW$106, DW_AT_name("SOC0")
     841                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_SOC0")
     842                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     843                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     844                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     845              $C$DW$107       .dwtag  DW_TAG_member
     846                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
     847                      .dwattr $C$DW$107, DW_AT_name("SOC1")
     848                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_SOC1")
     849                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     850                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     852              $C$DW$108       .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
     854                      .dwattr $C$DW$108, DW_AT_name("SOC2")
     855                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_SOC2")
     856                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     857                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     858                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     859              $C$DW$109       .dwtag  DW_TAG_member
     860                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
     861                      .dwattr $C$DW$109, DW_AT_name("SOC3")
     862                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_SOC3")
     863                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     864                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     865                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     866              $C$DW$110       .dwtag  DW_TAG_member
     867                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
     868                      .dwattr $C$DW$110, DW_AT_name("SOC4")
     869                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_SOC4")
     870                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     871                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     872                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     873              $C$DW$111       .dwtag  DW_TAG_member
     874                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
     875                      .dwattr $C$DW$111, DW_AT_name("SOC5")
     876                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_SOC5")
     877                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     878                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     879                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     880              $C$DW$112       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   17

     881                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
     882                      .dwattr $C$DW$112, DW_AT_name("SOC6")
     883                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_SOC6")
     884                      .dwattr $C$DW$112, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     885                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     886                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     887              $C$DW$113       .dwtag  DW_TAG_member
     888                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
     889                      .dwattr $C$DW$113, DW_AT_name("SOC7")
     890                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_SOC7")
     891                      .dwattr $C$DW$113, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     892                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     893                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     894              $C$DW$114       .dwtag  DW_TAG_member
     895                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
     896                      .dwattr $C$DW$114, DW_AT_name("SOC8")
     897                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_SOC8")
     898                      .dwattr $C$DW$114, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     899                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     900                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     901              $C$DW$115       .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
     903                      .dwattr $C$DW$115, DW_AT_name("SOC9")
     904                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_SOC9")
     905                      .dwattr $C$DW$115, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     906                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     907                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     908              $C$DW$116       .dwtag  DW_TAG_member
     909                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
     910                      .dwattr $C$DW$116, DW_AT_name("SOC10")
     911                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_SOC10")
     912                      .dwattr $C$DW$116, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     913                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     915              $C$DW$117       .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
     917                      .dwattr $C$DW$117, DW_AT_name("SOC11")
     918                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_SOC11")
     919                      .dwattr $C$DW$117, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     920                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     921                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     922              $C$DW$118       .dwtag  DW_TAG_member
     923                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
     924                      .dwattr $C$DW$118, DW_AT_name("SOC12")
     925                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_SOC12")
     926                      .dwattr $C$DW$118, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     927                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     928                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     929              $C$DW$119       .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
     931                      .dwattr $C$DW$119, DW_AT_name("SOC13")
     932                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_SOC13")
     933                      .dwattr $C$DW$119, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     934                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     935                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   18

     936              $C$DW$120       .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
     938                      .dwattr $C$DW$120, DW_AT_name("SOC14")
     939                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_SOC14")
     940                      .dwattr $C$DW$120, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     941                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     943              $C$DW$121       .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
     945                      .dwattr $C$DW$121, DW_AT_name("SOC15")
     946                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_SOC15")
     947                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     948                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     949                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     950                      .dwendtag $C$DW$T$37
     951              
     952              
     953              $C$DW$T$38      .dwtag  DW_TAG_union_type
     954                      .dwattr $C$DW$T$38, DW_AT_name("ADCSOC_REG")
     955                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
     956              $C$DW$122       .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
     958                      .dwattr $C$DW$122, DW_AT_name("all")
     959                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
     960                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     962              $C$DW$123       .dwtag  DW_TAG_member
     963                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$37)
     964                      .dwattr $C$DW$123, DW_AT_name("bit")
     965                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
     966                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     967                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     968                      .dwendtag $C$DW$T$38
     969              
     970              
     971              $C$DW$T$39      .dwtag  DW_TAG_structure_type
     972                      .dwattr $C$DW$T$39, DW_AT_name("ADCSOCxCTL_BITS")
     973                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
     974              $C$DW$124       .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
     976                      .dwattr $C$DW$124, DW_AT_name("ACQPS")
     977                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_ACQPS")
     978                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
     979                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     980                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     981              $C$DW$125       .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
     983                      .dwattr $C$DW$125, DW_AT_name("CHSEL")
     984                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_CHSEL")
     985                      .dwattr $C$DW$125, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x04)
     986                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     987                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     988              $C$DW$126       .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
     990                      .dwattr $C$DW$126, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   19

     991                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd1")
     992                      .dwattr $C$DW$126, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     993                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     994                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
     995              $C$DW$127       .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$127, DW_AT_name("TRIGSEL")
     998                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_TRIGSEL")
     999                      .dwattr $C$DW$127, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    1000                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1002                      .dwendtag $C$DW$T$39
    1003              
    1004              
    1005              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1006                      .dwattr $C$DW$T$40, DW_AT_name("ADCSOCxCTL_REG")
    1007                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1008              $C$DW$128       .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1010                      .dwattr $C$DW$128, DW_AT_name("all")
    1011                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_all")
    1012                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1013                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1014              $C$DW$129       .dwtag  DW_TAG_member
    1015                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$39)
    1016                      .dwattr $C$DW$129, DW_AT_name("bit")
    1017                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_bit")
    1018                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1019                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1020                      .dwendtag $C$DW$T$40
    1021              
    1022              
    1023              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1024                      .dwattr $C$DW$T$45, DW_AT_name("ADC_REGS")
    1025                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x51)
    1026              $C$DW$130       .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$21)
    1028                      .dwattr $C$DW$130, DW_AT_name("ADCCTL1")
    1029                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ADCCTL1")
    1030                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1031                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1032              $C$DW$131       .dwtag  DW_TAG_member
    1033                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$23)
    1034                      .dwattr $C$DW$131, DW_AT_name("ADCCTL2")
    1035                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ADCCTL2")
    1036                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1037                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1038              $C$DW$132       .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$41)
    1040                      .dwattr $C$DW$132, DW_AT_name("rsvd1")
    1041                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd1")
    1042                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1043                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1044              $C$DW$133       .dwtag  DW_TAG_member
    1045                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   20

    1046                      .dwattr $C$DW$133, DW_AT_name("ADCINTFLG")
    1047                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ADCINTFLG")
    1048                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1049                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1050              $C$DW$134       .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$29)
    1052                      .dwattr $C$DW$134, DW_AT_name("ADCINTFLGCLR")
    1053                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    1054                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1055                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1056              $C$DW$135       .dwtag  DW_TAG_member
    1057                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$29)
    1058                      .dwattr $C$DW$135, DW_AT_name("ADCINTOVF")
    1059                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_ADCINTOVF")
    1060                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1061                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1062              $C$DW$136       .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$29)
    1064                      .dwattr $C$DW$136, DW_AT_name("ADCINTOVFCLR")
    1065                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    1066                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1067                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1068              $C$DW$137       .dwtag  DW_TAG_member
    1069                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$183)
    1070                      .dwattr $C$DW$137, DW_AT_name("INTSEL1N2")
    1071                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_INTSEL1N2")
    1072                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1073                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1074              $C$DW$138       .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$185)
    1076                      .dwattr $C$DW$138, DW_AT_name("INTSEL3N4")
    1077                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_INTSEL3N4")
    1078                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1079                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1080              $C$DW$139       .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$187)
    1082                      .dwattr $C$DW$139, DW_AT_name("INTSEL5N6")
    1083                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_INTSEL5N6")
    1084                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1085                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1086              $C$DW$140       .dwtag  DW_TAG_member
    1087                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$189)
    1088                      .dwattr $C$DW$140, DW_AT_name("INTSEL7N8")
    1089                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_INTSEL7N8")
    1090                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1091                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1092              $C$DW$141       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$191)
    1094                      .dwattr $C$DW$141, DW_AT_name("INTSEL9N10")
    1095                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_INTSEL9N10")
    1096                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1097                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1098              $C$DW$142       .dwtag  DW_TAG_member
    1099                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$42)
    1100                      .dwattr $C$DW$142, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   21

    1101                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd2")
    1102                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1103                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1104              $C$DW$143       .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$255)
    1106                      .dwattr $C$DW$143, DW_AT_name("SOCPRICTL")
    1107                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_SOCPRICTL")
    1108                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1109                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1110              $C$DW$144       .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1112                      .dwattr $C$DW$144, DW_AT_name("rsvd3")
    1113                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd3")
    1114                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1115                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1116              $C$DW$145       .dwtag  DW_TAG_member
    1117                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$36)
    1118                      .dwattr $C$DW$145, DW_AT_name("ADCSAMPLEMODE")
    1119                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    1120                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1121                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1122              $C$DW$146       .dwtag  DW_TAG_member
    1123                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1124                      .dwattr $C$DW$146, DW_AT_name("rsvd4")
    1125                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd4")
    1126                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1127                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1128              $C$DW$147       .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$25)
    1130                      .dwattr $C$DW$147, DW_AT_name("ADCINTSOCSEL1")
    1131                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    1132                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1133                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1134              $C$DW$148       .dwtag  DW_TAG_member
    1135                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    1136                      .dwattr $C$DW$148, DW_AT_name("ADCINTSOCSEL2")
    1137                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    1138                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1139                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1140              $C$DW$149       .dwtag  DW_TAG_member
    1141                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$41)
    1142                      .dwattr $C$DW$149, DW_AT_name("rsvd5")
    1143                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd5")
    1144                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1145                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1146              $C$DW$150       .dwtag  DW_TAG_member
    1147                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$38)
    1148                      .dwattr $C$DW$150, DW_AT_name("ADCSOCFLG1")
    1149                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    1150                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1151                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1152              $C$DW$151       .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1154                      .dwattr $C$DW$151, DW_AT_name("rsvd6")
    1155                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd6")
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   22

    1156                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1157                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1158              $C$DW$152       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$38)
    1160                      .dwattr $C$DW$152, DW_AT_name("ADCSOCFRC1")
    1161                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    1162                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1163                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1164              $C$DW$153       .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1166                      .dwattr $C$DW$153, DW_AT_name("rsvd7")
    1167                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd7")
    1168                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1169                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1170              $C$DW$154       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$38)
    1172                      .dwattr $C$DW$154, DW_AT_name("ADCSOCOVF1")
    1173                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    1174                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1175                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1176              $C$DW$155       .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1178                      .dwattr $C$DW$155, DW_AT_name("rsvd8")
    1179                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd8")
    1180                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1181                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1182              $C$DW$156       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$38)
    1184                      .dwattr $C$DW$156, DW_AT_name("ADCSOCOVFCLR1")
    1185                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    1186                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1187                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1188              $C$DW$157       .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1190                      .dwattr $C$DW$157, DW_AT_name("rsvd9")
    1191                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd9")
    1192                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1193                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1194              $C$DW$158       .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$40)
    1196                      .dwattr $C$DW$158, DW_AT_name("ADCSOC0CTL")
    1197                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ADCSOC0CTL")
    1198                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1199                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1200              $C$DW$159       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$40)
    1202                      .dwattr $C$DW$159, DW_AT_name("ADCSOC1CTL")
    1203                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ADCSOC1CTL")
    1204                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1205                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1206              $C$DW$160       .dwtag  DW_TAG_member
    1207                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$40)
    1208                      .dwattr $C$DW$160, DW_AT_name("ADCSOC2CTL")
    1209                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ADCSOC2CTL")
    1210                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   23

    1211                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1212              $C$DW$161       .dwtag  DW_TAG_member
    1213                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$40)
    1214                      .dwattr $C$DW$161, DW_AT_name("ADCSOC3CTL")
    1215                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_ADCSOC3CTL")
    1216                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1217                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1218              $C$DW$162       .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$40)
    1220                      .dwattr $C$DW$162, DW_AT_name("ADCSOC4CTL")
    1221                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_ADCSOC4CTL")
    1222                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1223                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1224              $C$DW$163       .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$40)
    1226                      .dwattr $C$DW$163, DW_AT_name("ADCSOC5CTL")
    1227                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_ADCSOC5CTL")
    1228                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1229                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1230              $C$DW$164       .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$40)
    1232                      .dwattr $C$DW$164, DW_AT_name("ADCSOC6CTL")
    1233                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_ADCSOC6CTL")
    1234                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1235                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1236              $C$DW$165       .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$40)
    1238                      .dwattr $C$DW$165, DW_AT_name("ADCSOC7CTL")
    1239                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_ADCSOC7CTL")
    1240                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1241                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1242              $C$DW$166       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$40)
    1244                      .dwattr $C$DW$166, DW_AT_name("ADCSOC8CTL")
    1245                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_ADCSOC8CTL")
    1246                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1247                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1248              $C$DW$167       .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$40)
    1250                      .dwattr $C$DW$167, DW_AT_name("ADCSOC9CTL")
    1251                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_ADCSOC9CTL")
    1252                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1253                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1254              $C$DW$168       .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$40)
    1256                      .dwattr $C$DW$168, DW_AT_name("ADCSOC10CTL")
    1257                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_ADCSOC10CTL")
    1258                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1259                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1260              $C$DW$169       .dwtag  DW_TAG_member
    1261                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$40)
    1262                      .dwattr $C$DW$169, DW_AT_name("ADCSOC11CTL")
    1263                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_ADCSOC11CTL")
    1264                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1265                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   24

    1266              $C$DW$170       .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$40)
    1268                      .dwattr $C$DW$170, DW_AT_name("ADCSOC12CTL")
    1269                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_ADCSOC12CTL")
    1270                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1271                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1272              $C$DW$171       .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$40)
    1274                      .dwattr $C$DW$171, DW_AT_name("ADCSOC13CTL")
    1275                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_ADCSOC13CTL")
    1276                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1277                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1278              $C$DW$172       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$40)
    1280                      .dwattr $C$DW$172, DW_AT_name("ADCSOC14CTL")
    1281                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_ADCSOC14CTL")
    1282                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1283                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1284              $C$DW$173       .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$40)
    1286                      .dwattr $C$DW$173, DW_AT_name("ADCSOC15CTL")
    1287                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_ADCSOC15CTL")
    1288                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    1289                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1290              $C$DW$174       .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$43)
    1292                      .dwattr $C$DW$174, DW_AT_name("rsvd10")
    1293                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd10")
    1294                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1295                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1296              $C$DW$175       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$34)
    1298                      .dwattr $C$DW$175, DW_AT_name("ADCREFTRIM")
    1299                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_ADCREFTRIM")
    1300                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1301                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1302              $C$DW$176       .dwtag  DW_TAG_member
    1303                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$32)
    1304                      .dwattr $C$DW$176, DW_AT_name("ADCOFFTRIM")
    1305                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    1306                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1307                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1308              $C$DW$177       .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$44)
    1310                      .dwattr $C$DW$177, DW_AT_name("rsvd11")
    1311                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd11")
    1312                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1313                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1314              $C$DW$178       .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$71)
    1316                      .dwattr $C$DW$178, DW_AT_name("COMPHYSTCTL")
    1317                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_COMPHYSTCTL")
    1318                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1319                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1320              $C$DW$179       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   25

    1321                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$42)
    1322                      .dwattr $C$DW$179, DW_AT_name("rsvd12")
    1323                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd12")
    1324                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1325                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1326                      .dwendtag $C$DW$T$45
    1327              
    1328              $C$DW$180       .dwtag  DW_TAG_TI_far_type
    1329                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$45)
    1330              $C$DW$T$308     .dwtag  DW_TAG_volatile_type
    1331                      .dwattr $C$DW$T$308, DW_AT_type(*$C$DW$180)
    1332              
    1333              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1334                      .dwattr $C$DW$T$46, DW_AT_name("ADC_RESULT_REGS")
    1335                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x20)
    1336              $C$DW$181       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1338                      .dwattr $C$DW$181, DW_AT_name("ADCRESULT0")
    1339                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_ADCRESULT0")
    1340                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1341                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1342              $C$DW$182       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1344                      .dwattr $C$DW$182, DW_AT_name("ADCRESULT1")
    1345                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_ADCRESULT1")
    1346                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1347                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1348              $C$DW$183       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$183, DW_AT_name("ADCRESULT2")
    1351                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_ADCRESULT2")
    1352                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1353                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1354              $C$DW$184       .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1356                      .dwattr $C$DW$184, DW_AT_name("ADCRESULT3")
    1357                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_ADCRESULT3")
    1358                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1359                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1360              $C$DW$185       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1362                      .dwattr $C$DW$185, DW_AT_name("ADCRESULT4")
    1363                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_ADCRESULT4")
    1364                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1365                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1366              $C$DW$186       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1368                      .dwattr $C$DW$186, DW_AT_name("ADCRESULT5")
    1369                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_ADCRESULT5")
    1370                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1371                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1372              $C$DW$187       .dwtag  DW_TAG_member
    1373                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1374                      .dwattr $C$DW$187, DW_AT_name("ADCRESULT6")
    1375                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_ADCRESULT6")
TMS320C2000 Assembler PC v6.4.2 Wed Dec 23 10:18:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0141610                         PAGE   26

    1376                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1377                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1378              $C$DW$188       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1380                      .dwattr $C$DW$188, DW_AT_name("ADCRESULT7")
    1381                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_ADCRESULT7")
    1382                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1383                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1384              $C$DW$189       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1386                      .dwattr $C$DW$189, DW_AT_name("ADCRESULT8")
    1387                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_ADCRESULT8")
    1388                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1389                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1390              $C$DW$190       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1392                      .dwattr $C$DW$190, DW_AT_name("ADCRESULT9")
    1393                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_ADCRESULT9")
    1394                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1395                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1396              $C$DW$191       .dwtag  DW_TAG_member
    1397                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1398                      .dwattr $C$DW$191, DW_AT_name("ADCRESULT10")
    1399                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_ADCRESULT10")
    1400                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1401                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1402              $C$DW$192       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1404                      .dwattr $C$DW$192, DW_AT_name("ADCRESULT11")
    1405                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_ADCRESULT11")
    1406                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1407                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1408              $C$DW$193       .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1410                      .dwattr $C$DW$193, DW_AT_name("ADCRESULT12")
    1411                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_ADCRESULT12")
    1412                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
