TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.9 *
       3              ;* Date/Time created: Mon Jan 25 16:25:06 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/modules/hal/boards/boostxldrv83
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.9 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\BenBracy\Documents\TI FOC\proj_lab09\Flash")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SPI_setCharLength")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SPI_setCharLength")

    9770                      .dwattr $C$DW$1771, DW_AT_type(*$C$DW$T$331)
    9771              $C$DW$T$332     .dwtag  DW_TAG_const_type
    9772                      .dwattr $C$DW$T$332, DW_AT_type(*$C$DW$1771)
    9773              
    9774              $C$DW$T$333     .dwtag  DW_TAG_enumeration_type
    9775                      .dwattr $C$DW$T$333, DW_AT_byte_size(0x01)
    9776              $C$DW$1772      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Slave"), DW_AT_const_value(0x00)
    9777              $C$DW$1773      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Master"), DW_AT_const_value(0x04)
    9778                      .dwendtag $C$DW$T$333
    9779              
    9780              $C$DW$T$334     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Mode_e")
    9781                      .dwattr $C$DW$T$334, DW_AT_type(*$C$DW$T$333)
    9782                      .dwattr $C$DW$T$334, DW_AT_language(DW_LANG_C)
    9783              $C$DW$1774      .dwtag  DW_TAG_TI_far_type
    9784                      .dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$334)
    9785              $C$DW$T$335     .dwtag  DW_TAG_const_type
    9786                      .dwattr $C$DW$T$335, DW_AT_type(*$C$DW$1774)
    9787              
    9788              $C$DW$T$336     .dwtag  DW_TAG_enumeration_type
    9789                      .dwattr $C$DW$T$336, DW_AT_byte_size(0x01)
    9790              $C$DW$1775      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  188

    9791              $C$DW$1776      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
    9792              $C$DW$1777      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
    9793                      .dwendtag $C$DW$T$336
    9794              
    9795              $C$DW$T$337     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
    9796                      .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$336)
    9797                      .dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
    9798              $C$DW$1778      .dwtag  DW_TAG_TI_far_type
    9799                      .dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$337)
    9800              $C$DW$T$338     .dwtag  DW_TAG_const_type
    9801                      .dwattr $C$DW$T$338, DW_AT_type(*$C$DW$1778)
    9802              
    9803              $C$DW$T$339     .dwtag  DW_TAG_enumeration_type
    9804                      .dwattr $C$DW$T$339, DW_AT_byte_size(0x01)
    9805              $C$DW$1779      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement"), DW_AT_co
    9806              $C$DW$1780      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAtZero"), DW_AT_const_value(0x
    9807              $C$DW$1781      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_RunFree"), DW_AT_const_value(0x800
    9808                      .dwendtag $C$DW$T$339
    9809              
    9810              $C$DW$T$340     .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_EmulationMode_e")
    9811                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$T$339)
    9812                      .dwattr $C$DW$T$340, DW_AT_language(DW_LANG_C)
    9813              $C$DW$1782      .dwtag  DW_TAG_TI_far_type
    9814                      .dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$340)
    9815              $C$DW$T$341     .dwtag  DW_TAG_const_type
    9816                      .dwattr $C$DW$T$341, DW_AT_type(*$C$DW$1782)
    9817              
    9818              $C$DW$T$342     .dwtag  DW_TAG_enumeration_type
    9819                      .dwattr $C$DW$T$342, DW_AT_byte_size(0x01)
    9820              $C$DW$1783      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    9821              $C$DW$1784      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    9822                      .dwendtag $C$DW$T$342
    9823              
    9824              $C$DW$T$343     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    9825                      .dwattr $C$DW$T$343, DW_AT_type(*$C$DW$T$342)
    9826                      .dwattr $C$DW$T$343, DW_AT_language(DW_LANG_C)
    9827              
    9828              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9829                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    9830                      .dwattr $C$DW$T$19, DW_AT_declaration
    9831                      .dwendtag $C$DW$T$19
    9832              
    9833              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    9834                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$19)
    9835                      .dwattr $C$DW$T$100, DW_AT_address_class(0x20)
    9836              $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    9837                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    9838                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    9839              
    9840              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    9841                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    9842                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    9843              $C$DW$1785      .dwtag  DW_TAG_member
    9844                      .dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$24)
    9845                      .dwattr $C$DW$1785, DW_AT_name("ADCRESULT")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  189

    9846                      .dwattr $C$DW$1785, DW_AT_TI_symbol_name("_ADCRESULT")
    9847                      .dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9848                      .dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
    9849              $C$DW$1786      .dwtag  DW_TAG_member
    9850                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$25)
    9851                      .dwattr $C$DW$1786, DW_AT_name("resvd_1")
    9852                      .dwattr $C$DW$1786, DW_AT_TI_symbol_name("_resvd_1")
    9853                      .dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9854                      .dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
    9855              $C$DW$1787      .dwtag  DW_TAG_member
    9856                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$23)
    9857                      .dwattr $C$DW$1787, DW_AT_name("ADCCTL1")
    9858                      .dwattr $C$DW$1787, DW_AT_TI_symbol_name("_ADCCTL1")
    9859                      .dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    9860                      .dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
    9861              $C$DW$1788      .dwtag  DW_TAG_member
    9862                      .dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$23)
    9863                      .dwattr $C$DW$1788, DW_AT_name("ADCCTL2")
    9864                      .dwattr $C$DW$1788, DW_AT_TI_symbol_name("_ADCCTL2")
    9865                      .dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    9866                      .dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
    9867              $C$DW$1789      .dwtag  DW_TAG_member
    9868                      .dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$26)
    9869                      .dwattr $C$DW$1789, DW_AT_name("rsvd_2")
    9870                      .dwattr $C$DW$1789, DW_AT_TI_symbol_name("_rsvd_2")
    9871                      .dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    9872                      .dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
    9873              $C$DW$1790      .dwtag  DW_TAG_member
    9874                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$23)
    9875                      .dwattr $C$DW$1790, DW_AT_name("ADCINTFLG")
    9876                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_ADCINTFLG")
    9877                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    9878                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
    9879              $C$DW$1791      .dwtag  DW_TAG_member
    9880                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$23)
    9881                      .dwattr $C$DW$1791, DW_AT_name("ADCINTFLGCLR")
    9882                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    9883                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    9884                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
    9885              $C$DW$1792      .dwtag  DW_TAG_member
    9886                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$23)
    9887                      .dwattr $C$DW$1792, DW_AT_name("ADCINTOVF")
    9888                      .dwattr $C$DW$1792, DW_AT_TI_symbol_name("_ADCINTOVF")
    9889                      .dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    9890                      .dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
    9891              $C$DW$1793      .dwtag  DW_TAG_member
    9892                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$23)
    9893                      .dwattr $C$DW$1793, DW_AT_name("ADCINTOVFCLR")
    9894                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    9895                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    9896                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
    9897              $C$DW$1794      .dwtag  DW_TAG_member
    9898                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$27)
    9899                      .dwattr $C$DW$1794, DW_AT_name("INTSELxNy")
    9900                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_INTSELxNy")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  190

    9901                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    9902                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
    9903              $C$DW$1795      .dwtag  DW_TAG_member
    9904                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$28)
    9905                      .dwattr $C$DW$1795, DW_AT_name("rsvd_3")
    9906                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_rsvd_3")
    9907                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    9908                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
    9909              $C$DW$1796      .dwtag  DW_TAG_member
    9910                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$23)
    9911                      .dwattr $C$DW$1796, DW_AT_name("SOCPRICTRL")
    9912                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_SOCPRICTRL")
    9913                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    9914                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
    9915              $C$DW$1797      .dwtag  DW_TAG_member
    9916                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$23)
    9917                      .dwattr $C$DW$1797, DW_AT_name("rsvd_4")
    9918                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_rsvd_4")
    9919                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    9920                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
    9921              $C$DW$1798      .dwtag  DW_TAG_member
    9922                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$23)
    9923                      .dwattr $C$DW$1798, DW_AT_name("ADCSAMPLEMODE")
    9924                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    9925                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    9926                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
    9927              $C$DW$1799      .dwtag  DW_TAG_member
    9928                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$23)
    9929                      .dwattr $C$DW$1799, DW_AT_name("rsvd_5")
    9930                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_rsvd_5")
    9931                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    9932                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
    9933              $C$DW$1800      .dwtag  DW_TAG_member
    9934                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$23)
    9935                      .dwattr $C$DW$1800, DW_AT_name("ADCINTSOCSEL1")
    9936                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9937                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9938                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
    9939              $C$DW$1801      .dwtag  DW_TAG_member
    9940                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$23)
    9941                      .dwattr $C$DW$1801, DW_AT_name("ADCINTSOCSEL2")
    9942                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9943                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9944                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
    9945              $C$DW$1802      .dwtag  DW_TAG_member
    9946                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$26)
    9947                      .dwattr $C$DW$1802, DW_AT_name("rsvd_6")
    9948                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_rsvd_6")
    9949                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9950                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
    9951              $C$DW$1803      .dwtag  DW_TAG_member
    9952                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$23)
    9953                      .dwattr $C$DW$1803, DW_AT_name("ADCSOCFLG1")
    9954                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9955                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  191

    9956                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
    9957              $C$DW$1804      .dwtag  DW_TAG_member
    9958                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$23)
    9959                      .dwattr $C$DW$1804, DW_AT_name("rsvd_7")
    9960                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_rsvd_7")
    9961                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9962                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
    9963              $C$DW$1805      .dwtag  DW_TAG_member
    9964                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$23)
    9965                      .dwattr $C$DW$1805, DW_AT_name("ADCSOCFRC1")
    9966                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9967                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9968                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
    9969              $C$DW$1806      .dwtag  DW_TAG_member
    9970                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$23)
    9971                      .dwattr $C$DW$1806, DW_AT_name("rsvd_8")
    9972                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_rsvd_8")
    9973                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9974                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
    9975              $C$DW$1807      .dwtag  DW_TAG_member
    9976                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$23)
    9977                      .dwattr $C$DW$1807, DW_AT_name("ADCSOCOVF1")
    9978                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9979                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9980                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
    9981              $C$DW$1808      .dwtag  DW_TAG_member
    9982                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$23)
    9983                      .dwattr $C$DW$1808, DW_AT_name("rsvd_9")
    9984                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_rsvd_9")
    9985                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9986                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
    9987              $C$DW$1809      .dwtag  DW_TAG_member
    9988                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$23)
    9989                      .dwattr $C$DW$1809, DW_AT_name("ADCSOCOVFCLR1")
    9990                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9991                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9992                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
    9993              $C$DW$1810      .dwtag  DW_TAG_member
    9994                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$23)
    9995                      .dwattr $C$DW$1810, DW_AT_name("rsvd_10")
    9996                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_rsvd_10")
    9997                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9998                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
    9999              $C$DW$1811      .dwtag  DW_TAG_member
   10000                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$24)
   10001                      .dwattr $C$DW$1811, DW_AT_name("ADCSOCxCTL")
   10002                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   10003                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   10004                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
   10005              $C$DW$1812      .dwtag  DW_TAG_member
   10006                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$24)
   10007                      .dwattr $C$DW$1812, DW_AT_name("rsvd_11")
   10008                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_rsvd_11")
   10009                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   10010                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  192

   10011              $C$DW$1813      .dwtag  DW_TAG_member
   10012                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$23)
   10013                      .dwattr $C$DW$1813, DW_AT_name("ADCREFTRIM")
   10014                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_ADCREFTRIM")
   10015                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   10016                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   10017              $C$DW$1814      .dwtag  DW_TAG_member
   10018                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$23)
   10019                      .dwattr $C$DW$1814, DW_AT_name("ADCOFFTRIM")
   10020                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   10021                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   10022                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
   10023              $C$DW$1815      .dwtag  DW_TAG_member
   10024                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$29)
   10025                      .dwattr $C$DW$1815, DW_AT_name("resvd_12")
   10026                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_resvd_12")
   10027                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   10028                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   10029              $C$DW$1816      .dwtag  DW_TAG_member
   10030                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$23)
   10031                      .dwattr $C$DW$1816, DW_AT_name("ADCREV")
   10032                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_ADCREV")
   10033                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   10034                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   10035                      .dwendtag $C$DW$T$30
   10036              
   10037              $C$DW$T$350     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
   10038                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$30)
   10039                      .dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
   10040              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
   10041                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$30)
   10042                      .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
   10043              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
   10044                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
   10045                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   10046              
   10047              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   10048                      .dwattr $C$DW$T$34, DW_AT_name("_CAP_Obj_")
   10049                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x1a)
   10050              $C$DW$1817      .dwtag  DW_TAG_member
   10051                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$32)
   10052                      .dwattr $C$DW$1817, DW_AT_name("TSCTR")
   10053                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_TSCTR")
   10054                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10055                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   10056              $C$DW$1818      .dwtag  DW_TAG_member
   10057                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$32)
   10058                      .dwattr $C$DW$1818, DW_AT_name("CTRPHS")
   10059                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_CTRPHS")
   10060                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10061                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   10062              $C$DW$1819      .dwtag  DW_TAG_member
   10063                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$32)
   10064                      .dwattr $C$DW$1819, DW_AT_name("CAP1")
   10065                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_CAP1")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  193

   10066                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10067                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   10068              $C$DW$1820      .dwtag  DW_TAG_member
   10069                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$32)
   10070                      .dwattr $C$DW$1820, DW_AT_name("CAP2")
   10071                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_CAP2")
   10072                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10073                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   10074              $C$DW$1821      .dwtag  DW_TAG_member
   10075                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$32)
   10076                      .dwattr $C$DW$1821, DW_AT_name("CAP3")
   10077                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_CAP3")
   10078                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10079                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   10080              $C$DW$1822      .dwtag  DW_TAG_member
   10081                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$32)
   10082                      .dwattr $C$DW$1822, DW_AT_name("CAP4")
   10083                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_CAP4")
   10084                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10085                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   10086              $C$DW$1823      .dwtag  DW_TAG_member
   10087                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$33)
   10088                      .dwattr $C$DW$1823, DW_AT_name("Rsvd_1")
   10089                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_Rsvd_1")
   10090                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10091                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   10092              $C$DW$1824      .dwtag  DW_TAG_member
   10093                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$23)
   10094                      .dwattr $C$DW$1824, DW_AT_name("ECCTL1")
   10095                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_ECCTL1")
   10096                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10097                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   10098              $C$DW$1825      .dwtag  DW_TAG_member
   10099                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$23)
   10100                      .dwattr $C$DW$1825, DW_AT_name("ECCTL2")
   10101                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_ECCTL2")
   10102                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   10103                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   10104              $C$DW$1826      .dwtag  DW_TAG_member
   10105                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$23)
   10106                      .dwattr $C$DW$1826, DW_AT_name("ECEINT")
   10107                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_ECEINT")
   10108                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   10109                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   10110              $C$DW$1827      .dwtag  DW_TAG_member
   10111                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$23)
   10112                      .dwattr $C$DW$1827, DW_AT_name("ECEFLG")
   10113                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_ECEFLG")
   10114                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   10115                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   10116              $C$DW$1828      .dwtag  DW_TAG_member
   10117                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$23)
   10118                      .dwattr $C$DW$1828, DW_AT_name("ECECLR")
   10119                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_ECECLR")
   10120                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  194

   10121                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   10122              $C$DW$1829      .dwtag  DW_TAG_member
   10123                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$23)
   10124                      .dwattr $C$DW$1829, DW_AT_name("ECEFRC")
   10125                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_ECEFRC")
   10126                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   10127                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   10128                      .dwendtag $C$DW$T$34
   10129              
   10130              $C$DW$T$98      .dwtag  DW_TAG_pointer_type
   10131                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$34)
   10132                      .dwattr $C$DW$T$98, DW_AT_address_class(0x20)
   10133              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Handle")
   10134                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
   10135                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   10136              
   10137              $C$DW$T$35      .dwtag  DW_TAG_structure_type
   10138                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
   10139                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
   10140              $C$DW$1830      .dwtag  DW_TAG_member
   10141                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$23)
   10142                      .dwattr $C$DW$1830, DW_AT_name("XCLK")
   10143                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_XCLK")
   10144                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10145                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   10146              $C$DW$1831      .dwtag  DW_TAG_member
   10147                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$23)
   10148                      .dwattr $C$DW$1831, DW_AT_name("rsvd_1")
   10149                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_rsvd_1")
   10150                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10151                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   10152              $C$DW$1832      .dwtag  DW_TAG_member
   10153                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$23)
   10154                      .dwattr $C$DW$1832, DW_AT_name("CLKCTL")
   10155                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_CLKCTL")
   10156                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10157                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   10158              $C$DW$1833      .dwtag  DW_TAG_member
   10159                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$33)
   10160                      .dwattr $C$DW$1833, DW_AT_name("rsvd_2")
   10161                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_rsvd_2")
   10162                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10163                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   10164              $C$DW$1834      .dwtag  DW_TAG_member
   10165                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$23)
   10166                      .dwattr $C$DW$1834, DW_AT_name("LOSPCP")
   10167                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_LOSPCP")
   10168                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10169                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   10170              $C$DW$1835      .dwtag  DW_TAG_member
   10171                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$23)
   10172                      .dwattr $C$DW$1835, DW_AT_name("PCLKCR0")
   10173                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_PCLKCR0")
   10174                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10175                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  195

   10176              $C$DW$1836      .dwtag  DW_TAG_member
   10177                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$23)
   10178                      .dwattr $C$DW$1836, DW_AT_name("PCLKCR1")
   10179                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_PCLKCR1")
   10180                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   10181                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   10182              $C$DW$1837      .dwtag  DW_TAG_member
   10183                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$26)
   10184                      .dwattr $C$DW$1837, DW_AT_name("rsvd_3")
   10185                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_rsvd_3")
   10186                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10187                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   10188              $C$DW$1838      .dwtag  DW_TAG_member
   10189                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$23)
   10190                      .dwattr $C$DW$1838, DW_AT_name("PCLKCR3")
   10191                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_PCLKCR3")
   10192                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10193                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   10194                      .dwendtag $C$DW$T$35
   10195              
   10196              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
   10197                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$35)
   10198                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
   10199              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
   10200                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
   10201                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
   10202              
   10203              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   10204                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
   10205                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
   10206              $C$DW$1839      .dwtag  DW_TAG_member
   10207                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$36)
   10208                      .dwattr $C$DW$1839, DW_AT_name("tmp")
   10209                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_tmp")
   10210                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10211                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   10212                      .dwendtag $C$DW$T$37
   10213              
   10214              $C$DW$T$360     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
   10215                      .dwattr $C$DW$T$360, DW_AT_type(*$C$DW$T$37)
   10216                      .dwattr $C$DW$T$360, DW_AT_language(DW_LANG_C)
   10217              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
   10218                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$37)
   10219                      .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
   10220              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
   10221                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
   10222                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
   10223              
   10224              $C$DW$T$45      .dwtag  DW_TAG_structure_type
   10225                      .dwattr $C$DW$T$45, DW_AT_name("_DRV8301_Obj_")
   10226                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x08)
   10227              $C$DW$1840      .dwtag  DW_TAG_member
   10228                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$39)
   10229                      .dwattr $C$DW$1840, DW_AT_name("spiHandle")
   10230                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_spiHandle")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  196

   10231                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10232                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   10233              $C$DW$1841      .dwtag  DW_TAG_member
   10234                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$41)
   10235                      .dwattr $C$DW$1841, DW_AT_name("gpioHandle")
   10236                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_gpioHandle")
   10237                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10238                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   10239              $C$DW$1842      .dwtag  DW_TAG_member
   10240                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$43)
   10241                      .dwattr $C$DW$1842, DW_AT_name("gpioNumber")
   10242                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_gpioNumber")
   10243                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10244                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   10245              $C$DW$1843      .dwtag  DW_TAG_member
   10246                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$44)
   10247                      .dwattr $C$DW$1843, DW_AT_name("RxTimeOut")
   10248                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_RxTimeOut")
   10249                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10250                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   10251              $C$DW$1844      .dwtag  DW_TAG_member
   10252                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$44)
   10253                      .dwattr $C$DW$1844, DW_AT_name("enableTimeOut")
   10254                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_enableTimeOut")
   10255                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10256                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   10257                      .dwendtag $C$DW$T$45
   10258              
   10259              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
   10260                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$45)
   10261                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
   10262              $C$DW$T$116     .dwtag  DW_TAG_pointer_type
   10263                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$45)
   10264                      .dwattr $C$DW$T$116, DW_AT_address_class(0x20)
   10265              $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
   10266                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
   10267                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
   10268              
   10269              $C$DW$T$56      .dwtag  DW_TAG_structure_type
   10270                      .dwattr $C$DW$T$56, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   10271                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x05)
   10272              $C$DW$1845      .dwtag  DW_TAG_member
   10273                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$47)
   10274                      .dwattr $C$DW$1845, DW_AT_name("DRV8301_CURRENT")
   10275                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   10276                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10277                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   10278              $C$DW$1846      .dwtag  DW_TAG_member
   10279                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$49)
   10280                      .dwattr $C$DW$1846, DW_AT_name("DRV8301_RESET")
   10281                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_DRV8301_RESET")
   10282                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10283                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   10284              $C$DW$1847      .dwtag  DW_TAG_member
   10285                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$51)
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  197

   10286                      .dwattr $C$DW$1847, DW_AT_name("PWM_MODE")
   10287                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_PWM_MODE")
   10288                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10289                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   10290              $C$DW$1848      .dwtag  DW_TAG_member
   10291                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$53)
   10292                      .dwattr $C$DW$1848, DW_AT_name("OC_MODE")
   10293                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_OC_MODE")
   10294                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10295                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   10296              $C$DW$1849      .dwtag  DW_TAG_member
   10297                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$55)
   10298                      .dwattr $C$DW$1849, DW_AT_name("OC_ADJ_SET")
   10299                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   10300                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10301                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   10302                      .dwendtag $C$DW$T$56
   10303              
   10304              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   10305                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$56)
   10306                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
   10307              
   10308              $C$DW$T$65      .dwtag  DW_TAG_structure_type
   10309                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   10310                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
   10311              $C$DW$1850      .dwtag  DW_TAG_member
   10312                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$58)
   10313                      .dwattr $C$DW$1850, DW_AT_name("OCTW_SET")
   10314                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_OCTW_SET")
   10315                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10316                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   10317              $C$DW$1851      .dwtag  DW_TAG_member
   10318                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$60)
   10319                      .dwattr $C$DW$1851, DW_AT_name("GAIN")
   10320                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_GAIN")
   10321                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10322                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   10323              $C$DW$1852      .dwtag  DW_TAG_member
   10324                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$62)
   10325                      .dwattr $C$DW$1852, DW_AT_name("DC_CAL_CH1p2")
   10326                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   10327                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10328                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   10329              $C$DW$1853      .dwtag  DW_TAG_member
   10330                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$64)
   10331                      .dwattr $C$DW$1853, DW_AT_name("OC_TOFF")
   10332                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_OC_TOFF")
   10333                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10334                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   10335                      .dwendtag $C$DW$T$65
   10336              
   10337              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   10338                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$65)
   10339                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
   10340              
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  198

   10341              $C$DW$T$66      .dwtag  DW_TAG_structure_type
   10342                      .dwattr $C$DW$T$66, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   10343                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0b)
   10344              $C$DW$1854      .dwtag  DW_TAG_member
   10345                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$44)
   10346                      .dwattr $C$DW$1854, DW_AT_name("FAULT")
   10347                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_FAULT")
   10348                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10349                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   10350              $C$DW$1855      .dwtag  DW_TAG_member
   10351                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$44)
   10352                      .dwattr $C$DW$1855, DW_AT_name("GVDD_UV")
   10353                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_GVDD_UV")
   10354                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10355                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   10356              $C$DW$1856      .dwtag  DW_TAG_member
   10357                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$44)
   10358                      .dwattr $C$DW$1856, DW_AT_name("PVDD_UV")
   10359                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_PVDD_UV")
   10360                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10361                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   10362              $C$DW$1857      .dwtag  DW_TAG_member
   10363                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$44)
   10364                      .dwattr $C$DW$1857, DW_AT_name("OTSD")
   10365                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_OTSD")
   10366                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10367                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   10368              $C$DW$1858      .dwtag  DW_TAG_member
   10369                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$44)
   10370                      .dwattr $C$DW$1858, DW_AT_name("OTW")
   10371                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_OTW")
   10372                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10373                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   10374              $C$DW$1859      .dwtag  DW_TAG_member
   10375                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$44)
   10376                      .dwattr $C$DW$1859, DW_AT_name("FETHA_OC")
   10377                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_FETHA_OC")
   10378                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10379                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   10380              $C$DW$1860      .dwtag  DW_TAG_member
   10381                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$44)
   10382                      .dwattr $C$DW$1860, DW_AT_name("FETLA_OC")
   10383                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_FETLA_OC")
   10384                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10385                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   10386              $C$DW$1861      .dwtag  DW_TAG_member
   10387                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$44)
   10388                      .dwattr $C$DW$1861, DW_AT_name("FETHB_OC")
   10389                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_FETHB_OC")
   10390                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10391                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   10392              $C$DW$1862      .dwtag  DW_TAG_member
   10393                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$44)
   10394                      .dwattr $C$DW$1862, DW_AT_name("FETLB_OC")
   10395                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_FETLB_OC")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  199

   10396                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10397                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   10398              $C$DW$1863      .dwtag  DW_TAG_member
   10399                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$44)
   10400                      .dwattr $C$DW$1863, DW_AT_name("FETHC_OC")
   10401                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_FETHC_OC")
   10402                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   10403                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   10404              $C$DW$1864      .dwtag  DW_TAG_member
   10405                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$44)
   10406                      .dwattr $C$DW$1864, DW_AT_name("FETLC_OC")
   10407                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_FETLC_OC")
   10408                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10409                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   10410                      .dwendtag $C$DW$T$66
   10411              
   10412              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   10413                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$66)
   10414                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   10415              
   10416              $C$DW$T$67      .dwtag  DW_TAG_structure_type
   10417                      .dwattr $C$DW$T$67, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   10418                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x02)
   10419              $C$DW$1865      .dwtag  DW_TAG_member
   10420                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$44)
   10421                      .dwattr $C$DW$1865, DW_AT_name("GVDD_OV")
   10422                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_GVDD_OV")
   10423                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10424                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   10425              $C$DW$1866      .dwtag  DW_TAG_member
   10426                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$22)
   10427                      .dwattr $C$DW$1866, DW_AT_name("DeviceID")
   10428                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_DeviceID")
   10429                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10430                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   10431                      .dwendtag $C$DW$T$67
   10432              
   10433              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   10434                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$67)
   10435                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   10436              
   10437              $C$DW$T$72      .dwtag  DW_TAG_structure_type
   10438                      .dwattr $C$DW$T$72, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   10439                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x18)
   10440              $C$DW$1867      .dwtag  DW_TAG_member
   10441                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$68)
   10442                      .dwattr $C$DW$1867, DW_AT_name("Stat_Reg_1")
   10443                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_Stat_Reg_1")
   10444                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10445                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   10446              $C$DW$1868      .dwtag  DW_TAG_member
   10447                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$69)
   10448                      .dwattr $C$DW$1868, DW_AT_name("Stat_Reg_2")
   10449                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_Stat_Reg_2")
   10450                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  200

   10451                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   10452              $C$DW$1869      .dwtag  DW_TAG_member
   10453                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$70)
   10454                      .dwattr $C$DW$1869, DW_AT_name("Ctrl_Reg_1")
   10455                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   10456                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   10457                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   10458              $C$DW$1870      .dwtag  DW_TAG_member
   10459                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$71)
   10460                      .dwattr $C$DW$1870, DW_AT_name("Ctrl_Reg_2")
   10461                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   10462                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10463                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   10464              $C$DW$1871      .dwtag  DW_TAG_member
   10465                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$44)
   10466                      .dwattr $C$DW$1871, DW_AT_name("SndCmd")
   10467                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_SndCmd")
   10468                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   10469                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   10470              $C$DW$1872      .dwtag  DW_TAG_member
   10471                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$44)
   10472                      .dwattr $C$DW$1872, DW_AT_name("RcvCmd")
   10473                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_RcvCmd")
   10474                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   10475                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   10476                      .dwendtag $C$DW$T$72
   10477              
   10478              $C$DW$T$367     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
   10479                      .dwattr $C$DW$T$367, DW_AT_type(*$C$DW$T$72)
   10480                      .dwattr $C$DW$T$367, DW_AT_language(DW_LANG_C)
   10481              $C$DW$T$368     .dwtag  DW_TAG_pointer_type
   10482                      .dwattr $C$DW$T$368, DW_AT_type(*$C$DW$T$367)
   10483                      .dwattr $C$DW$T$368, DW_AT_address_class(0x20)
   10484              
   10485              $C$DW$T$74      .dwtag  DW_TAG_structure_type
   10486                      .dwattr $C$DW$T$74, DW_AT_name("_FILTER_FO_")
   10487                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
   10488              $C$DW$1873      .dwtag  DW_TAG_member
   10489                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$73)
   10490                      .dwattr $C$DW$1873, DW_AT_name("a1")
   10491                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_a1")
   10492                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10493                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   10494              $C$DW$1874      .dwtag  DW_TAG_member
   10495                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$73)
   10496                      .dwattr $C$DW$1874, DW_AT_name("b0")
   10497                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_b0")
   10498                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10499                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   10500              $C$DW$1875      .dwtag  DW_TAG_member
   10501                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$73)
   10502                      .dwattr $C$DW$1875, DW_AT_name("b1")
   10503                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_b1")
   10504                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10505                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  201

   10506              $C$DW$1876      .dwtag  DW_TAG_member
   10507                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$73)
   10508                      .dwattr $C$DW$1876, DW_AT_name("x1")
   10509                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_x1")
   10510                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10511                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   10512              $C$DW$1877      .dwtag  DW_TAG_member
   10513                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$73)
   10514                      .dwattr $C$DW$1877, DW_AT_name("y1")
   10515                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_y1")
   10516                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10517                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   10518                      .dwendtag $C$DW$T$74
   10519              
   10520              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
   10521                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$74)
   10522                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
   10523              
   10524              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   10525                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
   10526                      .dwattr $C$DW$T$20, DW_AT_declaration
   10527                      .dwendtag $C$DW$T$20
   10528              
   10529              $C$DW$T$123     .dwtag  DW_TAG_pointer_type
   10530                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$20)
   10531                      .dwattr $C$DW$T$123, DW_AT_address_class(0x20)
   10532              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
   10533                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
   10534                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
   10535              
   10536              $C$DW$T$75      .dwtag  DW_TAG_structure_type
   10537                      .dwattr $C$DW$T$75, DW_AT_name("_FLASH_Obj_")
   10538                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
   10539              $C$DW$1878      .dwtag  DW_TAG_member
   10540                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$23)
   10541                      .dwattr $C$DW$1878, DW_AT_name("FOPT")
   10542                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_FOPT")
   10543                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10544                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   10545              $C$DW$1879      .dwtag  DW_TAG_member
   10546                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$23)
   10547                      .dwattr $C$DW$1879, DW_AT_name("rsvd_1")
   10548                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_rsvd_1")
   10549                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10550                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   10551              $C$DW$1880      .dwtag  DW_TAG_member
   10552                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$23)
   10553                      .dwattr $C$DW$1880, DW_AT_name("FPWR")
   10554                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_FPWR")
   10555                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10556                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   10557              $C$DW$1881      .dwtag  DW_TAG_member
   10558                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$23)
   10559                      .dwattr $C$DW$1881, DW_AT_name("FSTATUS")
   10560                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_FSTATUS")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  202

   10561                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10562                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   10563              $C$DW$1882      .dwtag  DW_TAG_member
   10564                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$23)
   10565                      .dwattr $C$DW$1882, DW_AT_name("FSTDBYWAIT")
   10566                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   10567                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10568                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   10569              $C$DW$1883      .dwtag  DW_TAG_member
   10570                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$23)
   10571                      .dwattr $C$DW$1883, DW_AT_name("FACTIVEWAIT")
   10572                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   10573                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10574                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   10575              $C$DW$1884      .dwtag  DW_TAG_member
   10576                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$23)
   10577                      .dwattr $C$DW$1884, DW_AT_name("FBANKWAIT")
   10578                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_FBANKWAIT")
   10579                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10580                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   10581              $C$DW$1885      .dwtag  DW_TAG_member
   10582                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$23)
   10583                      .dwattr $C$DW$1885, DW_AT_name("FOTPWAIT")
   10584                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_FOTPWAIT")
   10585                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10586                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   10587                      .dwendtag $C$DW$T$75
   10588              
   10589              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
   10590                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$75)
   10591                      .dwattr $C$DW$T$87, DW_AT_address_class(0x20)
   10592              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
   10593                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
   10594                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
   10595              
   10596              $C$DW$T$78      .dwtag  DW_TAG_structure_type
   10597                      .dwattr $C$DW$T$78, DW_AT_name("_GPIO_Obj_")
   10598                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x6a)
   10599              $C$DW$1886      .dwtag  DW_TAG_member
   10600                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$32)
   10601                      .dwattr $C$DW$1886, DW_AT_name("GPACTRL")
   10602                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_GPACTRL")
   10603                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10604                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   10605              $C$DW$1887      .dwtag  DW_TAG_member
   10606                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$32)
   10607                      .dwattr $C$DW$1887, DW_AT_name("GPAQSEL1")
   10608                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_GPAQSEL1")
   10609                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10610                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   10611              $C$DW$1888      .dwtag  DW_TAG_member
   10612                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$32)
   10613                      .dwattr $C$DW$1888, DW_AT_name("GPAQSEL2")
   10614                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_GPAQSEL2")
   10615                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  203

   10616                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   10617              $C$DW$1889      .dwtag  DW_TAG_member
   10618                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$32)
   10619                      .dwattr $C$DW$1889, DW_AT_name("GPAMUX1")
   10620                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_GPAMUX1")
   10621                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10622                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   10623              $C$DW$1890      .dwtag  DW_TAG_member
   10624                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$32)
   10625                      .dwattr $C$DW$1890, DW_AT_name("GPAMUX2")
   10626                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_GPAMUX2")
   10627                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10628                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   10629              $C$DW$1891      .dwtag  DW_TAG_member
   10630                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$32)
   10631                      .dwattr $C$DW$1891, DW_AT_name("GPADIR")
   10632                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_GPADIR")
   10633                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10634                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   10635              $C$DW$1892      .dwtag  DW_TAG_member
   10636                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$32)
   10637                      .dwattr $C$DW$1892, DW_AT_name("GPAPUD")
   10638                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_GPAPUD")
   10639                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10640                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   10641              $C$DW$1893      .dwtag  DW_TAG_member
   10642                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$26)
   10643                      .dwattr $C$DW$1893, DW_AT_name("rsvd_1")
   10644                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_rsvd_1")
   10645                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10646                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   10647              $C$DW$1894      .dwtag  DW_TAG_member
   10648                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$32)
   10649                      .dwattr $C$DW$1894, DW_AT_name("GPBCTRL")
   10650                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_GPBCTRL")
   10651                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10652                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   10653              $C$DW$1895      .dwtag  DW_TAG_member
   10654                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$32)
   10655                      .dwattr $C$DW$1895, DW_AT_name("GPBQSEL1")
   10656                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_GPBQSEL1")
   10657                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10658                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   10659              $C$DW$1896      .dwtag  DW_TAG_member
   10660                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$26)
   10661                      .dwattr $C$DW$1896, DW_AT_name("rsvd_2")
   10662                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_rsvd_2")
   10663                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10664                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   10665              $C$DW$1897      .dwtag  DW_TAG_member
   10666                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$32)
   10667                      .dwattr $C$DW$1897, DW_AT_name("GPBMUX1")
   10668                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_GPBMUX1")
   10669                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   10670                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  204

   10671              $C$DW$1898      .dwtag  DW_TAG_member
   10672                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$26)
   10673                      .dwattr $C$DW$1898, DW_AT_name("rsvd_3")
   10674                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_rsvd_3")
   10675                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   10676                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   10677              $C$DW$1899      .dwtag  DW_TAG_member
   10678                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$32)
   10679                      .dwattr $C$DW$1899, DW_AT_name("GPBDIR")
   10680                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_GPBDIR")
   10681                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10682                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   10683              $C$DW$1900      .dwtag  DW_TAG_member
   10684                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$32)
   10685                      .dwattr $C$DW$1900, DW_AT_name("GPBPUD")
   10686                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_GPBPUD")
   10687                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   10688                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   10689              $C$DW$1901      .dwtag  DW_TAG_member
   10690                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$76)
   10691                      .dwattr $C$DW$1901, DW_AT_name("rsvd_4")
   10692                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_rsvd_4")
   10693                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   10694                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   10695              $C$DW$1902      .dwtag  DW_TAG_member
   10696                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$32)
   10697                      .dwattr $C$DW$1902, DW_AT_name("AIOMUX1")
   10698                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_AIOMUX1")
   10699                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10700                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   10701              $C$DW$1903      .dwtag  DW_TAG_member
   10702                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$26)
   10703                      .dwattr $C$DW$1903, DW_AT_name("rsvd_5")
   10704                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_rsvd_5")
   10705                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10706                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   10707              $C$DW$1904      .dwtag  DW_TAG_member
   10708                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$32)
   10709                      .dwattr $C$DW$1904, DW_AT_name("AIODIR")
   10710                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_AIODIR")
   10711                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10712                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   10713              $C$DW$1905      .dwtag  DW_TAG_member
   10714                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$77)
   10715                      .dwattr $C$DW$1905, DW_AT_name("rsvd_6")
   10716                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_rsvd_6")
   10717                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10718                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   10719              $C$DW$1906      .dwtag  DW_TAG_member
   10720                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$32)
   10721                      .dwattr $C$DW$1906, DW_AT_name("GPADAT")
   10722                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_GPADAT")
   10723                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10724                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   10725              $C$DW$1907      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  205

   10726                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$32)
   10727                      .dwattr $C$DW$1907, DW_AT_name("GPASET")
   10728                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_GPASET")
   10729                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   10730                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   10731              $C$DW$1908      .dwtag  DW_TAG_member
   10732                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$32)
   10733                      .dwattr $C$DW$1908, DW_AT_name("GPACLEAR")
   10734                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_GPACLEAR")
   10735                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   10736                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   10737              $C$DW$1909      .dwtag  DW_TAG_member
   10738                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$32)
   10739                      .dwattr $C$DW$1909, DW_AT_name("GPATOGGLE")
   10740                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_GPATOGGLE")
   10741                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10742                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   10743              $C$DW$1910      .dwtag  DW_TAG_member
   10744                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$32)
   10745                      .dwattr $C$DW$1910, DW_AT_name("GPBDAT")
   10746                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_GPBDAT")
   10747                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   10748                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   10749              $C$DW$1911      .dwtag  DW_TAG_member
   10750                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$32)
   10751                      .dwattr $C$DW$1911, DW_AT_name("GPBSET")
   10752                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_GPBSET")
   10753                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   10754                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   10755              $C$DW$1912      .dwtag  DW_TAG_member
   10756                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$32)
   10757                      .dwattr $C$DW$1912, DW_AT_name("GPBCLEAR")
   10758                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_GPBCLEAR")
   10759                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   10760                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   10761              $C$DW$1913      .dwtag  DW_TAG_member
   10762                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$32)
   10763                      .dwattr $C$DW$1913, DW_AT_name("GPBTOGGLE")
   10764                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_GPBTOGGLE")
   10765                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   10766                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   10767              $C$DW$1914      .dwtag  DW_TAG_member
   10768                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$33)
   10769                      .dwattr $C$DW$1914, DW_AT_name("rsvd_7")
   10770                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_rsvd_7")
   10771                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   10772                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   10773              $C$DW$1915      .dwtag  DW_TAG_member
   10774                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$32)
   10775                      .dwattr $C$DW$1915, DW_AT_name("AIODAT")
   10776                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_AIODAT")
   10777                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   10778                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   10779              $C$DW$1916      .dwtag  DW_TAG_member
   10780                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  206

   10781                      .dwattr $C$DW$1916, DW_AT_name("AIOSET")
   10782                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_AIOSET")
   10783                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   10784                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   10785              $C$DW$1917      .dwtag  DW_TAG_member
   10786                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$32)
   10787                      .dwattr $C$DW$1917, DW_AT_name("AIOCLEAR")
   10788                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_AIOCLEAR")
   10789                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   10790                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   10791              $C$DW$1918      .dwtag  DW_TAG_member
   10792                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$32)
   10793                      .dwattr $C$DW$1918, DW_AT_name("AIOTOGGLE")
   10794                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_AIOTOGGLE")
   10795                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   10796                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   10797              $C$DW$1919      .dwtag  DW_TAG_member
   10798                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$28)
   10799                      .dwattr $C$DW$1919, DW_AT_name("GPIOXINTnSEL")
   10800                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   10801                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   10802                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   10803              $C$DW$1920      .dwtag  DW_TAG_member
   10804                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$27)
   10805                      .dwattr $C$DW$1920, DW_AT_name("rsvd_8")
   10806                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_rsvd_8")
   10807                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   10808                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   10809              $C$DW$1921      .dwtag  DW_TAG_member
   10810                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$32)
   10811                      .dwattr $C$DW$1921, DW_AT_name("GPIOLPMSEL")
   10812                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   10813                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   10814                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   10815                      .dwendtag $C$DW$T$78
   10816              
   10817              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
   10818                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$78)
   10819                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
   10820              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
   10821                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
   10822                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
   10823              
   10824              $C$DW$T$80      .dwtag  DW_TAG_structure_type
   10825                      .dwattr $C$DW$T$80, DW_AT_name("_HAL_AdcData_t_")
   10826                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x0e)
   10827              $C$DW$1922      .dwtag  DW_TAG_member
   10828                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$79)
   10829                      .dwattr $C$DW$1922, DW_AT_name("I")
   10830                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_I")
   10831                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10832                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   10833              $C$DW$1923      .dwtag  DW_TAG_member
   10834                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$79)
   10835                      .dwattr $C$DW$1923, DW_AT_name("V")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  207

   10836                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_V")
   10837                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10838                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
   10839              $C$DW$1924      .dwtag  DW_TAG_member
   10840                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$73)
   10841                      .dwattr $C$DW$1924, DW_AT_name("dcBus")
   10842                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_dcBus")
   10843                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10844                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
   10845                      .dwendtag $C$DW$T$80
   10846              
   10847              $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   10848                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$80)
   10849                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
   10850              
   10851              $C$DW$T$119     .dwtag  DW_TAG_structure_type
   10852                      .dwattr $C$DW$T$119, DW_AT_name("_HAL_Obj_")
   10853                      .dwattr $C$DW$T$119, DW_AT_byte_size(0xc6)
   10854              $C$DW$1925      .dwtag  DW_TAG_member
   10855                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$82)
   10856                      .dwattr $C$DW$1925, DW_AT_name("adcHandle")
   10857                      .dwattr $C$DW$1925, DW_AT_TI_symbol_name("_adcHandle")
   10858                      .dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10859                      .dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
   10860              $C$DW$1926      .dwtag  DW_TAG_member
   10861                      .dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$84)
   10862                      .dwattr $C$DW$1926, DW_AT_name("clkHandle")
   10863                      .dwattr $C$DW$1926, DW_AT_TI_symbol_name("_clkHandle")
   10864                      .dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10865                      .dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
   10866              $C$DW$1927      .dwtag  DW_TAG_member
   10867                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$86)
   10868                      .dwattr $C$DW$1927, DW_AT_name("cpuHandle")
   10869                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_cpuHandle")
   10870                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10871                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   10872              $C$DW$1928      .dwtag  DW_TAG_member
   10873                      .dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$88)
   10874                      .dwattr $C$DW$1928, DW_AT_name("flashHandle")
   10875                      .dwattr $C$DW$1928, DW_AT_TI_symbol_name("_flashHandle")
   10876                      .dwattr $C$DW$1928, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10877                      .dwattr $C$DW$1928, DW_AT_accessibility(DW_ACCESS_public)
   10878              $C$DW$1929      .dwtag  DW_TAG_member
   10879                      .dwattr $C$DW$1929, DW_AT_type(*$C$DW$T$41)
   10880                      .dwattr $C$DW$1929, DW_AT_name("gpioHandle")
   10881                      .dwattr $C$DW$1929, DW_AT_TI_symbol_name("_gpioHandle")
   10882                      .dwattr $C$DW$1929, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10883                      .dwattr $C$DW$1929, DW_AT_accessibility(DW_ACCESS_public)
   10884              $C$DW$1930      .dwtag  DW_TAG_member
   10885                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$91)
   10886                      .dwattr $C$DW$1930, DW_AT_name("offsetHandle_I")
   10887                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_offsetHandle_I")
   10888                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10889                      .dwattr $C$DW$1930, DW_AT_accessibility(DW_ACCESS_public)
   10890              $C$DW$1931      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  208

   10891                      .dwattr $C$DW$1931, DW_AT_type(*$C$DW$T$93)
   10892                      .dwattr $C$DW$1931, DW_AT_name("offset_I")
   10893                      .dwattr $C$DW$1931, DW_AT_TI_symbol_name("_offset_I")
   10894                      .dwattr $C$DW$1931, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10895                      .dwattr $C$DW$1931, DW_AT_accessibility(DW_ACCESS_public)
   10896              $C$DW$1932      .dwtag  DW_TAG_member
   10897                      .dwattr $C$DW$1932, DW_AT_type(*$C$DW$T$91)
   10898                      .dwattr $C$DW$1932, DW_AT_name("offsetHandle_V")
   10899                      .dwattr $C$DW$1932, DW_AT_TI_symbol_name("_offsetHandle_V")
   10900                      .dwattr $C$DW$1932, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10901                      .dwattr $C$DW$1932, DW_AT_accessibility(DW_ACCESS_public)
   10902              $C$DW$1933      .dwtag  DW_TAG_member
   10903                      .dwattr $C$DW$1933, DW_AT_type(*$C$DW$T$93)
   10904                      .dwattr $C$DW$1933, DW_AT_name("offset_V")
   10905                      .dwattr $C$DW$1933, DW_AT_TI_symbol_name("_offset_V")
   10906                      .dwattr $C$DW$1933, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10907                      .dwattr $C$DW$1933, DW_AT_accessibility(DW_ACCESS_public)
   10908              $C$DW$1934      .dwtag  DW_TAG_member
   10909                      .dwattr $C$DW$1934, DW_AT_type(*$C$DW$T$95)
   10910                      .dwattr $C$DW$1934, DW_AT_name("oscHandle")
   10911                      .dwattr $C$DW$1934, DW_AT_TI_symbol_name("_oscHandle")
   10912                      .dwattr $C$DW$1934, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   10913                      .dwattr $C$DW$1934, DW_AT_accessibility(DW_ACCESS_public)
   10914              $C$DW$1935      .dwtag  DW_TAG_member
   10915                      .dwattr $C$DW$1935, DW_AT_type(*$C$DW$T$97)
   10916                      .dwattr $C$DW$1935, DW_AT_name("pieHandle")
   10917                      .dwattr $C$DW$1935, DW_AT_TI_symbol_name("_pieHandle")
   10918                      .dwattr $C$DW$1935, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   10919                      .dwattr $C$DW$1935, DW_AT_accessibility(DW_ACCESS_public)
   10920              $C$DW$1936      .dwtag  DW_TAG_member
   10921                      .dwattr $C$DW$1936, DW_AT_type(*$C$DW$T$99)
   10922                      .dwattr $C$DW$1936, DW_AT_name("capHandle")
   10923                      .dwattr $C$DW$1936, DW_AT_TI_symbol_name("_capHandle")
   10924                      .dwattr $C$DW$1936, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   10925                      .dwattr $C$DW$1936, DW_AT_accessibility(DW_ACCESS_public)
   10926              $C$DW$1937      .dwtag  DW_TAG_member
   10927                      .dwattr $C$DW$1937, DW_AT_type(*$C$DW$T$101)
   10928                      .dwattr $C$DW$1937, DW_AT_name("i2cHandle")
   10929                      .dwattr $C$DW$1937, DW_AT_TI_symbol_name("_i2cHandle")
   10930                      .dwattr $C$DW$1937, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   10931                      .dwattr $C$DW$1937, DW_AT_accessibility(DW_ACCESS_public)
   10932              $C$DW$1938      .dwtag  DW_TAG_member
   10933                      .dwattr $C$DW$1938, DW_AT_type(*$C$DW$T$103)
   10934                      .dwattr $C$DW$1938, DW_AT_name("pllHandle")
   10935                      .dwattr $C$DW$1938, DW_AT_TI_symbol_name("_pllHandle")
   10936                      .dwattr $C$DW$1938, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
   10937                      .dwattr $C$DW$1938, DW_AT_accessibility(DW_ACCESS_public)
   10938              $C$DW$1939      .dwtag  DW_TAG_member
   10939                      .dwattr $C$DW$1939, DW_AT_type(*$C$DW$T$106)
   10940                      .dwattr $C$DW$1939, DW_AT_name("pwmHandle")
   10941                      .dwattr $C$DW$1939, DW_AT_TI_symbol_name("_pwmHandle")
   10942                      .dwattr $C$DW$1939, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
   10943                      .dwattr $C$DW$1939, DW_AT_accessibility(DW_ACCESS_public)
   10944              $C$DW$1940      .dwtag  DW_TAG_member
   10945                      .dwattr $C$DW$1940, DW_AT_type(*$C$DW$T$106)
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\8267610                         PAGE  209

   10946                      .dwattr $C$DW$1940, DW_AT_name("pwmDacHandle")
   10947                      .dwattr $C$DW$1940, DW_AT_TI_symbol_name("_pwmDacHandle")
   10948                      .dwattr $C$DW$1940, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
   10949                      .dwattr $C$DW$1940, DW_AT_accessibility(DW_ACCESS_public)
   10950              $C$DW$1941      .dwtag  DW_TAG_member
   10951                      .dwattr $C$DW$1941, DW_AT_type(*$C$DW$T$108)
   10952                      .dwattr $C$DW$1941, DW_AT_name("pwrHandle")
   10953                      .dwattr $C$DW$1941, DW_AT_TI_symbol_name("_pwrHandle")
   10954                      .dwattr $C$DW$1941, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
   10955                      .dwattr $C$DW$1941, DW_AT_accessibility(DW_ACCESS_public)
   10956              $C$DW$1942      .dwtag  DW_TAG_member
   10957                      .dwattr $C$DW$1942, DW_AT_type(*$C$DW$T$111)
   10958                      .dwattr $C$DW$1942, DW_AT_name("timerHandle")
   10959                      .dwattr $C$DW$1942, DW_AT_TI_symbol_name("_timerHandle")
   10960                      .dwattr $C$DW$1942, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
   10961                      .dwattr $C$DW$1942, DW_AT_accessibility(DW_ACCESS_public)
   10962              $C$DW$1943      .dwtag  DW_TAG_member
   10963                      .dwattr $C$DW$1943, DW_AT_type(*$C$DW$T$113)
   10964                      .dwattr $C$DW$1943, DW_AT_name("wdogHandle")
   10965                      .dwattr $C$DW$1943, DW_AT_TI_symbol_name("_wdogHandle")
   10966                      .dwattr $C$DW$1943, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   10967                      .dwattr $C$DW$1943, DW_AT_accessibility(DW_ACCESS_public)
   10968              $C$DW$1944      .dwtag  DW_TAG_member
   10969                      .dwattr $C$DW$1944, DW_AT_type(*$C$DW$T$114)
   10970                      .dwattr $C$DW$1944, DW_AT_name("adcBias")
   10971                      .dwattr $C$DW$1944, DW_AT_TI_symbol_name("_adcBias")
   10972                      .dwattr $C$DW$1944, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
   10973                      .dwattr $C$DW$1944, DW_AT_accessibility(DW_ACCESS_public)
   10974              $C$DW$1945      .dwtag  DW_TAG_member
   10975                      .dwattr $C$DW$1945, DW_AT_type(*$C$DW$T$73)
   10976                      .dwattr $C$DW$1945, DW_AT_name("current_sf")
   10977                      .dwattr $C$DW$1945, DW_AT_TI_symbol_name("_current_sf")
   10978                      .dwattr $C$DW$1945, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
   10979                      .dwattr $C$DW$1945, DW_AT_accessibility(DW_ACCESS_public)
   10980              $C$DW$1946      .dwtag  DW_TAG_member
   10981                      .dwattr $C$DW$1946, DW_AT_type(*$C$DW$T$73)
   10982                      .dwattr $C$DW$1946, DW_AT_name("voltage_sf")
   10983                      .dwattr $C$DW$1946, DW_AT_TI_symbol_name("_voltage_sf")
   10984                      .dwattr $C$DW$1946, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
   10985                      .dwattr $C$DW$1946, DW_AT_accessibility(DW_ACCESS_public)
   10986              $C$DW$1947      .dwtag  DW_TAG_member
   10987                      .dwattr $C$DW$1947, DW_AT_type(*$C$DW$T$36)
