TMS320C2000 Assembler PC v6.4.9 Wed Jan 20 10:55:47 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0082010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.9 *
       3              ;* Date/Time created: Wed Jan 20 10:55:47 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/drivers/i2c/src/32b/f28x/f2806x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.9 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\BenBracy\Documents\TI FOC\proj_lab09\Flash")
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.9\bin\opt2000.exe C:\\Users\\BenBracy\\AppData\\Local\\Te

    3688              $C$DW$T$34      .dwtag  DW_TAG_enumeration_type
    3689                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    3690              $C$DW$293       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoStatus_Empty"), DW_AT_const_value(0x00)
    3691              $C$DW$294       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoStatus_1_Word"), DW_AT_const_value(0x100)
    3692              $C$DW$295       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoStatus_2_Words"), DW_AT_const_value(0x200)
    3693              $C$DW$296       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoStatus_3_Words"), DW_AT_const_value(0x300)
    3694              $C$DW$297       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoStatus_4_Words"), DW_AT_const_value(0x400)
    3695                      .dwendtag $C$DW$T$34
    3696              
    3697              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_FifoStatus_e")
    3698                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3699                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3700              
    3701              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
    3702                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    3703              $C$DW$298       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoLevel_Empty"), DW_AT_const_value(0x00)
    3704              $C$DW$299       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoLevel_1_Word"), DW_AT_const_value(0x01)
    3705              $C$DW$300       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoLevel_2_Words"), DW_AT_const_value(0x02)
    3706              $C$DW$301       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoLevel_3_Words"), DW_AT_const_value(0x03)
    3707              $C$DW$302       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoLevel_4_Words"), DW_AT_const_value(0x04)
    3708                      .dwendtag $C$DW$T$38
    3709              
    3710              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_FifoLevel_e")
    3711                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    3712                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3713              $C$DW$303       .dwtag  DW_TAG_TI_far_type
    3714                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$39)
    3715              $C$DW$T$40      .dwtag  DW_TAG_const_type
    3716                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$303)
    3717              
    3718              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    3719                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    3720              $C$DW$304       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_1_Bit"), DW_AT_const_value(0x01)
    3721              $C$DW$305       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_2_Bits"), DW_AT_const_value(0x02)
    3722              $C$DW$306       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_3_Bits"), DW_AT_const_value(0x03)
    3723              $C$DW$307       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_4_Bits"), DW_AT_const_value(0x04)
    3724              $C$DW$308       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_5_Bits"), DW_AT_const_value(0x05)
    3725              $C$DW$309       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_6_Bits"), DW_AT_const_value(0x06)
    3726              $C$DW$310       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_7_Bits"), DW_AT_const_value(0x07)
    3727              $C$DW$311       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_8_Bits"), DW_AT_const_value(0x00)
    3728                      .dwendtag $C$DW$T$41
    3729              
    3730              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_BitCount_e")
    3731                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    3732                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3733              $C$DW$312       .dwtag  DW_TAG_TI_far_type
    3734                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$42)
    3735              $C$DW$T$43      .dwtag  DW_TAG_const_type
    3736                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$312)
    3737              
TMS320C2000 Assembler PC v6.4.9 Wed Jan 20 10:55:47 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0082010                         PAGE   70

    3738              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3739                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3740                      .dwattr $C$DW$T$19, DW_AT_declaration
    3741                      .dwendtag $C$DW$T$19
    3742              
    3743              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    3744                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$19)
    3745                      .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    3746              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    3747                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    3748                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3749              $C$DW$313       .dwtag  DW_TAG_TI_far_type
    3750                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$31)
    3751              $C$DW$T$44      .dwtag  DW_TAG_const_type
    3752                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$313)
    3753              
    3754              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3755                      .dwattr $C$DW$T$24, DW_AT_name("_I2C_Obj_")
    3756                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x22)
    3757              $C$DW$314       .dwtag  DW_TAG_member
    3758                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
    3759                      .dwattr $C$DW$314, DW_AT_name("I2COAR")
    3760                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_I2COAR")
    3761                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3762                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3763              $C$DW$315       .dwtag  DW_TAG_member
    3764                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$21)
    3765                      .dwattr $C$DW$315, DW_AT_name("I2CIER")
    3766                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_I2CIER")
    3767                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3768                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3769              $C$DW$316       .dwtag  DW_TAG_member
    3770                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$21)
    3771                      .dwattr $C$DW$316, DW_AT_name("I2CSTR")
    3772                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_I2CSTR")
    3773                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3774                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3775              $C$DW$317       .dwtag  DW_TAG_member
    3776                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$21)
    3777                      .dwattr $C$DW$317, DW_AT_name("I2CCLKL")
    3778                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_I2CCLKL")
    3779                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3780                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3781              $C$DW$318       .dwtag  DW_TAG_member
    3782                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$21)
    3783                      .dwattr $C$DW$318, DW_AT_name("I2CCLKH")
    3784                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_I2CCLKH")
    3785                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3786                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3787              $C$DW$319       .dwtag  DW_TAG_member
    3788                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$21)
    3789                      .dwattr $C$DW$319, DW_AT_name("I2CCNT")
    3790                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_I2CCNT")
    3791                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3792                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Wed Jan 20 10:55:47 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0082010                         PAGE   71

    3793              $C$DW$320       .dwtag  DW_TAG_member
    3794                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$21)
    3795                      .dwattr $C$DW$320, DW_AT_name("I2CDRR")
    3796                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_I2CDRR")
    3797                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3798                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3799              $C$DW$321       .dwtag  DW_TAG_member
    3800                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$21)
    3801                      .dwattr $C$DW$321, DW_AT_name("I2CSAR")
    3802                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_I2CSAR")
    3803                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3804                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3805              $C$DW$322       .dwtag  DW_TAG_member
    3806                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
    3807                      .dwattr $C$DW$322, DW_AT_name("I2CDXR")
    3808                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_I2CDXR")
    3809                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3810                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3811              $C$DW$323       .dwtag  DW_TAG_member
    3812                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$21)
    3813                      .dwattr $C$DW$323, DW_AT_name("I2CMDR")
    3814                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_I2CMDR")
    3815                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3816                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3817              $C$DW$324       .dwtag  DW_TAG_member
    3818                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$21)
    3819                      .dwattr $C$DW$324, DW_AT_name("I2CISRC")
    3820                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_I2CISRC")
    3821                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3822                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3823              $C$DW$325       .dwtag  DW_TAG_member
    3824                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$21)
    3825                      .dwattr $C$DW$325, DW_AT_name("I2CEMDR")
    3826                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_I2CEMDR")
    3827                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3828                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3829              $C$DW$326       .dwtag  DW_TAG_member
    3830                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$21)
    3831                      .dwattr $C$DW$326, DW_AT_name("I2CPSC")
    3832                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_I2CPSC")
    3833                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3834                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3835              $C$DW$327       .dwtag  DW_TAG_member
    3836                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$23)
    3837                      .dwattr $C$DW$327, DW_AT_name("I2CD1")
    3838                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_I2CD1")
    3839                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3840                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3841              $C$DW$328       .dwtag  DW_TAG_member
    3842                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$23)
    3843                      .dwattr $C$DW$328, DW_AT_name("I2CD2")
    3844                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_I2CD2")
    3845                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3846                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3847              $C$DW$329       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Wed Jan 20 10:55:47 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0082010                         PAGE   72

    3848                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$23)
    3849                      .dwattr $C$DW$329, DW_AT_name("I2CD3")
    3850                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_I2CD3")
    3851                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3852                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3853              $C$DW$330       .dwtag  DW_TAG_member
    3854                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$23)
    3855                      .dwattr $C$DW$330, DW_AT_name("I2CD4")
    3856                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_I2CD4")
    3857                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3858                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3859              $C$DW$331       .dwtag  DW_TAG_member
    3860                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$23)
    3861                      .dwattr $C$DW$331, DW_AT_name("I2CD5")
    3862                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_I2CD5")
    3863                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3864                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3865              $C$DW$332       .dwtag  DW_TAG_member
    3866                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$23)
    3867                      .dwattr $C$DW$332, DW_AT_name("I2CD6")
    3868                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_I2CD6")
    3869                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3870                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3871              $C$DW$333       .dwtag  DW_TAG_member
    3872                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$23)
    3873                      .dwattr $C$DW$333, DW_AT_name("I2CD7")
    3874                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_I2CD7")
    3875                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3876                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3877              $C$DW$334       .dwtag  DW_TAG_member
    3878                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$23)
    3879                      .dwattr $C$DW$334, DW_AT_name("I2CD8")
    3880                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_I2CD8")
    3881                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3882                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3883              $C$DW$335       .dwtag  DW_TAG_member
    3884                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$23)
    3885                      .dwattr $C$DW$335, DW_AT_name("I2CD9")
    3886                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_I2CD9")
    3887                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3888                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3889              $C$DW$336       .dwtag  DW_TAG_member
    3890                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$21)
    3891                      .dwattr $C$DW$336, DW_AT_name("I2CFFTX")
    3892                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_I2CFFTX")
    3893                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3894                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3895              $C$DW$337       .dwtag  DW_TAG_member
    3896                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$21)
    3897                      .dwattr $C$DW$337, DW_AT_name("I2CFFRX")
    3898                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_I2CFFRX")
    3899                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3900                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3901                      .dwendtag $C$DW$T$24
    3902              
TMS320C2000 Assembler PC v6.4.9 Wed Jan 20 10:55:47 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\0082010                         PAGE   73

    3903              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Obj")
    3904                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$24)
    3905                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3906              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3907                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3908              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3909                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3910                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3911              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3912                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3913                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3914                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3915              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3916                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3917                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3918                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3919              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3920                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3921                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3922                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3923              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3924                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3925                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3926                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3927              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3928                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3929                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3930                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3931              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3932                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3933                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3934                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3935              $C$DW$T$10      .dwtag  DW_TAG_base_type
    3936                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3937                      .dwattr $C$DW$T$10, DW_AT_name("int")
    3938                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    3939              $C$DW$338       .dwtag  DW_TAG_TI_far_type
    3940                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$10)
    3941              $C$DW$T$65      .dwtag  DW_TAG_const_type
    3942                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$338)
    3943              $C$DW$T$11      .dwtag  DW_TAG_base_type
    3944                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3945                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3946                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    3947              $C$DW$339       .dwtag  DW_TAG_TI_far_type
    3948                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$11)
    3949              $C$DW$T$67      .dwtag  DW_TAG_const_type
    3950                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$339)
    3951              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
