TMS320C2000 Assembler PC v6.4.2 Tue Dec 29 09:06:47 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1912410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Tue Dec 29 09:06:47 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../I2C_Gordon.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\BenBracy\Documents\TI FOC\proj_lab09\Flash")
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.2\bin\opt2000.exe C:\\Users\\BenBracy\\AppData\\Local\\Te
      14              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.2\bin\ac2000.exe -@C:\\Users\\BenBracy\\AppData\\Local\\T

    2997              $C$DW$T$36      .dwtag  DW_TAG_enumeration_type
    2998                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2999              $C$DW$275       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoStatus_Empty"), DW_AT_const_value(0x00)
    3000              $C$DW$276       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoStatus_1_Word"), DW_AT_const_value(0x100)
    3001              $C$DW$277       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoStatus_2_Words"), DW_AT_const_value(0x200)
    3002              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoStatus_3_Words"), DW_AT_const_value(0x300)
    3003              $C$DW$279       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoStatus_4_Words"), DW_AT_const_value(0x400)
    3004                      .dwendtag $C$DW$T$36
    3005              
    3006              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_FifoStatus_e")
    3007                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    3008                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    3009              
    3010              $C$DW$T$40      .dwtag  DW_TAG_enumeration_type
    3011                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    3012              $C$DW$280       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoLevel_Empty"), DW_AT_const_value(0x00)
    3013              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoLevel_1_Word"), DW_AT_const_value(0x01)
    3014              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoLevel_2_Words"), DW_AT_const_value(0x02)
    3015              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoLevel_3_Words"), DW_AT_const_value(0x03)
    3016              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_FifoLevel_4_Words"), DW_AT_const_value(0x04)
    3017                      .dwendtag $C$DW$T$40
    3018              
    3019              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_FifoLevel_e")
    3020                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3021                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3022              $C$DW$285       .dwtag  DW_TAG_TI_far_type
    3023                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$41)
    3024              $C$DW$T$42      .dwtag  DW_TAG_const_type
    3025                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$285)
    3026              
    3027              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    3028                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    3029              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_1_Bit"), DW_AT_const_value(0x01)
    3030              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_2_Bits"), DW_AT_const_value(0x02)
    3031              $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_3_Bits"), DW_AT_const_value(0x03)
    3032              $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_4_Bits"), DW_AT_const_value(0x04)
    3033              $C$DW$290       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_5_Bits"), DW_AT_const_value(0x05)
    3034              $C$DW$291       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_6_Bits"), DW_AT_const_value(0x06)
    3035              $C$DW$292       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_7_Bits"), DW_AT_const_value(0x07)
    3036              $C$DW$293       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_8_Bits"), DW_AT_const_value(0x00)
    3037                      .dwendtag $C$DW$T$43
    3038              
    3039              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_BitCount_e")
TMS320C2000 Assembler PC v6.4.2 Tue Dec 29 09:06:47 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1912410                         PAGE   57

    3040                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3041                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3042              $C$DW$294       .dwtag  DW_TAG_TI_far_type
    3043                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$44)
    3044              $C$DW$T$45      .dwtag  DW_TAG_const_type
    3045                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$294)
    3046              
    3047              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3048                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3049                      .dwattr $C$DW$T$19, DW_AT_declaration
    3050                      .dwendtag $C$DW$T$19
    3051              
    3052              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    3053                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$19)
    3054                      .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    3055              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    3056                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3057                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    3058              $C$DW$295       .dwtag  DW_TAG_TI_far_type
    3059                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$29)
    3060              $C$DW$T$46      .dwtag  DW_TAG_const_type
    3061                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$295)
    3062              
    3063              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3064                      .dwattr $C$DW$T$22, DW_AT_name("_I2C_Obj_")
    3065                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0f)
    3066              $C$DW$296       .dwtag  DW_TAG_member
    3067                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$21)
    3068                      .dwattr $C$DW$296, DW_AT_name("I2COAR")
    3069                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_I2COAR")
    3070                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3071                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3072              $C$DW$297       .dwtag  DW_TAG_member
    3073                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$21)
    3074                      .dwattr $C$DW$297, DW_AT_name("I2CIER")
    3075                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_I2CIER")
    3076                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3077                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3078              $C$DW$298       .dwtag  DW_TAG_member
    3079                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$21)
    3080                      .dwattr $C$DW$298, DW_AT_name("I2CSTR")
    3081                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_I2CSTR")
    3082                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3083                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3084              $C$DW$299       .dwtag  DW_TAG_member
    3085                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$21)
    3086                      .dwattr $C$DW$299, DW_AT_name("I2CCLKL")
    3087                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_I2CCLKL")
    3088                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3089                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3090              $C$DW$300       .dwtag  DW_TAG_member
    3091                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$21)
    3092                      .dwattr $C$DW$300, DW_AT_name("I2CCLKH")
    3093                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_I2CCLKH")
    3094                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.4.2 Tue Dec 29 09:06:47 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1912410                         PAGE   58

    3095                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3096              $C$DW$301       .dwtag  DW_TAG_member
    3097                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$21)
    3098                      .dwattr $C$DW$301, DW_AT_name("I2CCNT")
    3099                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_I2CCNT")
    3100                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3101                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3102              $C$DW$302       .dwtag  DW_TAG_member
    3103                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$21)
    3104                      .dwattr $C$DW$302, DW_AT_name("I2CDRR")
    3105                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_I2CDRR")
    3106                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3107                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3108              $C$DW$303       .dwtag  DW_TAG_member
    3109                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$21)
    3110                      .dwattr $C$DW$303, DW_AT_name("I2CSAR")
    3111                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_I2CSAR")
    3112                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3113                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3114              $C$DW$304       .dwtag  DW_TAG_member
    3115                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$21)
    3116                      .dwattr $C$DW$304, DW_AT_name("I2CDXR")
    3117                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_I2CDXR")
    3118                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3119                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3120              $C$DW$305       .dwtag  DW_TAG_member
    3121                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$21)
    3122                      .dwattr $C$DW$305, DW_AT_name("I2CMDR")
    3123                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_I2CMDR")
    3124                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3125                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3126              $C$DW$306       .dwtag  DW_TAG_member
    3127                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$21)
    3128                      .dwattr $C$DW$306, DW_AT_name("I2CISRC")
    3129                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_I2CISRC")
    3130                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3131                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3132              $C$DW$307       .dwtag  DW_TAG_member
    3133                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$21)
    3134                      .dwattr $C$DW$307, DW_AT_name("I2CEMDR")
    3135                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_I2CEMDR")
    3136                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3137                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3138              $C$DW$308       .dwtag  DW_TAG_member
    3139                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
    3140                      .dwattr $C$DW$308, DW_AT_name("I2CPSC")
    3141                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_I2CPSC")
    3142                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3143                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3144              $C$DW$309       .dwtag  DW_TAG_member
    3145                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$21)
    3146                      .dwattr $C$DW$309, DW_AT_name("I2CFFTX")
    3147                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_I2CFFTX")
    3148                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3149                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Tue Dec 29 09:06:47 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1912410                         PAGE   59

    3150              $C$DW$310       .dwtag  DW_TAG_member
    3151                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$21)
    3152                      .dwattr $C$DW$310, DW_AT_name("I2CFFRX")
    3153                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_I2CFFRX")
    3154                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3155                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3156                      .dwendtag $C$DW$T$22
    3157              
    3158              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Obj")
    3159                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$22)
    3160                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3161              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3162                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3163              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3164                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3165                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3166              $C$DW$311       .dwtag  DW_TAG_TI_far_type
    3167                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$3)
    3168              $C$DW$T$54      .dwtag  DW_TAG_const_type
    3169                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$311)
    3170              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3171                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3172                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3173                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3174              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3175                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3176                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3177                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3178              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3179                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3180                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3181                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3182              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3183                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3184                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3185                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3186              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3187                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3188                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3189                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3190              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3191                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3192                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3193                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3194              $C$DW$T$10      .dwtag  DW_TAG_base_type
    3195                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3196                      .dwattr $C$DW$T$10, DW_AT_name("int")
    3197                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    3198              $C$DW$312       .dwtag  DW_TAG_TI_far_type
    3199                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$10)
    3200              $C$DW$T$66      .dwtag  DW_TAG_const_type
    3201                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$312)
    3202              $C$DW$T$11      .dwtag  DW_TAG_base_type
    3203                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3204                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
TMS320C2000 Assembler PC v6.4.2 Tue Dec 29 09:06:47 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\1912410                         PAGE   60

    3205                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    3206              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
