TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.9 *
       3              ;* Date/Time created: Mon Jan 25 16:25:07 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.9 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\BenBracy\Documents\TI FOC\proj_lab09\Flash")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    5427              $C$DW$754       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntEn_NACK"), DW_AT_const_value(0x02)
    5428              $C$DW$755       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntEn_Reg_Rdy"), DW_AT_const_value(0x04)
    5429              $C$DW$756       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntEn_Rx_Rdy"), DW_AT_const_value(0x08)
    5430              $C$DW$757       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntEn_Tx_Rdy"), DW_AT_const_value(0x10)
    5431              $C$DW$758       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntEn_Stop"), DW_AT_const_value(0x20)
    5432              $C$DW$759       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntEn_Slave_Addr"), DW_AT_const_value(0x40)
    5433                      .dwendtag $C$DW$T$246
    5434              
    5435              $C$DW$T$247     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_IntEnable_e")
    5436                      .dwattr $C$DW$T$247, DW_AT_type(*$C$DW$T$246)
    5437                      .dwattr $C$DW$T$247, DW_AT_language(DW_LANG_C)
    5438              $C$DW$760       .dwtag  DW_TAG_TI_far_type
    5439                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$247)
    5440              $C$DW$T$248     .dwtag  DW_TAG_const_type
    5441                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$760)
    5442              
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  109

    5443              $C$DW$T$249     .dwtag  DW_TAG_enumeration_type
    5444                      .dwattr $C$DW$T$249, DW_AT_byte_size(0x01)
    5445              $C$DW$761       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntSrc_None"), DW_AT_const_value(0x00)
    5446              $C$DW$762       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntSrc_Arb_Lost"), DW_AT_const_value(0x01)
    5447              $C$DW$763       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntSrc_NACK"), DW_AT_const_value(0x02)
    5448              $C$DW$764       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntSrc_Reg_Rdy"), DW_AT_const_value(0x03)
    5449              $C$DW$765       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntSrc_Rx_Rdy"), DW_AT_const_value(0x04)
    5450              $C$DW$766       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntSrc_Tx_Rdy"), DW_AT_const_value(0x05)
    5451              $C$DW$767       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntSrc_Stop"), DW_AT_const_value(0x06)
    5452              $C$DW$768       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntSrc_Slave_Addr"), DW_AT_const_value(0x07)
    5453                      .dwendtag $C$DW$T$249
    5454              
    5455              $C$DW$T$250     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_IntSource_e")
    5456                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$T$249)
    5457                      .dwattr $C$DW$T$250, DW_AT_language(DW_LANG_C)
    5458              
    5459              $C$DW$T$254     .dwtag  DW_TAG_enumeration_type
    5460                      .dwattr $C$DW$T$254, DW_AT_byte_size(0x01)
    5461              $C$DW$769       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    5462              $C$DW$770       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    5463              $C$DW$771       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    5464                      .dwendtag $C$DW$T$254
    5465              
    5466              $C$DW$T$255     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    5467                      .dwattr $C$DW$T$255, DW_AT_type(*$C$DW$T$254)
    5468                      .dwattr $C$DW$T$255, DW_AT_language(DW_LANG_C)
    5469              
    5470              $C$DW$T$257     .dwtag  DW_TAG_enumeration_type
    5471                      .dwattr $C$DW$T$257, DW_AT_byte_size(0x01)
    5472              $C$DW$772       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    5473              $C$DW$773       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    5474                      .dwendtag $C$DW$T$257
    5475              
    5476              $C$DW$T$258     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    5477                      .dwattr $C$DW$T$258, DW_AT_type(*$C$DW$T$257)
    5478                      .dwattr $C$DW$T$258, DW_AT_language(DW_LANG_C)
    5479              
    5480              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    5481                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    5482                      .dwattr $C$DW$T$19, DW_AT_declaration
    5483                      .dwendtag $C$DW$T$19
    5484              
    5485              $C$DW$T$142     .dwtag  DW_TAG_pointer_type
    5486                      .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$19)
    5487                      .dwattr $C$DW$T$142, DW_AT_address_class(0x20)
    5488              $C$DW$T$143     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    5489                      .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$142)
    5490                      .dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
    5491              
    5492              $C$DW$T$26      .dwtag  DW_TAG_union_type
    5493                      .dwattr $C$DW$T$26, DW_AT_name("ReceiverData_U")
    5494                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    5495              $C$DW$774       .dwtag  DW_TAG_member
    5496                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$25)
    5497                      .dwattr $C$DW$774, DW_AT_name("RxData")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  110

    5498                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_RxData")
    5499                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5500                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    5501                      .dwendtag $C$DW$T$26
    5502              
    5503              
    5504              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5505                      .dwattr $C$DW$T$35, DW_AT_name("_ADC_Obj_")
    5506                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x6650)
    5507              $C$DW$775       .dwtag  DW_TAG_member
    5508                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$29)
    5509                      .dwattr $C$DW$775, DW_AT_name("ADCRESULT")
    5510                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_ADCRESULT")
    5511                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5512                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    5513              $C$DW$776       .dwtag  DW_TAG_member
    5514                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$30)
    5515                      .dwattr $C$DW$776, DW_AT_name("resvd_1")
    5516                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_resvd_1")
    5517                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5518                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    5519              $C$DW$777       .dwtag  DW_TAG_member
    5520                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$28)
    5521                      .dwattr $C$DW$777, DW_AT_name("ADCCTL1")
    5522                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_ADCCTL1")
    5523                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    5524                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    5525              $C$DW$778       .dwtag  DW_TAG_member
    5526                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$28)
    5527                      .dwattr $C$DW$778, DW_AT_name("ADCCTL2")
    5528                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_ADCCTL2")
    5529                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    5530                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    5531              $C$DW$779       .dwtag  DW_TAG_member
    5532                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$31)
    5533                      .dwattr $C$DW$779, DW_AT_name("rsvd_2")
    5534                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_rsvd_2")
    5535                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    5536                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    5537              $C$DW$780       .dwtag  DW_TAG_member
    5538                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$28)
    5539                      .dwattr $C$DW$780, DW_AT_name("ADCINTFLG")
    5540                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_ADCINTFLG")
    5541                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    5542                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    5543              $C$DW$781       .dwtag  DW_TAG_member
    5544                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$28)
    5545                      .dwattr $C$DW$781, DW_AT_name("ADCINTFLGCLR")
    5546                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    5547                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    5548                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    5549              $C$DW$782       .dwtag  DW_TAG_member
    5550                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$28)
    5551                      .dwattr $C$DW$782, DW_AT_name("ADCINTOVF")
    5552                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_ADCINTOVF")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  111

    5553                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    5554                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    5555              $C$DW$783       .dwtag  DW_TAG_member
    5556                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$28)
    5557                      .dwattr $C$DW$783, DW_AT_name("ADCINTOVFCLR")
    5558                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    5559                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    5560                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    5561              $C$DW$784       .dwtag  DW_TAG_member
    5562                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$32)
    5563                      .dwattr $C$DW$784, DW_AT_name("INTSELxNy")
    5564                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_INTSELxNy")
    5565                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    5566                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    5567              $C$DW$785       .dwtag  DW_TAG_member
    5568                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$33)
    5569                      .dwattr $C$DW$785, DW_AT_name("rsvd_3")
    5570                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_rsvd_3")
    5571                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    5572                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    5573              $C$DW$786       .dwtag  DW_TAG_member
    5574                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$28)
    5575                      .dwattr $C$DW$786, DW_AT_name("SOCPRICTRL")
    5576                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_SOCPRICTRL")
    5577                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    5578                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    5579              $C$DW$787       .dwtag  DW_TAG_member
    5580                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$28)
    5581                      .dwattr $C$DW$787, DW_AT_name("rsvd_4")
    5582                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_rsvd_4")
    5583                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    5584                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    5585              $C$DW$788       .dwtag  DW_TAG_member
    5586                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$28)
    5587                      .dwattr $C$DW$788, DW_AT_name("ADCSAMPLEMODE")
    5588                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    5589                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    5590                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    5591              $C$DW$789       .dwtag  DW_TAG_member
    5592                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$28)
    5593                      .dwattr $C$DW$789, DW_AT_name("rsvd_5")
    5594                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_rsvd_5")
    5595                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    5596                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    5597              $C$DW$790       .dwtag  DW_TAG_member
    5598                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$28)
    5599                      .dwattr $C$DW$790, DW_AT_name("ADCINTSOCSEL1")
    5600                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    5601                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    5602                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    5603              $C$DW$791       .dwtag  DW_TAG_member
    5604                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$28)
    5605                      .dwattr $C$DW$791, DW_AT_name("ADCINTSOCSEL2")
    5606                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    5607                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  112

    5608                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    5609              $C$DW$792       .dwtag  DW_TAG_member
    5610                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$31)
    5611                      .dwattr $C$DW$792, DW_AT_name("rsvd_6")
    5612                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_rsvd_6")
    5613                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    5614                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    5615              $C$DW$793       .dwtag  DW_TAG_member
    5616                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$28)
    5617                      .dwattr $C$DW$793, DW_AT_name("ADCSOCFLG1")
    5618                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    5619                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    5620                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    5621              $C$DW$794       .dwtag  DW_TAG_member
    5622                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$28)
    5623                      .dwattr $C$DW$794, DW_AT_name("rsvd_7")
    5624                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_rsvd_7")
    5625                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    5626                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    5627              $C$DW$795       .dwtag  DW_TAG_member
    5628                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$28)
    5629                      .dwattr $C$DW$795, DW_AT_name("ADCSOCFRC1")
    5630                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    5631                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    5632                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    5633              $C$DW$796       .dwtag  DW_TAG_member
    5634                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$28)
    5635                      .dwattr $C$DW$796, DW_AT_name("rsvd_8")
    5636                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_rsvd_8")
    5637                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    5638                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    5639              $C$DW$797       .dwtag  DW_TAG_member
    5640                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$28)
    5641                      .dwattr $C$DW$797, DW_AT_name("ADCSOCOVF1")
    5642                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    5643                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    5644                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    5645              $C$DW$798       .dwtag  DW_TAG_member
    5646                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$28)
    5647                      .dwattr $C$DW$798, DW_AT_name("rsvd_9")
    5648                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_rsvd_9")
    5649                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    5650                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    5651              $C$DW$799       .dwtag  DW_TAG_member
    5652                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$28)
    5653                      .dwattr $C$DW$799, DW_AT_name("ADCSOCOVFCLR1")
    5654                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    5655                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    5656                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    5657              $C$DW$800       .dwtag  DW_TAG_member
    5658                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$28)
    5659                      .dwattr $C$DW$800, DW_AT_name("rsvd_10")
    5660                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_rsvd_10")
    5661                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    5662                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  113

    5663              $C$DW$801       .dwtag  DW_TAG_member
    5664                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$29)
    5665                      .dwattr $C$DW$801, DW_AT_name("ADCSOCxCTL")
    5666                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    5667                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    5668                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    5669              $C$DW$802       .dwtag  DW_TAG_member
    5670                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$29)
    5671                      .dwattr $C$DW$802, DW_AT_name("rsvd_11")
    5672                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_rsvd_11")
    5673                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    5674                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    5675              $C$DW$803       .dwtag  DW_TAG_member
    5676                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$28)
    5677                      .dwattr $C$DW$803, DW_AT_name("ADCREFTRIM")
    5678                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_ADCREFTRIM")
    5679                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    5680                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    5681              $C$DW$804       .dwtag  DW_TAG_member
    5682                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$28)
    5683                      .dwattr $C$DW$804, DW_AT_name("ADCOFFTRIM")
    5684                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    5685                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    5686                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    5687              $C$DW$805       .dwtag  DW_TAG_member
    5688                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$34)
    5689                      .dwattr $C$DW$805, DW_AT_name("resvd_12")
    5690                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_resvd_12")
    5691                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    5692                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    5693              $C$DW$806       .dwtag  DW_TAG_member
    5694                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$28)
    5695                      .dwattr $C$DW$806, DW_AT_name("ADCREV")
    5696                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_ADCREV")
    5697                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    5698                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    5699                      .dwendtag $C$DW$T$35
    5700              
    5701              $C$DW$T$261     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    5702                      .dwattr $C$DW$T$261, DW_AT_type(*$C$DW$T$35)
    5703                      .dwattr $C$DW$T$261, DW_AT_language(DW_LANG_C)
    5704              $C$DW$T$123     .dwtag  DW_TAG_pointer_type
    5705                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$35)
    5706                      .dwattr $C$DW$T$123, DW_AT_address_class(0x20)
    5707              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    5708                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    5709                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    5710              
    5711              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5712                      .dwattr $C$DW$T$39, DW_AT_name("_CAP_Obj_")
    5713                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x1a)
    5714              $C$DW$807       .dwtag  DW_TAG_member
    5715                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$37)
    5716                      .dwattr $C$DW$807, DW_AT_name("TSCTR")
    5717                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_TSCTR")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  114

    5718                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5719                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    5720              $C$DW$808       .dwtag  DW_TAG_member
    5721                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$37)
    5722                      .dwattr $C$DW$808, DW_AT_name("CTRPHS")
    5723                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_CTRPHS")
    5724                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5725                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    5726              $C$DW$809       .dwtag  DW_TAG_member
    5727                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$37)
    5728                      .dwattr $C$DW$809, DW_AT_name("CAP1")
    5729                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_CAP1")
    5730                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5731                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    5732              $C$DW$810       .dwtag  DW_TAG_member
    5733                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$37)
    5734                      .dwattr $C$DW$810, DW_AT_name("CAP2")
    5735                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_CAP2")
    5736                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5737                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    5738              $C$DW$811       .dwtag  DW_TAG_member
    5739                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$37)
    5740                      .dwattr $C$DW$811, DW_AT_name("CAP3")
    5741                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_CAP3")
    5742                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5743                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    5744              $C$DW$812       .dwtag  DW_TAG_member
    5745                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$37)
    5746                      .dwattr $C$DW$812, DW_AT_name("CAP4")
    5747                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_CAP4")
    5748                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5749                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    5750              $C$DW$813       .dwtag  DW_TAG_member
    5751                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$38)
    5752                      .dwattr $C$DW$813, DW_AT_name("Rsvd_1")
    5753                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_Rsvd_1")
    5754                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5755                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    5756              $C$DW$814       .dwtag  DW_TAG_member
    5757                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$28)
    5758                      .dwattr $C$DW$814, DW_AT_name("ECCTL1")
    5759                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_ECCTL1")
    5760                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5761                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    5762              $C$DW$815       .dwtag  DW_TAG_member
    5763                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$28)
    5764                      .dwattr $C$DW$815, DW_AT_name("ECCTL2")
    5765                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_ECCTL2")
    5766                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5767                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    5768              $C$DW$816       .dwtag  DW_TAG_member
    5769                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$28)
    5770                      .dwattr $C$DW$816, DW_AT_name("ECEINT")
    5771                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_ECEINT")
    5772                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  115

    5773                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    5774              $C$DW$817       .dwtag  DW_TAG_member
    5775                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$28)
    5776                      .dwattr $C$DW$817, DW_AT_name("ECEFLG")
    5777                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_ECEFLG")
    5778                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    5779                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    5780              $C$DW$818       .dwtag  DW_TAG_member
    5781                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$28)
    5782                      .dwattr $C$DW$818, DW_AT_name("ECECLR")
    5783                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_ECECLR")
    5784                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5785                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    5786              $C$DW$819       .dwtag  DW_TAG_member
    5787                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$28)
    5788                      .dwattr $C$DW$819, DW_AT_name("ECEFRC")
    5789                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_ECEFRC")
    5790                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5791                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    5792                      .dwendtag $C$DW$T$39
    5793              
    5794              $C$DW$T$262     .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Obj")
    5795                      .dwattr $C$DW$T$262, DW_AT_type(*$C$DW$T$39)
    5796                      .dwattr $C$DW$T$262, DW_AT_language(DW_LANG_C)
    5797              $C$DW$T$140     .dwtag  DW_TAG_pointer_type
    5798                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$39)
    5799                      .dwattr $C$DW$T$140, DW_AT_address_class(0x20)
    5800              $C$DW$T$141     .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Handle")
    5801                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$140)
    5802                      .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    5803              
    5804              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    5805                      .dwattr $C$DW$T$42, DW_AT_name("_CLARKE_Obj_")
    5806                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x06)
    5807              $C$DW$820       .dwtag  DW_TAG_member
    5808                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$40)
    5809                      .dwattr $C$DW$820, DW_AT_name("alpha_sf")
    5810                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_alpha_sf")
    5811                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5812                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    5813              $C$DW$821       .dwtag  DW_TAG_member
    5814                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$40)
    5815                      .dwattr $C$DW$821, DW_AT_name("beta_sf")
    5816                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_beta_sf")
    5817                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5818                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    5819              $C$DW$822       .dwtag  DW_TAG_member
    5820                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$41)
    5821                      .dwattr $C$DW$822, DW_AT_name("numSensors")
    5822                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_numSensors")
    5823                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5824                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    5825                      .dwendtag $C$DW$T$42
    5826              
    5827              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  116

    5828                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$42)
    5829                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    5830              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    5831                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$42)
    5832                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    5833              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    5834                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    5835                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    5836              
    5837              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    5838                      .dwattr $C$DW$T$43, DW_AT_name("_CLK_Obj_")
    5839                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x11)
    5840              $C$DW$823       .dwtag  DW_TAG_member
    5841                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$28)
    5842                      .dwattr $C$DW$823, DW_AT_name("XCLK")
    5843                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_XCLK")
    5844                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5845                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    5846              $C$DW$824       .dwtag  DW_TAG_member
    5847                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$28)
    5848                      .dwattr $C$DW$824, DW_AT_name("rsvd_1")
    5849                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_rsvd_1")
    5850                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5851                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    5852              $C$DW$825       .dwtag  DW_TAG_member
    5853                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$28)
    5854                      .dwattr $C$DW$825, DW_AT_name("CLKCTL")
    5855                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_CLKCTL")
    5856                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5857                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    5858              $C$DW$826       .dwtag  DW_TAG_member
    5859                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$38)
    5860                      .dwattr $C$DW$826, DW_AT_name("rsvd_2")
    5861                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_rsvd_2")
    5862                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5863                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    5864              $C$DW$827       .dwtag  DW_TAG_member
    5865                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$28)
    5866                      .dwattr $C$DW$827, DW_AT_name("LOSPCP")
    5867                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_LOSPCP")
    5868                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5869                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    5870              $C$DW$828       .dwtag  DW_TAG_member
    5871                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$28)
    5872                      .dwattr $C$DW$828, DW_AT_name("PCLKCR0")
    5873                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_PCLKCR0")
    5874                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5875                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    5876              $C$DW$829       .dwtag  DW_TAG_member
    5877                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$28)
    5878                      .dwattr $C$DW$829, DW_AT_name("PCLKCR1")
    5879                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_PCLKCR1")
    5880                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5881                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    5882              $C$DW$830       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  117

    5883                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$31)
    5884                      .dwattr $C$DW$830, DW_AT_name("rsvd_3")
    5885                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_rsvd_3")
    5886                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5887                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    5888              $C$DW$831       .dwtag  DW_TAG_member
    5889                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$28)
    5890                      .dwattr $C$DW$831, DW_AT_name("PCLKCR3")
    5891                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_PCLKCR3")
    5892                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5893                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    5894                      .dwendtag $C$DW$T$43
    5895              
    5896              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
    5897                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$43)
    5898                      .dwattr $C$DW$T$125, DW_AT_address_class(0x20)
    5899              $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    5900                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
    5901                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    5902              
    5903              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    5904                      .dwattr $C$DW$T$44, DW_AT_name("_CPU_Obj_")
    5905                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    5906              $C$DW$832       .dwtag  DW_TAG_member
    5907                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$41)
    5908                      .dwattr $C$DW$832, DW_AT_name("tmp")
    5909                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_tmp")
    5910                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5911                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    5912                      .dwendtag $C$DW$T$44
    5913              
    5914              $C$DW$T$127     .dwtag  DW_TAG_pointer_type
    5915                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$44)
    5916                      .dwattr $C$DW$T$127, DW_AT_address_class(0x20)
    5917              $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    5918                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    5919                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    5920              
    5921              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    5922                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    5923                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x108)
    5924              $C$DW$833       .dwtag  DW_TAG_member
    5925                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$45)
    5926                      .dwattr $C$DW$833, DW_AT_name("version")
    5927                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_version")
    5928                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5929                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    5930              $C$DW$834       .dwtag  DW_TAG_member
    5931                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$47)
    5932                      .dwattr $C$DW$834, DW_AT_name("state")
    5933                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_state")
    5934                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5935                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    5936              $C$DW$835       .dwtag  DW_TAG_member
    5937                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$47)
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  118

    5938                      .dwattr $C$DW$835, DW_AT_name("prevState")
    5939                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_prevState")
    5940                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5941                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    5942              $C$DW$836       .dwtag  DW_TAG_member
    5943                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$49)
    5944                      .dwattr $C$DW$836, DW_AT_name("errorCode")
    5945                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_errorCode")
    5946                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5947                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    5948              $C$DW$837       .dwtag  DW_TAG_member
    5949                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$51)
    5950                      .dwattr $C$DW$837, DW_AT_name("clarkeHandle_I")
    5951                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_clarkeHandle_I")
    5952                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5953                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    5954              $C$DW$838       .dwtag  DW_TAG_member
    5955                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$52)
    5956                      .dwattr $C$DW$838, DW_AT_name("clarke_I")
    5957                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_clarke_I")
    5958                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5959                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    5960              $C$DW$839       .dwtag  DW_TAG_member
    5961                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$51)
    5962                      .dwattr $C$DW$839, DW_AT_name("clarkeHandle_V")
    5963                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_clarkeHandle_V")
    5964                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5965                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    5966              $C$DW$840       .dwtag  DW_TAG_member
    5967                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$52)
    5968                      .dwattr $C$DW$840, DW_AT_name("clarke_V")
    5969                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_clarke_V")
    5970                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5971                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    5972              $C$DW$841       .dwtag  DW_TAG_member
    5973                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$54)
    5974                      .dwattr $C$DW$841, DW_AT_name("estHandle")
    5975                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_estHandle")
    5976                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5977                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    5978              $C$DW$842       .dwtag  DW_TAG_member
    5979                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$56)
    5980                      .dwattr $C$DW$842, DW_AT_name("parkHandle")
    5981                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_parkHandle")
    5982                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5983                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    5984              $C$DW$843       .dwtag  DW_TAG_member
    5985                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$57)
    5986                      .dwattr $C$DW$843, DW_AT_name("park")
    5987                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_park")
    5988                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5989                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    5990              $C$DW$844       .dwtag  DW_TAG_member
    5991                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$59)
    5992                      .dwattr $C$DW$844, DW_AT_name("pidHandle_Id")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  119

    5993                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_pidHandle_Id")
    5994                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5995                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    5996              $C$DW$845       .dwtag  DW_TAG_member
    5997                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$60)
    5998                      .dwattr $C$DW$845, DW_AT_name("pid_Id")
    5999                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_pid_Id")
    6000                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6001                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    6002              $C$DW$846       .dwtag  DW_TAG_member
    6003                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$59)
    6004                      .dwattr $C$DW$846, DW_AT_name("pidHandle_Iq")
    6005                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6006                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6007                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
    6008              $C$DW$847       .dwtag  DW_TAG_member
    6009                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$60)
    6010                      .dwattr $C$DW$847, DW_AT_name("pid_Iq")
    6011                      .dwattr $C$DW$847, DW_AT_TI_symbol_name("_pid_Iq")
    6012                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6013                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
    6014              $C$DW$848       .dwtag  DW_TAG_member
    6015                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$59)
    6016                      .dwattr $C$DW$848, DW_AT_name("pidHandle_spd")
    6017                      .dwattr $C$DW$848, DW_AT_TI_symbol_name("_pidHandle_spd")
    6018                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6019                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
    6020              $C$DW$849       .dwtag  DW_TAG_member
    6021                      .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$60)
    6022                      .dwattr $C$DW$849, DW_AT_name("pid_spd")
    6023                      .dwattr $C$DW$849, DW_AT_TI_symbol_name("_pid_spd")
    6024                      .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6025                      .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
    6026              $C$DW$850       .dwtag  DW_TAG_member
    6027                      .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$62)
    6028                      .dwattr $C$DW$850, DW_AT_name("iparkHandle")
    6029                      .dwattr $C$DW$850, DW_AT_TI_symbol_name("_iparkHandle")
    6030                      .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6031                      .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
    6032              $C$DW$851       .dwtag  DW_TAG_member
    6033                      .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$63)
    6034                      .dwattr $C$DW$851, DW_AT_name("ipark")
    6035                      .dwattr $C$DW$851, DW_AT_TI_symbol_name("_ipark")
    6036                      .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6037                      .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
    6038              $C$DW$852       .dwtag  DW_TAG_member
    6039                      .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$65)
    6040                      .dwattr $C$DW$852, DW_AT_name("svgenHandle")
    6041                      .dwattr $C$DW$852, DW_AT_TI_symbol_name("_svgenHandle")
    6042                      .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6043                      .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
    6044              $C$DW$853       .dwtag  DW_TAG_member
    6045                      .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$66)
    6046                      .dwattr $C$DW$853, DW_AT_name("svgen")
    6047                      .dwattr $C$DW$853, DW_AT_TI_symbol_name("_svgen")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  120

    6048                      .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6049                      .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
    6050              $C$DW$854       .dwtag  DW_TAG_member
    6051                      .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$68)
    6052                      .dwattr $C$DW$854, DW_AT_name("trajHandle_Id")
    6053                      .dwattr $C$DW$854, DW_AT_TI_symbol_name("_trajHandle_Id")
    6054                      .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6055                      .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
    6056              $C$DW$855       .dwtag  DW_TAG_member
    6057                      .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$69)
    6058                      .dwattr $C$DW$855, DW_AT_name("traj_Id")
    6059                      .dwattr $C$DW$855, DW_AT_TI_symbol_name("_traj_Id")
    6060                      .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6061                      .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
    6062              $C$DW$856       .dwtag  DW_TAG_member
    6063                      .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$68)
    6064                      .dwattr $C$DW$856, DW_AT_name("trajHandle_spd")
    6065                      .dwattr $C$DW$856, DW_AT_TI_symbol_name("_trajHandle_spd")
    6066                      .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6067                      .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
    6068              $C$DW$857       .dwtag  DW_TAG_member
    6069                      .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$69)
    6070                      .dwattr $C$DW$857, DW_AT_name("traj_spd")
    6071                      .dwattr $C$DW$857, DW_AT_TI_symbol_name("_traj_spd")
    6072                      .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6073                      .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
    6074              $C$DW$858       .dwtag  DW_TAG_member
    6075                      .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$68)
    6076                      .dwattr $C$DW$858, DW_AT_name("trajHandle_spdMax")
    6077                      .dwattr $C$DW$858, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6078                      .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6079                      .dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
    6080              $C$DW$859       .dwtag  DW_TAG_member
    6081                      .dwattr $C$DW$859, DW_AT_type(*$C$DW$T$69)
    6082                      .dwattr $C$DW$859, DW_AT_name("traj_spdMax")
    6083                      .dwattr $C$DW$859, DW_AT_TI_symbol_name("_traj_spdMax")
    6084                      .dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6085                      .dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
    6086              $C$DW$860       .dwtag  DW_TAG_member
    6087                      .dwattr $C$DW$860, DW_AT_type(*$C$DW$T$70)
    6088                      .dwattr $C$DW$860, DW_AT_name("motorParams")
    6089                      .dwattr $C$DW$860, DW_AT_TI_symbol_name("_motorParams")
    6090                      .dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6091                      .dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
    6092              $C$DW$861       .dwtag  DW_TAG_member
    6093                      .dwattr $C$DW$861, DW_AT_type(*$C$DW$T$72)
    6094                      .dwattr $C$DW$861, DW_AT_name("waitTimes")
    6095                      .dwattr $C$DW$861, DW_AT_TI_symbol_name("_waitTimes")
    6096                      .dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6097                      .dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
    6098              $C$DW$862       .dwtag  DW_TAG_member
    6099                      .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$71)
    6100                      .dwattr $C$DW$862, DW_AT_name("counter_state")
    6101                      .dwattr $C$DW$862, DW_AT_TI_symbol_name("_counter_state")
    6102                      .dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  121

    6103                      .dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
    6104              $C$DW$863       .dwtag  DW_TAG_member
    6105                      .dwattr $C$DW$863, DW_AT_type(*$C$DW$T$73)
    6106                      .dwattr $C$DW$863, DW_AT_name("numIsrTicksPerCtrlTick")
    6107                      .dwattr $C$DW$863, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6108                      .dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6109                      .dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
    6110              $C$DW$864       .dwtag  DW_TAG_member
    6111                      .dwattr $C$DW$864, DW_AT_type(*$C$DW$T$73)
    6112                      .dwattr $C$DW$864, DW_AT_name("numCtrlTicksPerCurrentTick")
    6113                      .dwattr $C$DW$864, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6114                      .dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6115                      .dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
    6116              $C$DW$865       .dwtag  DW_TAG_member
    6117                      .dwattr $C$DW$865, DW_AT_type(*$C$DW$T$73)
    6118                      .dwattr $C$DW$865, DW_AT_name("numCtrlTicksPerSpeedTick")
    6119                      .dwattr $C$DW$865, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6120                      .dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6121                      .dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
    6122              $C$DW$866       .dwtag  DW_TAG_member
    6123                      .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$73)
    6124                      .dwattr $C$DW$866, DW_AT_name("numCtrlTicksPerTrajTick")
    6125                      .dwattr $C$DW$866, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6126                      .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6127                      .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
    6128              $C$DW$867       .dwtag  DW_TAG_member
    6129                      .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$71)
    6130                      .dwattr $C$DW$867, DW_AT_name("ctrlFreq_Hz")
    6131                      .dwattr $C$DW$867, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6132                      .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6133                      .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
    6134              $C$DW$868       .dwtag  DW_TAG_member
    6135                      .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$71)
    6136                      .dwattr $C$DW$868, DW_AT_name("trajFreq_Hz")
    6137                      .dwattr $C$DW$868, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6138                      .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6139                      .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
    6140              $C$DW$869       .dwtag  DW_TAG_member
    6141                      .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$40)
    6142                      .dwattr $C$DW$869, DW_AT_name("trajPeriod_sec")
    6143                      .dwattr $C$DW$869, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6144                      .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6145                      .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
    6146              $C$DW$870       .dwtag  DW_TAG_member
    6147                      .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$74)
    6148                      .dwattr $C$DW$870, DW_AT_name("ctrlPeriod_sec")
    6149                      .dwattr $C$DW$870, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    6150                      .dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6151                      .dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
    6152              $C$DW$871       .dwtag  DW_TAG_member
    6153                      .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$40)
    6154                      .dwattr $C$DW$871, DW_AT_name("maxVsMag_pu")
    6155                      .dwattr $C$DW$871, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6156                      .dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6157                      .dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  122

    6158              $C$DW$872       .dwtag  DW_TAG_member
    6159                      .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$75)
    6160                      .dwattr $C$DW$872, DW_AT_name("Iab_in")
    6161                      .dwattr $C$DW$872, DW_AT_TI_symbol_name("_Iab_in")
    6162                      .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    6163                      .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
    6164              $C$DW$873       .dwtag  DW_TAG_member
    6165                      .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$75)
    6166                      .dwattr $C$DW$873, DW_AT_name("Iab_filt")
    6167                      .dwattr $C$DW$873, DW_AT_TI_symbol_name("_Iab_filt")
    6168                      .dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6169                      .dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
    6170              $C$DW$874       .dwtag  DW_TAG_member
    6171                      .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$75)
    6172                      .dwattr $C$DW$874, DW_AT_name("Idq_in")
    6173                      .dwattr $C$DW$874, DW_AT_TI_symbol_name("_Idq_in")
    6174                      .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6175                      .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
    6176              $C$DW$875       .dwtag  DW_TAG_member
    6177                      .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$75)
    6178                      .dwattr $C$DW$875, DW_AT_name("Vab_in")
    6179                      .dwattr $C$DW$875, DW_AT_TI_symbol_name("_Vab_in")
    6180                      .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6181                      .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
    6182              $C$DW$876       .dwtag  DW_TAG_member
    6183                      .dwattr $C$DW$876, DW_AT_type(*$C$DW$T$40)
    6184                      .dwattr $C$DW$876, DW_AT_name("spd_out")
    6185                      .dwattr $C$DW$876, DW_AT_TI_symbol_name("_spd_out")
    6186                      .dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6187                      .dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
    6188              $C$DW$877       .dwtag  DW_TAG_member
    6189                      .dwattr $C$DW$877, DW_AT_type(*$C$DW$T$75)
    6190                      .dwattr $C$DW$877, DW_AT_name("Vab_out")
    6191                      .dwattr $C$DW$877, DW_AT_TI_symbol_name("_Vab_out")
    6192                      .dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6193                      .dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
    6194              $C$DW$878       .dwtag  DW_TAG_member
    6195                      .dwattr $C$DW$878, DW_AT_type(*$C$DW$T$75)
    6196                      .dwattr $C$DW$878, DW_AT_name("Vdq_out")
    6197                      .dwattr $C$DW$878, DW_AT_TI_symbol_name("_Vdq_out")
    6198                      .dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6199                      .dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
    6200              $C$DW$879       .dwtag  DW_TAG_member
    6201                      .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$74)
    6202                      .dwattr $C$DW$879, DW_AT_name("Rhf")
    6203                      .dwattr $C$DW$879, DW_AT_TI_symbol_name("_Rhf")
    6204                      .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6205                      .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
    6206              $C$DW$880       .dwtag  DW_TAG_member
    6207                      .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$74)
    6208                      .dwattr $C$DW$880, DW_AT_name("Lhf")
    6209                      .dwattr $C$DW$880, DW_AT_TI_symbol_name("_Lhf")
    6210                      .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6211                      .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
    6212              $C$DW$881       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  123

    6213                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$74)
    6214                      .dwattr $C$DW$881, DW_AT_name("RoverL")
    6215                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_RoverL")
    6216                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6217                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
    6218              $C$DW$882       .dwtag  DW_TAG_member
    6219                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$40)
    6220                      .dwattr $C$DW$882, DW_AT_name("Kp_Id")
    6221                      .dwattr $C$DW$882, DW_AT_TI_symbol_name("_Kp_Id")
    6222                      .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6223                      .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
    6224              $C$DW$883       .dwtag  DW_TAG_member
    6225                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$40)
    6226                      .dwattr $C$DW$883, DW_AT_name("Kp_Iq")
    6227                      .dwattr $C$DW$883, DW_AT_TI_symbol_name("_Kp_Iq")
    6228                      .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6229                      .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
    6230              $C$DW$884       .dwtag  DW_TAG_member
    6231                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$40)
    6232                      .dwattr $C$DW$884, DW_AT_name("Kp_spd")
    6233                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_Kp_spd")
    6234                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    6235                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
    6236              $C$DW$885       .dwtag  DW_TAG_member
    6237                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$40)
    6238                      .dwattr $C$DW$885, DW_AT_name("Ki_Id")
    6239                      .dwattr $C$DW$885, DW_AT_TI_symbol_name("_Ki_Id")
    6240                      .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6241                      .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
    6242              $C$DW$886       .dwtag  DW_TAG_member
    6243                      .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$40)
    6244                      .dwattr $C$DW$886, DW_AT_name("Ki_Iq")
    6245                      .dwattr $C$DW$886, DW_AT_TI_symbol_name("_Ki_Iq")
    6246                      .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6247                      .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
    6248              $C$DW$887       .dwtag  DW_TAG_member
    6249                      .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$40)
    6250                      .dwattr $C$DW$887, DW_AT_name("Ki_spd")
    6251                      .dwattr $C$DW$887, DW_AT_TI_symbol_name("_Ki_spd")
    6252                      .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6253                      .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
    6254              $C$DW$888       .dwtag  DW_TAG_member
    6255                      .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$40)
    6256                      .dwattr $C$DW$888, DW_AT_name("Kd_Id")
    6257                      .dwattr $C$DW$888, DW_AT_TI_symbol_name("_Kd_Id")
    6258                      .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6259                      .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
    6260              $C$DW$889       .dwtag  DW_TAG_member
    6261                      .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$40)
    6262                      .dwattr $C$DW$889, DW_AT_name("Kd_Iq")
    6263                      .dwattr $C$DW$889, DW_AT_TI_symbol_name("_Kd_Iq")
    6264                      .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6265                      .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
    6266              $C$DW$890       .dwtag  DW_TAG_member
    6267                      .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  124

    6268                      .dwattr $C$DW$890, DW_AT_name("Kd_spd")
    6269                      .dwattr $C$DW$890, DW_AT_TI_symbol_name("_Kd_spd")
    6270                      .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    6271                      .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
    6272              $C$DW$891       .dwtag  DW_TAG_member
    6273                      .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$40)
    6274                      .dwattr $C$DW$891, DW_AT_name("Ui_Id")
    6275                      .dwattr $C$DW$891, DW_AT_TI_symbol_name("_Ui_Id")
    6276                      .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6277                      .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
    6278              $C$DW$892       .dwtag  DW_TAG_member
    6279                      .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$40)
    6280                      .dwattr $C$DW$892, DW_AT_name("Ui_Iq")
    6281                      .dwattr $C$DW$892, DW_AT_TI_symbol_name("_Ui_Iq")
    6282                      .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6283                      .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
    6284              $C$DW$893       .dwtag  DW_TAG_member
    6285                      .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$40)
    6286                      .dwattr $C$DW$893, DW_AT_name("Ui_spd")
    6287                      .dwattr $C$DW$893, DW_AT_TI_symbol_name("_Ui_spd")
    6288                      .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6289                      .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
    6290              $C$DW$894       .dwtag  DW_TAG_member
    6291                      .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$75)
    6292                      .dwattr $C$DW$894, DW_AT_name("Idq_ref")
    6293                      .dwattr $C$DW$894, DW_AT_TI_symbol_name("_Idq_ref")
    6294                      .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6295                      .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
    6296              $C$DW$895       .dwtag  DW_TAG_member
    6297                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$40)
    6298                      .dwattr $C$DW$895, DW_AT_name("IdRated")
    6299                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_IdRated")
    6300                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    6301                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
    6302              $C$DW$896       .dwtag  DW_TAG_member
    6303                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$40)
    6304                      .dwattr $C$DW$896, DW_AT_name("spd_ref")
    6305                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_spd_ref")
    6306                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    6307                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    6308              $C$DW$897       .dwtag  DW_TAG_member
    6309                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$40)
    6310                      .dwattr $C$DW$897, DW_AT_name("spd_max")
    6311                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_spd_max")
    6312                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    6313                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
    6314              $C$DW$898       .dwtag  DW_TAG_member
    6315                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$73)
    6316                      .dwattr $C$DW$898, DW_AT_name("counter_current")
    6317                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_counter_current")
    6318                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    6319                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    6320              $C$DW$899       .dwtag  DW_TAG_member
    6321                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$73)
    6322                      .dwattr $C$DW$899, DW_AT_name("counter_isr")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  125

    6323                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_counter_isr")
    6324                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    6325                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
    6326              $C$DW$900       .dwtag  DW_TAG_member
    6327                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$73)
    6328                      .dwattr $C$DW$900, DW_AT_name("counter_speed")
    6329                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_counter_speed")
    6330                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    6331                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    6332              $C$DW$901       .dwtag  DW_TAG_member
    6333                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$73)
    6334                      .dwattr $C$DW$901, DW_AT_name("counter_traj")
    6335                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_counter_traj")
    6336                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    6337                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    6338              $C$DW$902       .dwtag  DW_TAG_member
    6339                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$76)
    6340                      .dwattr $C$DW$902, DW_AT_name("flag_enableCtrl")
    6341                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_flag_enableCtrl")
    6342                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    6343                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    6344              $C$DW$903       .dwtag  DW_TAG_member
    6345                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$76)
    6346                      .dwattr $C$DW$903, DW_AT_name("flag_enableDcBusComp")
    6347                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    6348                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    6349                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    6350              $C$DW$904       .dwtag  DW_TAG_member
    6351                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$76)
    6352                      .dwattr $C$DW$904, DW_AT_name("flag_enablePowerWarp")
    6353                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    6354                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    6355                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    6356              $C$DW$905       .dwtag  DW_TAG_member
    6357                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$76)
    6358                      .dwattr $C$DW$905, DW_AT_name("flag_enableOffset")
    6359                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_flag_enableOffset")
    6360                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    6361                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    6362              $C$DW$906       .dwtag  DW_TAG_member
    6363                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$76)
    6364                      .dwattr $C$DW$906, DW_AT_name("flag_enableSpeedCtrl")
    6365                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    6366                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    6367                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    6368              $C$DW$907       .dwtag  DW_TAG_member
    6369                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$76)
    6370                      .dwattr $C$DW$907, DW_AT_name("flag_enableUserMotorParams")
    6371                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    6372                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    6373                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    6374              $C$DW$908       .dwtag  DW_TAG_member
    6375                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$75)
    6376                      .dwattr $C$DW$908, DW_AT_name("Idq_offset_pu")
    6377                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_Idq_offset_pu")
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  126

    6378                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    6379                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    6380              $C$DW$909       .dwtag  DW_TAG_member
    6381                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$75)
    6382                      .dwattr $C$DW$909, DW_AT_name("Vdq_offset_pu")
    6383                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    6384                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    6385                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    6386              $C$DW$910       .dwtag  DW_TAG_member
    6387                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$40)
    6388                      .dwattr $C$DW$910, DW_AT_name("angle_pu")
    6389                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_angle_pu")
    6390                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    6391                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    6392              $C$DW$911       .dwtag  DW_TAG_member
    6393                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$40)
    6394                      .dwattr $C$DW$911, DW_AT_name("speed_ref_pu")
    6395                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_speed_ref_pu")
    6396                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    6397                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    6398              $C$DW$912       .dwtag  DW_TAG_member
    6399                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$40)
    6400                      .dwattr $C$DW$912, DW_AT_name("speed_fb_pu")
    6401                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_speed_fb_pu")
    6402                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    6403                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    6404              $C$DW$913       .dwtag  DW_TAG_member
    6405                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$40)
    6406                      .dwattr $C$DW$913, DW_AT_name("speed_outMax_pu")
    6407                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_speed_outMax_pu")
    6408                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    6409                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    6410              $C$DW$914       .dwtag  DW_TAG_member
    6411                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$76)
    6412                      .dwattr $C$DW$914, DW_AT_name("flag_enableCurrentCtrl")
    6413                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    6414                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    6415                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    6416                      .dwendtag $C$DW$T$77
    6417              
    6418              $C$DW$T$268     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    6419                      .dwattr $C$DW$T$268, DW_AT_type(*$C$DW$T$77)
    6420                      .dwattr $C$DW$T$268, DW_AT_language(DW_LANG_C)
    6421              $C$DW$T$269     .dwtag  DW_TAG_pointer_type
    6422                      .dwattr $C$DW$T$269, DW_AT_type(*$C$DW$T$268)
    6423                      .dwattr $C$DW$T$269, DW_AT_address_class(0x20)
    6424              $C$DW$T$207     .dwtag  DW_TAG_pointer_type
    6425                      .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$77)
    6426                      .dwattr $C$DW$T$207, DW_AT_address_class(0x20)
    6427              $C$DW$T$208     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    6428                      .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$207)
    6429                      .dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
    6430              $C$DW$915       .dwtag  DW_TAG_TI_far_type
    6431                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$208)
    6432              $C$DW$T$270     .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  127

    6433                      .dwattr $C$DW$T$270, DW_AT_type(*$C$DW$915)
    6434              
    6435              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    6436                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    6437                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    6438              $C$DW$916       .dwtag  DW_TAG_member
    6439                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$27)
    6440                      .dwattr $C$DW$916, DW_AT_name("rsvd")
    6441                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_rsvd")
    6442                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6443                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    6444              $C$DW$917       .dwtag  DW_TAG_member
    6445                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$79)
    6446                      .dwattr $C$DW$917, DW_AT_name("targetProc")
    6447                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_targetProc")
    6448                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6449                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    6450              $C$DW$918       .dwtag  DW_TAG_member
    6451                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$27)
    6452                      .dwattr $C$DW$918, DW_AT_name("major")
    6453                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_major")
    6454                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6455                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    6456              $C$DW$919       .dwtag  DW_TAG_member
    6457                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$27)
    6458                      .dwattr $C$DW$919, DW_AT_name("minor")
    6459                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_minor")
    6460                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6461                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    6462                      .dwendtag $C$DW$T$80
    6463              
    6464              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    6465                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$80)
    6466                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    6467              $C$DW$T$276     .dwtag  DW_TAG_pointer_type
    6468                      .dwattr $C$DW$T$276, DW_AT_type(*$C$DW$T$45)
    6469                      .dwattr $C$DW$T$276, DW_AT_address_class(0x20)
    6470              
    6471              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    6472                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    6473                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    6474              $C$DW$920       .dwtag  DW_TAG_member
    6475                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$82)
    6476                      .dwattr $C$DW$920, DW_AT_name("spiHandle")
    6477                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_spiHandle")
    6478                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6479                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    6480              $C$DW$921       .dwtag  DW_TAG_member
    6481                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$84)
    6482                      .dwattr $C$DW$921, DW_AT_name("gpioHandle")
    6483                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_gpioHandle")
    6484                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6485                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    6486              $C$DW$922       .dwtag  DW_TAG_member
    6487                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$86)
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  128

    6488                      .dwattr $C$DW$922, DW_AT_name("gpioNumber")
    6489                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_gpioNumber")
    6490                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6491                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    6492              $C$DW$923       .dwtag  DW_TAG_member
    6493                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$76)
    6494                      .dwattr $C$DW$923, DW_AT_name("RxTimeOut")
    6495                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_RxTimeOut")
    6496                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6497                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    6498              $C$DW$924       .dwtag  DW_TAG_member
    6499                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$76)
    6500                      .dwattr $C$DW$924, DW_AT_name("enableTimeOut")
    6501                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_enableTimeOut")
    6502                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6503                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    6504                      .dwendtag $C$DW$T$87
    6505              
    6506              $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    6507                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$87)
    6508                      .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    6509              $C$DW$T$158     .dwtag  DW_TAG_pointer_type
    6510                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$87)
    6511                      .dwattr $C$DW$T$158, DW_AT_address_class(0x20)
    6512              $C$DW$T$159     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    6513                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$158)
    6514                      .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    6515              
    6516              $C$DW$T$98      .dwtag  DW_TAG_structure_type
    6517                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    6518                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
    6519              $C$DW$925       .dwtag  DW_TAG_member
    6520                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$89)
    6521                      .dwattr $C$DW$925, DW_AT_name("DRV8301_CURRENT")
    6522                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    6523                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6524                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    6525              $C$DW$926       .dwtag  DW_TAG_member
    6526                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$91)
    6527                      .dwattr $C$DW$926, DW_AT_name("DRV8301_RESET")
    6528                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_DRV8301_RESET")
    6529                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6530                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    6531              $C$DW$927       .dwtag  DW_TAG_member
    6532                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$93)
    6533                      .dwattr $C$DW$927, DW_AT_name("PWM_MODE")
    6534                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_PWM_MODE")
    6535                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6536                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    6537              $C$DW$928       .dwtag  DW_TAG_member
    6538                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$95)
    6539                      .dwattr $C$DW$928, DW_AT_name("OC_MODE")
    6540                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_OC_MODE")
    6541                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6542                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  129

    6543              $C$DW$929       .dwtag  DW_TAG_member
    6544                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$97)
    6545                      .dwattr $C$DW$929, DW_AT_name("OC_ADJ_SET")
    6546                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    6547                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6548                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    6549                      .dwendtag $C$DW$T$98
    6550              
    6551              $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    6552                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
    6553                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    6554              
    6555              $C$DW$T$107     .dwtag  DW_TAG_structure_type
    6556                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    6557                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
    6558              $C$DW$930       .dwtag  DW_TAG_member
    6559                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$100)
    6560                      .dwattr $C$DW$930, DW_AT_name("OCTW_SET")
    6561                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_OCTW_SET")
    6562                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6563                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    6564              $C$DW$931       .dwtag  DW_TAG_member
    6565                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$102)
    6566                      .dwattr $C$DW$931, DW_AT_name("GAIN")
    6567                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_GAIN")
    6568                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6569                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    6570              $C$DW$932       .dwtag  DW_TAG_member
    6571                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$104)
    6572                      .dwattr $C$DW$932, DW_AT_name("DC_CAL_CH1p2")
    6573                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    6574                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6575                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    6576              $C$DW$933       .dwtag  DW_TAG_member
    6577                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$106)
    6578                      .dwattr $C$DW$933, DW_AT_name("OC_TOFF")
    6579                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_OC_TOFF")
    6580                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6581                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    6582                      .dwendtag $C$DW$T$107
    6583              
    6584              $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    6585                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
    6586                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    6587              
    6588              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    6589                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    6590                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
    6591              $C$DW$934       .dwtag  DW_TAG_member
    6592                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$76)
    6593                      .dwattr $C$DW$934, DW_AT_name("FAULT")
    6594                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_FAULT")
    6595                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6596                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    6597              $C$DW$935       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.9 Mon Jan 25 16:25:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\BenBracy\AppData\Local\Temp\2925210                         PAGE  130

    6598                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$76)
    6599                      .dwattr $C$DW$935, DW_AT_name("GVDD_UV")
    6600                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_GVDD_UV")
    6601                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6602                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    6603              $C$DW$936       .dwtag  DW_TAG_member
    6604                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$76)
    6605                      .dwattr $C$DW$936, DW_AT_name("PVDD_UV")
    6606                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_PVDD_UV")
    6607                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6608                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    6609              $C$DW$937       .dwtag  DW_TAG_member
    6610                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$76)
    6611                      .dwattr $C$DW$937, DW_AT_name("OTSD")
    6612                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_OTSD")
    6613                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6614                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    6615              $C$DW$938       .dwtag  DW_TAG_member
    6616                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$76)
    6617                      .dwattr $C$DW$938, DW_AT_name("OTW")
    6618                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_OTW")
    6619                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6620                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    6621              $C$DW$939       .dwtag  DW_TAG_member
    6622                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$76)
    6623                      .dwattr $C$DW$939, DW_AT_name("FETHA_OC")
    6624                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_FETHA_OC")
    6625                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6626                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    6627              $C$DW$940       .dwtag  DW_TAG_member
    6628                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$76)
    6629                      .dwattr $C$DW$940, DW_AT_name("FETLA_OC")
    6630                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_FETLA_OC")
    6631                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6632                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    6633              $C$DW$941       .dwtag  DW_TAG_member
    6634                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$76)
    6635                      .dwattr $C$DW$941, DW_AT_name("FETHB_OC")
